[
    {
        "Subreddit": "Fraudsters",
        "Title": "https://cashswiper.sellauth.com/",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2024-11-26 22:08:27",
        "Post Content": "",
        "URL": "https://www.reddit.com/r/Fraudsters/comments/1h0ob5w/httpscashswipersellauthcom/"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "Idaho woman faked husband's drowning after her $570,000 fraud was exposed",
        "Score": 0,
        "Comments": 0,
        "Post Time": "2024-10-13 12:25:18",
        "Post Content": "",
        "URL": "https://www.themirror.com/news/us-news/lori-isenberg-faked-husbands-drowning-745785"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "International email scam",
        "Score": 7,
        "Comments": 2,
        "Post Time": "2024-08-10 06:35:04",
        "Post Content": "",
        "URL": "https://www.interpol.int/News-and-Events/News/2024/Police-recover-over-USD-40-million-from-international-email-scam"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "Where to report fraud.",
        "Score": 6,
        "Comments": 3,
        "Post Time": "2024-06-08 14:34:59",
        "Post Content": "",
        "URL": "https://reportfraud.ftc.gov/"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "India's wealthiest person saw his fortune take a hit on Wednesday after a famed U.S. short-seller accused him of “Pulling the Largest CON in Corporate History.”",
        "Score": 8,
        "Comments": 5,
        "Post Time": "2023-01-26 01:52:26",
        "Post Content": "",
        "URL": "https://finance.yahoo.com/news/one-wall-street-most-feared-161634979.html"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "Paper deposit ✅ method nfs",
        "Score": 18,
        "Comments": 19,
        "Post Time": "2023-01-24 18:21:01",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/10kc5a8"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "Credit scam",
        "Score": 10,
        "Comments": 16,
        "Post Time": "2022-12-25 05:33:44",
        "Post Content": "I need advice, my best friend came to me and told me that she stole her friends credit card and bought gift cards worth $500. However, her friend is also my friend and she doubts that my best friend took her credit card because we were all together the day of the transaction as well as my best friend isn’t that close to this friend as I am so she thinks it’s my best friend. As she called the bank she got her money back but now she wants to file a police report to find out who was behind this. What should my best friend do? Go tell her the truth? What’s the worst case scenario here? Will the police do anything for a situation like this where fraud is only $500 as well as the bank has already refunded the victim? \n\nThis is Ontario Canada.",
        "URL": "https://www.reddit.com/r/Fraudsters/comments/zurju6/credit_scam/"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "Hello I need help knowing if this is legit or not, context a sugar daddy sent me checks and I scanned them but they got delayed so I was pretty sure he was a fraud. I blocked him and days later I get this? To my understanding they don't send mass emails and if they did they would have files attached",
        "Score": 6,
        "Comments": 23,
        "Post Time": "2022-12-07 10:44:56",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/zey2lp"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "In the 1990's a man called Ramar Pillai From Tamil Nadu created headlines after he claimed to have invented a #herbalpetrol '. He started a company, Ramar Biofuel Private Ltd. and began selling his product and has been sentenced to three years imprisonment by a CBI court in this cheating case.",
        "Score": 1,
        "Comments": 1,
        "Post Time": "2022-12-03 16:35:54",
        "Post Content": "",
        "URL": "https://www.indiatimes.com/news/india/ramar-pillai-the-inventor-of-herbal-fuel-sentenced-to-three-years-imprisonment-for-fraud-263585.html"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "Please help!! Got scammed on marketplace shopping, 500$ for a fake, any recommendation?",
        "Score": 2,
        "Comments": 9,
        "Post Time": "2022-12-02 19:58:52",
        "Post Content": "Sad story, I bought a Thom Browne sweater from a person on social media, who claimed the product to be authentic (original price around 1000$) which she purchased from Vancouver Holts Renfrew. Thus, I e-transferred 500$ to the guy.\n\nSince the guy is located in Vancouver and I m in Toronto, the sweater was mailed to me. When I received the item it was very roughly made and is 100% fake. I also paid someone to check and it is indeed counterfeit.\n\nNow the scammer has blocked me and changed the username, I do have the name, email, and phone number of the guy though. \n\nIs there anyway I can trace my money back?? I am trying to contact the bank fraud department to see if there is any way..\n\nThank you!!!",
        "URL": "https://www.reddit.com/r/Fraudsters/comments/zavujh/please_help_got_scammed_on_marketplace_shopping/"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "Nick Peronace of Nevvus International is a FRAUD",
        "Score": 2,
        "Comments": 3,
        "Post Time": "2022-10-27 23:53:08",
        "Post Content": "",
        "URL": "https://www.reddit.com/r/Fraudsters/comments/yf7jgv/nick_peronace_of_nevvus_international_is_a_fraud/"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "Wells Fargo Crimes/ Judges help Wells Fargo Stealing homes/ Wells Fargo Scams",
        "Score": 2,
        "Comments": 2,
        "Post Time": "2022-09-21 14:46:00",
        "Post Content": "",
        "URL": "https://youtu.be/SuZ9JoKJFtc"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "Sige Arsene Mierantsa Onca - Fraudster",
        "Score": 7,
        "Comments": 1,
        "Post Time": "2022-07-26 14:19:17",
        "Post Content": "\n/u/SigeArseneMierantsa - who goes variously by \"Arsene Onca\", \"Sige Arsene Onca\", \"Sige Arsene Mierantsa Onca\", and other variations - is an international fraudster who has been running a global Ponzi scheme for several years now.\n\nI know, I'm a Canadian lawyer who successfully sued him and recovered for one of his victims, and tried to help many others until Mr. Onca fled the country to escape multiple criminal arrest warrants and to avoid serving a jail sentence for contempt of court. He has left a long trail of victims, most of whom lost their life savings. I am continuing to do what I can to hunt this asshole down and recover the funds lost by his investors.\n\nLink to my website alert page on this monster: https://ciarabellinicom.wordpress.com/\n\nSee also this page on Canadian Fraud News: https://www.canadianfraudnews.com/information-wanted-on-sige-arsene-onca-of-leading-way-performance-inc-and-onca-capital-inc/\n\nDo not be fooled by this trickster - he is nothing but a conman and a ",
        "URL": "https://www.reddit.com/r/Fraudsters/comments/w8l0ij/sige_arsene_mierantsa_onca_fraudster/"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "How Donald Trump Jr. Promised—and Failed—to House the World’s Poor",
        "Score": 4,
        "Comments": 1,
        "Post Time": "2022-07-23 14:14:40",
        "Post Content": "",
        "URL": "https://newrepublic.com/article/166876/donald-trump-jr-titan-atlas-housing-poor?u"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "[Academic] Online fraud victims needed for research (UK only)",
        "Score": 2,
        "Comments": 5,
        "Post Time": "2022-07-21 09:48:50",
        "Post Content": "Hi everyone. I am looking for people to chat with me for maximum 20 mins using Zoom or Microsoft Teams about their previous experience with online fraud. If you have experienced one or more and would be willing to chat with me please let me know. You can message me here or on my email at [w1842671@my.westminster.ac.uk](mailto:w1842671@my.westminster.ac.uk)\n\nThanks so much guys :)",
        "URL": "https://www.reddit.com/r/Fraudsters/comments/w4ckel/academic_online_fraud_victims_needed_for_research/"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "Dressupservices.com",
        "Score": 3,
        "Comments": 1,
        "Post Time": "2022-07-06 06:20:44",
        "Post Content": "Dressupservices.com has there whole website set up to be wayfair they are a scam they also have another website called https://www.earption.com/ \n\nBoth are pretending to be wayfair so please beware and make sure that you are actually on wayfair by checking the website. My husband is works in law enforcement and I have already taken the steps to get the websites shut down",
        "URL": "https://www.reddit.com/r/Fraudsters/comments/vsj741/dressupservicescom/"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "We Need Your Vote to fight fraud",
        "Score": 0,
        "Comments": 1,
        "Post Time": "2022-06-22 19:15:12",
        "Post Content": "As every year, venturelab elects the top 100 Swiss Startups. It’s our goal to be on this list and become the winner in the “security” vertical this year. \n\nFor that, we NEED YOUR VOTE => please click here [https://www.startup.ch/Cybera](https://www.startup.ch/Cybera) then on VOTE NOW. Please do this today, as the deadline for voting is coming up. It will only take few seconds.",
        "URL": "https://www.reddit.com/r/Fraudsters/comments/vicz4u/we_need_your_vote_to_fight_fraud/"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "How to avoid Online Matrimonial fraud",
        "Score": 1,
        "Comments": 2,
        "Post Time": "2022-04-26 07:20:16",
        "Post Content": " **Online matrimony is booming but with the increased number of online matrimony portals, it's getting difficult to find a genuine one. Scammers have been exploiting the vulnerabilities in the process and have become more efficient as well. So, here we are discussing some awesome tips to help you find a perfect platform.** \n\nRead the article:- [How to avoid Online Matrimonial fraud](https://www.truelymarry.com/blog/how-to-avoid-online-matrimonial-fraud)",
        "URL": "https://www.reddit.com/r/Fraudsters/comments/uc6w2z/how_to_avoid_online_matrimonial_fraud/"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "Madyson Marquette is a Fraud..money is always involved with these frauds... current lists of investigations.",
        "Score": 11,
        "Comments": 3,
        "Post Time": "2022-02-10 06:43:46",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/sp0128"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "I have purchased a product from FUTURE FORWARD DELHI based Photography equipment shop , after 10 days I have got a torn used box with a old lens , 82000/- INR WASTED ,please review make them famous with 1 star",
        "Score": 5,
        "Comments": 2,
        "Post Time": "2021-07-19 06:49:41",
        "Post Content": "",
        "URL": "https://g.page/future-forward-new-delhi?share"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "This is huge!",
        "Score": 2,
        "Comments": 1,
        "Post Time": "2021-06-10 18:36:47",
        "Post Content": "",
        "URL": "https://theedtemple.blogspot.com/2021/06/blog-post_9.html"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "Take quiz on Dr Bryne. The Deep Rig",
        "Score": 2,
        "Comments": 1,
        "Post Time": "2021-06-06 03:49:03",
        "Post Content": "",
        "URL": "https://www.wikispeedia.org/wordpress/wp-content/the_deep_rig.txt"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "A Massive Fraud Operation Stole Millions From Online Bank Accounts",
        "Score": 2,
        "Comments": 1,
        "Post Time": "2020-12-21 05:30:43",
        "Post Content": "",
        "URL": "https://www.wired.com/story/massive-fraud-operation-stole-millions-online-bank-accounts/"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "Fraudsters Podcast Episode 17: Barry Minkow Part I – ZZZZ Best Carpet Cleaning and ZZZZ Worst Fraudster",
        "Score": 4,
        "Comments": 3,
        "Post Time": "2020-12-18 08:44:14",
        "Post Content": "",
        "URL": "https://open.spotify.com/episode/75aFb4ZGyPoyy3gIDK6RX1?si=pWvMufmtTsWcf9TfH6aPTA"
    },
    {
        "Subreddit": "Fraudsters",
        "Title": "How fraudsters make money? And how to protect against them?",
        "Score": 5,
        "Comments": 2,
        "Post Time": "2020-10-04 11:45:13",
        "Post Content": "",
        "URL": "https://www.adjust.com/blog/how-fraudsters-make-money/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Help, is this a scam? - American Inheritance Group.com",
        "Score": 6,
        "Comments": 5,
        "Post Time": "2024-08-02 13:20:14",
        "Post Content": "I am hoping someone here can help me, this is an urgent issue. My elderly parents were contacted by the American Inheritance Group (link below) saying that my mom's sister never claimed her inheritance from my grandmother. My mom's sister has been estranged from the family for many years and we can not contact her. Now the Company is asking for my Mom's SSN (it has been a couple of days of \"working\" with the company) and I am begging her not to do it but she won't listen because the Company told her details about her sister that she thinks are not easily found (in truth they could all be found from public records). Has anyone ever worked with this company... are they legit? \n\nTLDR; elderly parents are being told estranged sister never claimed inheritance from potential scam company\n\namericaninheritancegroup(dot)com",
        "URL": "https://www.reddit.com/r/Scams/comments/1ei9vz0/help_is_this_a_scam_american_inheritance_groupcom/"
    },
    {
        "Subreddit": "Scams",
        "Title": "PSA: Los Angeles Wildfires",
        "Score": 100,
        "Comments": 9,
        "Post Time": "2025-01-10 06:00:43",
        "Post Content": "Devastating fires has completely decimated parts of Los Angeles over the past few days. Estimates put the damages in the tens of billions of dollars, people lost their homes, and the death toll is currently at 10 people. These wildfires are the most destructive fires the area has ever seen.\n\nWhile horrific events like this can bring people together, it also brings out the worst in some people. Scammers love to piggyback on tragedies to prey on the compassion of others, and we've seen it recently in times of war or natural disasters. They will be out in full force to grift and steal resources from the people and organizations who need them the most right now.\n\nWhen donating to causes supporting those impacted by the fires, be sure to have some form of vetting process. If you're trying to make an online donation, double check the URL for the organization is correct. Be careful with promoted results in Google searches; scammers love to buy ads to boost their scam sites in Google searches.",
        "URL": "https://www.reddit.com/r/Scams/comments/1hxxv68/psa_los_angeles_wildfires/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Update: My niece tried to deposit a check from a stranger online. Instead, funds were removed from her account.",
        "Score": 435,
        "Comments": 48,
        "Post Time": "2025-01-31 21:37:26",
        "Post Content": "[Update to a previous post here](https://www.reddit.com/r/Scams/comments/1idz5i6/my_niece_tried_to_deposit_a_check_from_a_stranger/)\n\nA couple people in the previous thread asked me to report back on what happened, so here it is. \n\nIn summary: My 16 year old niece tried to join a Sugarbaby site and immediately got scammed.  The scammers sent her a check for $1500 that she attempted to deposit.  The only smart thing she did here was \\*not\\* sending money back to the scammer when he requested it (thank god), but the bank preemptively removed the funds before the check processed, overdrawing the account, and put a hold on the account for attempting to deposit a fraudulent check.  \n\nThe update:  This morning, the bank finally allowed the check to clear, which put her account back at the initial value on the account.  As speculated in the thread, it appears that one of the banks fraud features is to deduct the value from the account before the check clears, so that the account holder can't ",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieq2f2/update_my_niece_tried_to_deposit_a_check_from_a/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Moms husband is in a romance scam. HELP.",
        "Score": 52,
        "Comments": 63,
        "Post Time": "2025-01-31 21:24:51",
        "Post Content": "So my mom, in her 80s, found out her husband, also in his 80s, is in an online 'relationship' with a 'woman' in her 40s, who is rich, beautiful  and lives across the United States from him.  Apparently he sent her 3K in Bitcoin.  My mom confronted him, he didn't deny it and said he wasn't going to stop and absolutely does not think it's a scam.  We all know it is.  My mom is married to him but they are not financially connected.  She owns the house and has her own bank accounts.  I told her she needs to call his brother and his son and tell them what is going on so they can confront him.  Any advice on this?  This is quite scary and considering he was a very successful engineer back in the day, he's proven to be quite dumb to fall for this very common scam.  Considering my mom isn't connected financially, are there any steps she should take to protect herself? Other then leaving him.......",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieprxm/moms_husband_is_in_a_romance_scam_help/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Man called parents claiming I am talking to his sister",
        "Score": 53,
        "Comments": 30,
        "Post Time": "2025-01-31 20:49:54",
        "Post Content": "Last night at around 10 pm, my dad received a phone call from someone who knew info like his name and address and etc and told him that his son (me) has been talking to his sister and “causing her issues”. He gave his name and the name of the sister, and I have never heard of either of them in my life. At some point during the call he made a threat like “I hope nothing bad happens to him” but I believe he wasn’t really threatening beyond that. Soon after calling my dad, he called my mom, and knew information about her like her name address and that she was previously married to my dad. On this phone call, he gave some slightly different information, saying that the sister is 15 years old and that I have been texting her, and asking my mom to tell me to stop texting her because she is underage.\n\nI am not talking to, know anybody, or even texting any females beyond my girlfriend, let alone someone who matches the name and things this guy was saying.\n\nSince I know for a fact that I am not",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieoy31/man_called_parents_claiming_i_am_talking_to_his/"
    },
    {
        "Subreddit": "Scams",
        "Title": "I believe this is a scam",
        "Score": 10,
        "Comments": 12,
        "Post Time": "2025-02-01 01:45:02",
        "Post Content": "I received a call on my mobile number saying this was an urgent matter in DeKalb County and that they were processing a complaint against me. They left a reference number and a callback number of (888) xx -xxxx, but the number they called from was (229) xxx-xxxx. I did a reverse lookup on the callback number; it's listed as toll-free and the name is not available. I also looked up the name he left, A&A is indeed a Processing Service.\n\nAt the age of 65+, I don't owe anyone and don't have any past-due or outstanding debts. I don't know what's going on, but I believe this is a scam. I don't think I should return that call. Can you please advise me?",
        "URL": "https://www.reddit.com/r/Scams/comments/1ievfen/i_believe_this_is_a_scam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Law Firm Scam: Watch out for wire fraud",
        "Score": 29,
        "Comments": 10,
        "Post Time": "2025-01-31 18:40:21",
        "Post Content": "I work at a mid size law firm. A potential client contacted us with an email address that matched the Company's name. The Company has a legit website and is registered in the state. The potential client wanted help with a purchase and sale agreement for equipment. We agreed to represent him with a retainer paid up front. Next we know the \"buyer\" has sent us a check (not wire) for the amount of the equipment, plus the amount of our retainer. We were told to take the retainer out of the equipment amount. We put the check in the account. \n\nThe client starts hounding us to finish the work and wire him the money for the purchase. We inform him we cant do anything until the check clears. He is very upset arguing that we are stealing his money and wants the wire for the amount less the retainer. At this point we know something is up and, shocker, the check bounces. \n\nWe call the phone number on the Company's website, instead of the cell we were given, and speak to the real person. He said tha",
        "URL": "https://www.reddit.com/r/Scams/comments/1ielvgn/law_firm_scam_watch_out_for_wire_fraud/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Compensating scam victims by scamming them again",
        "Score": 66,
        "Comments": 22,
        "Post Time": "2025-01-31 13:34:11",
        "Post Content": "Checking my junk folder and found this email. They have a list from a bank in Spain (I do not\nlive in Spain nor have a bank account there) that’s compensating previously scammed victims. To get your compensation, you have to send them your wire transfer or ATM card details. You’d think they’d realize if you’d been previously scammed, you wouldn’t send your bank information again but they are probably banking on using the “International Monetary Fund” to validate themselves. \n\nIt’s still baffles me how people fall for these when there’s a so many red flags. The IMF’s name isn’t capitalized, there’s a weird gap in the middle of the paragraph, the bank they named is not even in Spain, and more. Thankfully, I know better and just deleted the email and moved on. Stay vigilant out there people!! ",
        "URL": "https://i.redd.it/7x06w13x0cge1.jpeg"
    },
    {
        "Subreddit": "Scams",
        "Title": "Is this TaskScam or no?",
        "Score": 2,
        "Comments": 4,
        "Post Time": "2025-02-01 07:33:51",
        "Post Content": "https://preview.redd.it/zrr92dkvbhge1.png?width=1289&format=png&auto=webp&s=5067ce227856a091ea4a204022e371df65c2b7bc\n\nHi, one of a friend of mine inviting me to join this for \"small profit\" they says. But this reeks way too suspicious for me. First of all, they gave me the website, its called, tkwholesalesusw(dot)org. The small symbol (you know, the one on the tab thing, is way to blurred to be recognized). i tried to type on internet to check the domain, nothing comes out of it. Next is I want to check if I can register myself. IT HAS TO HAVE INVITATION CODE. really? what kind of e-commerce web needs to have invitation code? even my amazon and ebay doesn't need one. and last I tried to dig it from themselves, and yeah. i have to \"pre-paid\" my order first. \n\nWhat\\`d you guys think?\n\ni think this is a big no and I'm sharing this for you guys too",
        "URL": "https://www.reddit.com/r/Scams/comments/1if199g/is_this_taskscam_or_no/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Please read this i need help my mom is being conned with onecoin",
        "Score": 4,
        "Comments": 8,
        "Post Time": "2025-02-01 00:45:45",
        "Post Content": "So i dont even know how to start this. Ive lately found out that my mom put 1k into onecoin (a KNOWN fraudulent criptocurency) 8 years ago and shes still in touch with the fucking cunt who dragged her into this and with their sites. Her whole career is being an ambassador of their or i dont even know but she has a  facebook account dedicated to it and posts about this criptocurency and their new platform of exchanging thei currency for objects and services. Itc called deal shaker. A very VERY sketchy app/website i dont what what it is. \n\nIm very scared bc ive showed my mom reviews from real people saying it takes money out of rheir accounts and just all kinds of things which clearly indicates its a fucking scam and shes still saying everything on the internet is fake. Ive showed her the countless articles advising against it. Shes well aware that the founder is on the runs and the cofounder pledged guilty for money laundering and fraud. \n\nShes said she has no intention in putting in mo",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieu913/please_read_this_i_need_help_my_mom_is_being/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Got contacted by an IC3 worker",
        "Score": 5,
        "Comments": 7,
        "Post Time": "2025-02-01 00:38:15",
        "Post Content": "Is there anything I should be worried about? I put in an ic3 report about 2 months ago, since then I haven’t had any contact with ic3 or any other help source I used. Today I got a call and email from them saying it has been made available to Federal Liaison. Does this mean anything at all I don’t want to be involved with any legal honestly didn’t know what to expect when i reported. I haven’t had any other issues regarding that report and as far as i know it’s over on my end. hear that they don’t ever take action, I never reported to anything to the  local police either just ic3. In the email it did say they had no more public information that they could give to me but I could be in contact with a Liaison if more information is needed. Does that mean it’s an open case? ",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieu3fl/got_contacted_by_an_ic3_worker/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Job offer for a remote social media position, is this sus?",
        "Score": 2,
        "Comments": 19,
        "Post Time": "2025-02-01 06:11:41",
        "Post Content": "I am a college student about to graduate and  have been applying for jobs. I got reached out to by a recruiter via email about a remote social media manager job. Had submit my resume, after that they had me answer some screening questions about Social media marketing. Few days letter after doing this they offer me a job… I’m in disbelief, I’ve had so many scammy or multi level marketing schemes try to get me to woe for them that it seems too good to be true. I just have no idea. Pease help. All the attachments are below.  ",
        "URL": "https://www.reddit.com/gallery/1if032y"
    },
    {
        "Subreddit": "Scams",
        "Title": "Cashiers Check with a twist?",
        "Score": 15,
        "Comments": 113,
        "Post Time": "2025-01-31 18:33:18",
        "Post Content": "I had an item listed on eBay for $2500. The guy messaged me and asked if I’d take $2100 to “help a disabled guy out”. I said I’d take $2100 with no eBay fees and asked where he lives.\n\nHe’s about 70 miles from me and after explaining I have a newborn he said he could drive to me. Here’s where it gets fishy:\n\nHe says he has a trustee account and can’t withdraw cash, but can do a cashiers check. I told him that seems a little sketchy. He said he understands but said I could even go to the bank with him and be present when he gets it to make sure it’s legit. \n\nNow I know typically cashiers checks are scams, but I thought the scam is they send you a fake one? If I’m at the bank with him and they make the check then I hand it right back to deposit it into my account is there any risk?\n\nThanks in advance \n\nEDIT: https://www.reddit.com/r/Scams/s/DgTB7ef5JV found this post where the top comments are saying if you are present when the cashier check is being created and it never leaves your sigh",
        "URL": "https://www.reddit.com/r/Scams/comments/1ielpfu/cashiers_check_with_a_twist/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Tik tok Life insurance remote sales",
        "Score": 2,
        "Comments": 14,
        "Post Time": "2025-02-01 05:32:56",
        "Post Content": "Hello everyone, I recently stumbled upon a Tik tok account of a dude (around 18-23) who is selling life insurance and looking to train people “for free”. His account is filled with pictures at nice hotels/ houses and driving around in nice cars. I dmed him and and somewhat showed a bit of hesitation and worry and he starts telling me how im disrespecting someone who’s willing to give me a job. No matter what I said or how I worded that I’m not accusing him of being a scammer, I’m just nervous, he kept on taking it personal telling me he has over 100 DMs a day and I’m being disrespectful. \n\nWith that being said, he’s still asking for my phone number to give me a call to see if I’m “fit for the team and worth getting trained for free” I went thru his following and he has like 5 buddies (all the same age) who also have Extremly similar accounts all saying the same things. They are real accounts, with videos and what not. Not just fake pictures and Tik tok slide shows. It’s always them in ",
        "URL": "https://www.reddit.com/r/Scams/comments/1iezhar/tik_tok_life_insurance_remote_sales/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Paid restaurant reviews scam?",
        "Score": 2,
        "Comments": 4,
        "Post Time": "2025-02-01 05:29:59",
        "Post Content": "Got a text recently on whatsapp to do paid positive reviews for a restaurant,I assume it's fake cause no way they giving out money for this shit",
        "URL": "https://www.reddit.com/r/Scams/comments/1iezfkc/paid_restaurant_reviews_scam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "My niece tried to deposit a check from a stranger online. Instead, funds were removed from her account. What now?",
        "Score": 617,
        "Comments": 224,
        "Post Time": "2025-01-30 22:14:53",
        "Post Content": "EDIT:  [Update Here ](https://www.reddit.com/r/Scams/comments/1ieq2f2/comment/maad3tv/?context=3)\n\n\\---\n\nSo my idiotic high school-aged niece decided to get into the Sugarbaby game and immediately got scammed. (Don't worry, we'll have quite a long talk about the ramifications of this and she'll be having her technology locked down for A WHILE.)\n\nShe spoke to two individuals who both sent her checks for $1500. These checks were digital - an image of the check that was already signed on the back for her with her name.\n\nThe first check initially showed as \"Pending,\" then the next day $1500 was pulled out of her account. The second check is currently sitting \"On Hold,\" apparently because her account is restricted from the first check.\n\nShe is currently overdrafted by about $1150 (the initial amount in her account minus $1500).\n\n**ETA: Important to note - She did not send any money back to the scammer, like a typical fake check scam.  I went through her texts/account transaction history and",
        "URL": "https://www.reddit.com/r/Scams/comments/1idz5i6/my_niece_tried_to_deposit_a_check_from_a_stranger/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Debt Consolidation Scam? My mother is out of thousands and can't pay her mortage",
        "Score": 7,
        "Comments": 10,
        "Post Time": "2025-01-31 21:08:14",
        "Post Content": "This is all told from my mother's POV so sorry if I can't answer details. So my mother was Googling loan consolidation because she doesn't have the best credit, and found one named Lending Tree. They sent her unsolicited email to her inbox. She fill out the form and then the company texted her to start the process. She said the application process took about 2 days back in either November or December.\n\nShe later found out that week or two ago that she was getting emails from her bank about a dispute status. She was confused because she hasn't disputed anything recently. She further investigates and finds out her mortgage payment, plumbing payments, and 10 other payments have been disputed and reversed without her knowledge, all during the 2 days she was working with the scam Lending Tree company. The scammers must had gotten access to her bank info during this time and disputed these charges and then withdrew the credit money.\n\nNow her mortgage company is calling that she needs to back",
        "URL": "https://www.reddit.com/r/Scams/comments/1iepdr0/debt_consolidation_scam_my_mother_is_out_of/"
    },
    {
        "Subreddit": "Scams",
        "Title": "The world sucks. People suck. Out ~$7,000.",
        "Score": 159,
        "Comments": 42,
        "Post Time": "2025-01-31 04:28:50",
        "Post Content": "We are doing some improvements on our home.  We have been doing improvements on our ~100 year old house for the ~15 years we have lived here.  We have always used our local building supply store, Acme Building Supplies (fake, but fuck the Depot and Lowes).  We were planning to upgrade the last X windows (we have been doing 4-5 every year or two for the last 10 years).  We had the guys out to measure and talked about options.  They sent us the quote via email and asked for initials (note: this email was real).  We responded with the signed quote and said we would call to give our credit card info to start the procurement.  They responded within 10 minutes (note this was at 10 pm on a Thursday) that they no longer did credit cards over the phone, but we could make the deposit using a wire transfer with instructions included.  This email was allegedly fake.  The address looked like the account manager who we had years of experience with.  Susan@AcmeSupplies.com (again, fake).  We replied ",
        "URL": "https://www.reddit.com/r/Scams/comments/1ie6s1l/the_world_sucks_people_suck_out_7000/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Check Fraud in Citibank",
        "Score": 2,
        "Comments": 2,
        "Post Time": "2025-02-01 04:07:38",
        "Post Content": "Hi folks,\n\n  Here is in the US. I opened an account with Citibank in December.  Today when I logged on, I noticed two checks made to a name that I never heard of.  Altogther about 4K us dollars.  I called up the bank and file fraud dispute.  Obviously these are not my checks (I actually don't have citibank checks) and checks were to made to a guy in VA (I am in WA state).  \n  \nMy questions  \n1.  Is is likely that I don't get the provisional credit?\n\n2. citibank is not inspiring a lot of confidence.  Any resource if they drop the ball kind of?\n\n",
        "URL": "https://www.reddit.com/r/Scams/comments/1iey2fk/check_fraud_in_citibank/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Coursiv- Extremely Misleading Subscription Practices – Feels Like a Scam",
        "Score": 2,
        "Comments": 1,
        "Post Time": "2025-02-01 07:19:39",
        "Post Content": "\nI signed up for what I believed was a four-week trial at a discounted price, with no intention of continuing beyond that period. However, without any prior email or app notification, I was charged for an ongoing subscription. This is completely misleading and feels like a deliberate attempt to trap users into unexpected payments.\n\nA legitimate learning platform should be transparent about its subscription terms, not rely on vague or hidden policies to charge users without clear consent. I reached out for a refund, but the response I received only reinforced my frustration.\n\nI will make sure others in my learning community are aware of these deceptive practices. Be cautious before signing up!",
        "URL": "https://i.redd.it/bkncibb0bhge1.jpeg"
    },
    {
        "Subreddit": "Scams",
        "Title": "Got a text asking if this was the right number",
        "Score": 2,
        "Comments": 5,
        "Post Time": "2025-02-01 03:10:21",
        "Post Content": "I get a lot of scam messages and messages from debt collectors. I missed this one I got yesterday. All the text says is., is this the right number for? and it has my name. Most normal people will introduce themselves, like this is John from so-and-so. We met last week. Is anybody else getting these text sometimes? I tried looking the number up and I can’t find anything. I think it was blocking it  and reporting it as junk. ",
        "URL": "https://www.reddit.com/r/Scams/comments/1iex170/got_a_text_asking_if_this_was_the_right_number/"
    },
    {
        "Subreddit": "Scams",
        "Title": "HELP! GRINDR BLACKMAILED",
        "Score": 1,
        "Comments": 3,
        "Post Time": "2025-02-01 06:30:26",
        "Post Content": "The scariest thing happened to me today. I am very discreet and after trading several photos back and forth with a profile on grindr I was asked for my number, which I gave out. The profile seemed legit and I thought we had built trust. I woke up this morning to screenshots of all of my images, messages, my current and previous addresses as well as my families address/phone numbers, and they had record of my place of employment and colleagues. My phone was blown up with messages demanding I send $1K to a cashapp or they were going to leak everything. I deactivated all of my social profiles immediately so that I was not traceable. I called law enforcement and they looked up the number and it was not traceable, likely using a VPN. He told me he started sending them out and was going to mail copies to my family. Has this happened to anyone else? Did they follow through with the blackmail? Very scared right now. Wanted to see if this is happening with anyone else. ",
        "URL": "https://www.reddit.com/r/Scams/comments/1if0d16/help_grindr_blackmailed/"
    },
    {
        "Subreddit": "Scams",
        "Title": "4 g v . m e scam investigation",
        "Score": 0,
        "Comments": 7,
        "Post Time": "2025-02-01 06:23:14",
        "Post Content": "I downloaded tiktok for the first time (because it was getting banned) and one of the first videos I saw was a video of a roller coaster but a screenshot of a roblox charecter getting fucked \nWith 4 g v . M e in a search bar flashed on screen for a second. So I searched it and it said download roblox x mode and I don't press download because I don't want a virus over roblox porn so I search roblox x mode and 4gv.me on multiple platforms too seriously if anyone else has had the same experience but no( im not surprised because the video only had like one comment)\n\nSo can someone that doesn't care if they get a virus or has more info on how to avoid getting viruses download it or something",
        "URL": "https://www.reddit.com/r/Scams/comments/1if098z/4_g_v_m_e_scam_investigation/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Tobi Oluwole Course?",
        "Score": 3,
        "Comments": 11,
        "Post Time": "2025-02-01 00:21:48",
        "Post Content": "Has anyone taken any of his courses? I don't see any red flags through all of my searches but just want to check legitimacy before investing thousands of dollars in his course.\n“How to package & sell your knowledge on LinkedIn\nLearn how to turn your expertise into a coaching or consulting offer and drive high-quality leads from LinkedIn - without sending cold DMs or running ads.”",
        "URL": "https://www.reddit.com/r/Scams/comments/1ietr04/tobi_oluwole_course/"
    },
    {
        "Subreddit": "Scams",
        "Title": "A scammer offered to impersonate me for an IT job in Australia",
        "Score": 5,
        "Comments": 29,
        "Post Time": "2025-01-31 21:29:58",
        "Post Content": "I received an email (see below) from a scammer who wants me to get a coding job in Australia, let him do the work, and then split the income. I checked his Upwork and LinkedIn profiles, they look legit (he has a history of work and employment, and the name and company match the email).\n\nI have already reported this guy to upwork, linkedin, and Australian government. Please beware and REPORT!\n\n>I hope this message finds you well. My name is \\[redacted\\], and I have 8 years of experience in mobile and web development. I came across your profile on Stack Overflow and thought I’d reach out to you directly. Recently, I relocated to Taiwan due to my wife’s career, which has led to several changes in my personal and professional life. Unfortunately, this has also meant stepping away from my previous role at \\[redacted\\], a U.S.-based company.During my time here, I’ve noticed that salaries in this region tend to be lower compared to Australia. This has prompted me to seek out a collaboration o",
        "URL": "https://www.reddit.com/r/Scams/comments/1iepw8l/a_scammer_offered_to_impersonate_me_for_an_it_job/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Number keeps texting me and spam facetiming me ?!",
        "Score": 0,
        "Comments": 7,
        "Post Time": "2025-02-01 05:40:13",
        "Post Content": "I try to look up the number it says it's a valid T-Mobile number out of Kentucky. I wasn't even gonna answer but I thought it was weird. Is it someone just screwing with me or is it a scammer? Because what kind of scammer spam FaceTimes someone ? I almost answered on accident because they kept facetiming me!!! I've never seen them do that. l've had a lot of issues in the past of people pranking me. I also have a man who stalks me for years too so I get paranoid. It must be a scam talking about the money right? Idk if I should just block or what but there creeping me out and sending more and more texts. Why would a scammer just FaceTime me a bunch of times. ",
        "URL": "https://i.redd.it/t24itnp9tgge1.jpeg"
    },
    {
        "Subreddit": "Scams",
        "Title": "Musician on Instagram reached out to me with their real account -- how to tell if it's a scam/hack?",
        "Score": 3,
        "Comments": 3,
        "Post Time": "2025-01-31 23:36:51",
        "Post Content": "Hey there, didn't expect this. Forgive the vagueness on some of the details here; want to keep some things private.\n\nI received an Instagram message from a musician with about 5,000 followers in a band with 17K followers. They said they were looking for students for instrument lessons and to let them know if I'm interested. This person is very talented at their instrument and does remote private lessons with quite a few students annually. I follow this person on IG, but I have never had actual contact with them before and they don't follow me.\n\nI have 100% confirmed that this is their real account. I also messaged someone who knows the band and asked them if it's legit. When I brought it up, they thought it was a case of their account being hacked, but they reviewed the message and said that it looks \"pretty legit\". The person who messaged me is not asking for money or anything from me at the moment. They do advertise for music lessons, but cold-contacting people seems like a strange w",
        "URL": "https://www.reddit.com/r/Scams/comments/1iess9g/musician_on_instagram_reached_out_to_me_with/"
    },
    {
        "Subreddit": "Scams",
        "Title": "PSA: A Highly Sophisticated Google Account Scam You Need to Know About",
        "Score": 4,
        "Comments": 5,
        "Post Time": "2025-02-01 01:28:16",
        "Post Content": "Please note that I'm a bit high and so I voice recorded this scam that recently happened to me and had ChatGPT organize it into a Reddit post. The below is written by ChatGPT but it represents an actual highly-sophisticated scam that I nearly fell victim to. Sharing this as a PSA because I feel like a lot of people would fall for this scam.\n\nOh, and ChatGPT does a pretty decent job of capturing how realistic the scam feels, but the reality is the scam felt a lot more real than is conveyed in the content below. So keep that in mind.\n\n# TL;DR\n\nI received a call from what appeared to be Google, warning that someone had attempted to change my account’s phone number. After confirming it wasn’t me, I got a follow-up call from a “Google representative” who sounded completely legitimate and had my real account details. They used **caller ID spoofing to appear as a real Google support number**, sent a **convincing fake email**, and ultimately tried to trick me into approving a recovery request ",
        "URL": "https://www.reddit.com/r/Scams/comments/1iev3td/psa_a_highly_sophisticated_google_account_scam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "App optimization scam",
        "Score": 6,
        "Comments": 7,
        "Post Time": "2025-01-31 18:30:29",
        "Post Content": "I've been well and truly done over.. i feel stupid and so ashamed for falling for this..  they contacted me via WhatsApp through my CV which was added on cv library. First I managed the tasks fine.. got to day 5 and 800 was deposited by this time I had put in about 100. I didn't withdraw the 800 I had to add more to over come the combo task.. stupidly I have topped up with 750 today and now im -2000.. ive lost everything. I don't need to be told how stupid iam I know and I'm very ashamed of myslef. My bank cannot get it back due to it being via crypto and they are also saying they cannot help.. my question is has anyone managed to get their money? The company is called Swenson HE ",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieln0d/app_optimization_scam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Been getting calls about Texas Real Estate for a year",
        "Score": 1,
        "Comments": 2,
        "Post Time": "2025-02-01 04:48:58",
        "Post Content": "So every month or so for over a year I have been getting calls and texts about my \"inquiry\" about different properties all over Texas. The calls and texts are from actual real estate agents. I know, I contacted a few of them and explained the situation. The person used the name \"Jennifer Lopez\" on the inquiries. When I asked if they had any more info they said, \"do you have any idea how many Jennifer Lopez's there are in Texas?\" I, of corse, had to reply, \"Well, I only know one, and she is from the block\".\n\nAnyway... is this some kind of scam I should be concerned about?",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieyrbl/been_getting_calls_about_texas_real_estate_for_a/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Help me understand this Tiktok Account / Tiktok Shop “scam”",
        "Score": 0,
        "Comments": 7,
        "Post Time": "2025-02-01 04:48:47",
        "Post Content": "Hi! \n\nOn October 17th of last year I was logged out of my tiktok account. I had 2FA on and woke up with a text/code for my account, so I checked it, and when I tried to open the app I was logged out. \n\nAfter months of being in contact with them and trying to recover my account, they finally confirmed I owned it and let me back in. After checking through it, there was weird login history going back as far as October 25th. All north american states. It goes from web logins in illinois and florida, to a sign in on a Xiaomi phone in Colorado where my password and recovery info was changed. \n\nThe ONLY other thing that’s weird about my account is somebody ordered off the tiktok shop. They ordered a mop from a store called SmartSoar to an address in Miami FL, but there’s another saved address for tiktok shop in AZ. I never used tiktok shop and there is a Mastercard still saved to my account that was used for this order. \n\nI still have zero idea how anyone got into my account, let alone what t",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieyr7e/help_me_understand_this_tiktok_account_tiktok/"
    },
    {
        "Subreddit": "Scams",
        "Title": "PLEASE HELP GOT SIGNED OUT OF GMAIL DISCORD STEAM",
        "Score": 1,
        "Comments": 3,
        "Post Time": "2025-02-01 04:17:05",
        "Post Content": "It was all my fault i downloaded some sketchy zip file and unzipped it for FL studio and it wasnt working so i deleted it fast forward to 2 days later i woke up and turned on my laptop only to see i was signed out from steam discord and gmail   \n(gmail due to suspicious activity ) i immediately changed my steam discord and gmail password  \nmy gmail didnt have any fishy activity apart from a mail from gmail saying suspicious activity detected which i took care of by changing my password enabling 2 factor authentication \n\ndid the same for steam\n\nbut when i signed into discord everyone had gotten a msg from me sayin \"50$ discord gift card\" and a link too  \ni changed my disc password and deleted my disc account\n\nis there anything else i should be doing?",
        "URL": "https://www.reddit.com/r/Scams/comments/1iey89z/please_help_got_signed_out_of_gmail_discord_steam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Luxoft - scam or legit?",
        "Score": 1,
        "Comments": 3,
        "Post Time": "2025-02-01 04:03:50",
        "Post Content": "Yeah, I know this question has already been asked here https://www.reddit.com/r/Scams/comments/1d5k44n/luxoftdxc\\_company\\_scam\\_of\\_legit/. But, I'm seeing at least 20 or more Luxoft jobs on VelvetJobs.com, so I have to ask again. Is Luxoft legit, or not? These look like  legitimate jobs if they're posted on Velvet - there's things like C# Developer, .NET Developer, Senior .NET Core Developer, etc. Looks legit, but wanted to ask.",
        "URL": "https://www.reddit.com/r/Scams/comments/1iey032/luxoft_scam_or_legit/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Asianmagnet, Asianmediaset, Sparklovedating",
        "Score": 3,
        "Comments": 6,
        "Post Time": "2025-01-31 21:39:50",
        "Post Content": "I woke up to at least 7 unauthorised transactions from these 3 sites that when I check on google these websites are nonexistence or at least no info on it:\n\nHelp.smartmediaset.com (transaction from Amsterdam)\nio.sparklovedating.com\ninfo.asianmagnet.com\n\nAlready dispute the transactions with my bank.\n\nI didnt use the card for at least a week so not sure where they might get info from my card.\n\nI am currently in Japan for vacation, I did bring the car but never use it (only for emergency).\n\nAnyone else have experienced these? ",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieq4ha/asianmagnet_asianmediaset_sparklovedating/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Securities purchase scam?",
        "Score": 2,
        "Comments": 3,
        "Post Time": "2025-01-31 23:51:15",
        "Post Content": "Hello,\n\nI need some assistance in identifying if this is a scam (99.9% sure it is)\n\nMy dad had shares in a company which went insolvent. he has been pestered for years by people trying to 'buy' his worthless shares.\n\nExcept this time they've taken it up a notch and wrote out a professional looking securities purchase agreement. I can't find anything on the names in the documents, the company on the letterhead exists, but the main thing that lead me to believe it's just another scam is:\n\n1. Why would anybody want to buy his shares in a company that no longer trades, if this is even possible\n2. The contract infers they will deposit money into his account (96k) but then he owes them a 'refundable recertification fee' (7.5k) within 48 hours of payment received.\n\nSo I'm thinking the money would hit his account or they'd send him a check, he'd send the fee then the original payment bounces and ta-da he's out 7.5k right?\n\nI fully believe it's a scam but he needs convincing otherwise\n\nThanks i",
        "URL": "https://www.reddit.com/r/Scams/comments/1iet38a/securities_purchase_scam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Be aware of Scammers that send money in your bank account",
        "Score": 376,
        "Comments": 90,
        "Post Time": "2025-01-30 19:13:25",
        "Post Content": "I recently had a random person send me $500 to my bank account via Zelle. At first, I was confused because I wasn’t expecting any money, but shortly after, the sender contacted me and claimed they had made a mistake, asking me to return the funds.\n\nIf this ever happens to you, do not send the money back—this is likely a scam! Here’s how it works: Scammers often use stolen credit cards or hacked bank accounts to send money to unsuspecting people. Once you return the money, the original transaction is reversed when the fraud is discovered, meaning your own money is gone, and you could be left dealing with the consequences.\n\nWhat to Do If This Happens to You (U.S.):\nDo not send the money back. Avoid engaging with the sender.\nContact your bank immediately. Let them know about the unexpected deposit and follow their instructions.\nDo not spend the money. If the transaction is flagged as fraudulent, the bank may reverse it.\nReport the scam.\nContact your bank to report the suspicious transfer.",
        "URL": "https://www.reddit.com/r/Scams/comments/1iduu5h/be_aware_of_scammers_that_send_money_in_your_bank/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Help please, scam? Z-zenshop.com",
        "Score": 2,
        "Comments": 7,
        "Post Time": "2025-01-31 23:25:59",
        "Post Content": "Hello, the website listed in the title had a video ad on Facebook for a foldable walking pad (walking treadmill). It was a great deal, only $39.99 with thousands of likes and tons of comments. \n\nI tried to buy it, but after entering my debit card information, another window opens. It asks for permission for my bank to send me a code at my cell number. It *seemed* legit because it knew the phone number I have associated with that debit card, which is not the phone I was using or the phone number I entered when checking out. I click ok, and the bank code pops up in my text messages on that other cell number. The z-zen website wants me to enter in the code I received that seems to be from my bank. \n\nCan anyone tell me if this is a scam? I can’t really find any info on this website… thanks in advance. ",
        "URL": "https://www.reddit.com/r/Scams/comments/1iesjkk/help_please_scam_zzenshopcom/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Anyone part of this WhatsApp group Kingsford chases tipping for crypto and stocks. Careful approach is needed",
        "Score": 0,
        "Comments": 23,
        "Post Time": "2025-02-01 03:07:42",
        "Post Content": "It looks big scam is going to happen if you are in this group. They give free education on stocks and push for crypto specially bitcoin, Coinbase. Give tips on stocks but with mix of solid like Apple, Meta, but mix with some unknown to get some confidence from members. They tried to convince that stocks related to Crypto could be next big win. \n\nThey suggest some crypto related stocks as well. Also preaching about options stocks. There are different mentor who gives training like Elliot. Company name is Kingsford Chase and whatsapp group having 184 members. Few members are active and praise all mentors efforts and continuously say they are winning good profits based on the tips mentor are providing. I think they are upto a big scam where they gain trust and then pump and dump few stocks and lot the money from dump members. There are many red flags that assistant ask for screen shot for every trade you open based on their tips. \n\nThey also say they are working on trial AI stock software",
        "URL": "https://www.reddit.com/r/Scams/comments/1iewzec/anyone_part_of_this_whatsapp_group_kingsford/"
    },
    {
        "Subreddit": "Scams",
        "Title": "NDAX closed my account I never made",
        "Score": 1,
        "Comments": 1,
        "Post Time": "2025-02-01 03:00:25",
        "Post Content": "Until today I never heard of NDAX.\n\nI got an email to verify my \"new\" account, and then a warning about scams, and then a letter saying a hacker made the account and they're closing it permanently.\n\nAll this is easily explained by someone accidentally using my email address. The account was never confirmed from what I see. Can I just ignore this nonsense?\n\n===\n\n\n\n\nGood afternoon,\n\n\n\nYou are receiving this email because our security team has identified an attempt to create an account on Ndax using your email address. This attempt appears to have been made by a malicious actor, suggesting that your email may have been compromised. As part of our commitment to protecting our userbase and maintaining a secure trading environment, we will be permanently closing your account.\n\nWhat You Need to Do:\n\nTo ensure your personal information remains secure, we recommend taking the following steps:\n\nCheck for Compromised Credentials – Use tools such as Have I Been Pwned to check if your email or pass",
        "URL": "https://www.reddit.com/r/Scams/comments/1iewue6/ndax_closed_my_account_i_never_made/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Swim Recruitment Scam",
        "Score": 3,
        "Comments": 2,
        "Post Time": "2025-01-31 21:01:29",
        "Post Content": "Be careful if a person named Janvile messages you on Facebook and tells you that a recruitment center is going to contact you via WhatsApp, or if any job tells you they are going to message you on WhatsApp , it’s 100% a scam, the person that messaged me on WhatsApp said their name was Isabella Wise ‪+1 (303) 419‑1651‬ and that they worked for swim recruitment and convinced me over and over that it was legit, when I emailed the real swim recruitment they told me it’s fake and to report and block them. So be careful guys, I don’t know how these people do their scams but it’s pretty sad if they are targeting people actually looking to make money lol. ",
        "URL": "https://i.redd.it/2wo9jmwp8ege1.jpeg"
    },
    {
        "Subreddit": "Scams",
        "Title": "does anyone know about the Franki App?",
        "Score": 1,
        "Comments": 3,
        "Post Time": "2025-02-01 02:59:18",
        "Post Content": "Hi so this shouldnt take long but I found this app mostly for people who love to share food places. But theres this feature where you can earn money. It seems really iffy but idk can someone tell me if this app is a scam? ",
        "URL": "https://www.reddit.com/r/Scams/comments/1iewtml/does_anyone_know_about_the_franki_app/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Maxstechstore.com is bogus",
        "Score": 1,
        "Comments": 1,
        "Post Time": "2025-02-01 02:54:06",
        "Post Content": "Placed an order 25 days ago. Still lost to shipping, even tho they tout 7-9 day shipping time. No one responds to emails, no other way to contact. Just give me my money back, you sheisters!! Have requested money back in three different emails, zero response or follow up. THIS IS A SCAM. DO NOT DO BUSINESS WITH THEM.  ",
        "URL": "https://www.reddit.com/r/Scams/comments/1iewq6j/maxstechstorecom_is_bogus/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Received Motor Oil that I never ordered",
        "Score": 2,
        "Comments": 13,
        "Post Time": "2025-01-31 22:56:19",
        "Post Content": "I just got home from school (17 F) and my dad told me that I had a package that was delivered. \n\nI hadn’t ordered anything online in a while, but there were multiple stickers with my name + address on it so I decided to see what was inside. \n\nMotor Oil!!! A full can was sent to me by a company called “Summing Racing Equipment” customer service through FedEX. \n\nI don’t know why or how they’d have my address. I’ve ordered things off of Ebay and Mercari, but I can’t comprehend why a seller would use my address. Nothing has been charged to my card neither… What’s my next step? (Can I keep it lol)",
        "URL": "https://i.redd.it/h4ud4jf7tege1.jpeg"
    },
    {
        "Subreddit": "Scams",
        "Title": "Worried Art Commission Is a Scam",
        "Score": 1,
        "Comments": 12,
        "Post Time": "2025-02-01 02:15:03",
        "Post Content": "I'm a designer and illustrator. I was excited when someone reached out to request a commission for an anniversary invitation, citing my artstation page (where my portfolio does feature a wedding invitation I illustrated). The email exchange seemed fairly normal until today. They signed a contract which stipulated they pay 25% up front. Instead, she offered to pay everything up front. I agreed, and sent an invoice with paypal. Their response makes me really nervous:\n\n>Unfortunately the most convenient method for us to process the payment is by check, as our current banking restrictions make electronic payment unfeasible. I’ll arrange the payment to be sent to your email. You can easily deposit it using the mobile deposit feature on your mobile Banking app for a seamless transaction. Please reply with your full Name and Bank Name for the check processing and endorsement.\n\nI know email money transfers are a real thing, but it still smells fishy to me. Is this actually normal, or should I ",
        "URL": "https://www.reddit.com/r/Scams/comments/1iew001/worried_art_commission_is_a_scam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Guardian hold on card",
        "Score": 0,
        "Comments": 3,
        "Post Time": "2025-02-01 02:12:34",
        "Post Content": "This week I tried selling something on reverb, and I had a buyer, and reverb sent me a message saying that there is an offer on my product. However, it was making me verify my card to continue with the purchase and talk to the customer. It then wouldn’t take either of my cards, so it recommended getting revolut and set it up through that. I did everything it asked of me, and then I had to verify it through “Guardian”? They charged me $360 as a hold, and said if nothing went though I could get it removed from my account by Feb 8. Reverb has told me it’s a scam and to talk to my bank, but since I accepted it, they won’t do anything for me. Is guardian legit, has anyone experienced anything like this?",
        "URL": "https://www.reddit.com/r/Scams/comments/1ievybj/guardian_hold_on_card/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Watch out, artists! \"Emily Kate\" scammer on DeviantART",
        "Score": 3,
        "Comments": 9,
        "Post Time": "2025-01-31 21:20:03",
        "Post Content": "https://preview.redd.it/aekrul2jhege1.png?width=1061&format=png&auto=webp&s=98d8ac48b41036e9410e1abd08d411412c4b36aa\n\nhttps://preview.redd.it/sordjn2jhege1.png?width=1024&format=png&auto=webp&s=d16dc6f14f3efdb23dee6e8f7c6bac3b145fbee2\n\nhttps://preview.redd.it/u9cncm2jhege1.png?width=1037&format=png&auto=webp&s=5687f30b403bb31a36d89b8d4ffd0f049d9845a4\n\nhttps://preview.redd.it/nal3il2jhege1.png?width=1019&format=png&auto=webp&s=0cb6a2346fb5f608fe073bea06d326bb306ed771\n\nhttps://preview.redd.it/1lvxll2jhege1.png?width=1004&format=png&auto=webp&s=9070db410c752b41673095190519fe40b0b0be03\n\nhttps://preview.redd.it/9n59234jhege1.png?width=1017&format=png&auto=webp&s=31d8a2b4ce6ad2a5b1ff83dcc3d52099310c6efe\n\nhttps://preview.redd.it/jijiww2jhege1.png?width=1016&format=png&auto=webp&s=e8310b16ffd8343d50f06274870fe44afddaafb1\n\nhttps://preview.redd.it/t313eo2jhege1.png?width=1008&format=png&auto=webp&s=20de571b4293197c8f86eac86b35876e3eb23d0c\n\nhttps://preview.redd.it/3hut644jhege1.png?width=1005&for",
        "URL": "https://www.reddit.com/r/Scams/comments/1iepnv3/watch_out_artists_emily_kate_scammer_on_deviantart/"
    },
    {
        "Subreddit": "Scams",
        "Title": "A question regarding a parcel service that seems sketchy",
        "Score": 2,
        "Comments": 2,
        "Post Time": "2025-01-31 21:12:57",
        "Post Content": "Long story short-ish, someone tried to charge around $2000 worth of product and gift cards from places I frequent online. They gained access to my email then tried to change my passwords. They were unsuccessful with most because of my 2fa and/or 2 step verification. However, they managed to buy around $900 worth of product from a major retailer (of all places to not have 2fa or 2sv setup🙄) and they successfully placed items in carts from two other major retailers. Luckily, I had the same credit card set up as my method of payment for these retailers so they maxed it out before they could purchase anything else. (I’ve since changed passwords, added additional security to everything and went through the proper channels to dispute charges and request a new card.)\n\nSo the morons saw they forgot to change the shipping address, and they cancelled, changed the delivery address and completed the order. I checked the address and it leads to a sketch EPS Int’l courier in Miami not accredited by ",
        "URL": "https://www.reddit.com/r/Scams/comments/1iephrl/a_question_regarding_a_parcel_service_that_seems/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Is SageMaster AI/TPR/BE.club a scam?",
        "Score": 2,
        "Comments": 4,
        "Post Time": "2025-01-31 21:08:56",
        "Post Content": "Unfortunately it seems my friend, has become a large part of TPR/igenuis/SageMaster/Be.Club.\n\nThey talk about daily, about how much money they \"make\", how it's not a pyramid scheme and genuine, blah blah. I've never seen actual figures when I've asked. They've recently becoming insistent on me joining and sent me several videos where they talk about competitive advantage (but not actual substance) with wild sign up fees of $2000.\n\nTheir Instagram is full of being on sunny beaches, holiday or other retreats (they go on holiday 2-3 times a year and just uses alot of photos from those trips). \n\nWe've been friends for almost 15 years and chat daily, however, they've becoming insistent that I join as it's a genuine opportunity to start new and live my life blah blah. \n\nFrom the last video on MV trading revolution youtube, there's a sign up fee (starting at a very \"reasonable\" $1799) and monthly ongoing fee for information that appears to be largely available elsewhere.  \n\nAnd the referral s",
        "URL": "https://www.reddit.com/r/Scams/comments/1iepecs/is_sagemaster_aitprbeclub_a_scam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Help in understanding a partical scam",
        "Score": 2,
        "Comments": 5,
        "Post Time": "2025-01-31 20:44:45",
        "Post Content": "So I received a text today from a random IG \"girl\" saying that I'm cute and if we can chat in her other account \"so her tixic ex can see the messages\".\nThis is obviously a bot, but the 'main account\" is obviously not a person either because it's following 0 accounts. I ain't falling for thos crap but I'm curious: what's the scam? Classical sexting? Thank you",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieotq5/help_in_understanding_a_partical_scam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "The scammers are plugged into the \"legit\" personal data sales pipeline, example included",
        "Score": 4,
        "Comments": 18,
        "Post Time": "2025-01-31 16:48:38",
        "Post Content": "This came in an email less than an hour after I registered with the 3 credit agencies for a copy of my free credit report. I'm pretty decent at Internet \"cleanliness\" - no piracy or other high-risk usage, 100% distinct passwords for every account, 100% opt out of marketing emails, empty inbox, etc. My spam folder only has 10 or so unsolicited emails in the last 30 days. So the odds of this being a coincidence are just too low.\n\nSo uh, I guess my message is money is never free, pretty Internet strangers don't like you, and don't handle your finances via email. That and, the *system is designed to take your money and give it to the corporations*. Man I hope kids are learning this stuff in school.\n\nhttps://preview.redd.it/4tff4wlmycge1.png?width=762&format=png&auto=webp&s=595007db29090bef22384ed299404d60acb82b00\n\n",
        "URL": "https://www.reddit.com/r/Scams/comments/1iej5vl/the_scammers_are_plugged_into_the_legit_personal/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Free watch as I don’t want to pay export duty",
        "Score": 7,
        "Comments": 12,
        "Post Time": "2025-01-31 15:18:48",
        "Post Content": "Hello,\n\nI've searched all the terms I can think of and had a look at the wiki and I can't find what this scam is.\n\nI'm certain it's not anything original so apologies if it's obvious and I'm just missing it, if you could point in the right direction I'll slope off and not cause anymore noise.\n\nThis happened maybe 6 or so years ago and it's always bugged me that I couldn't see the scam.\n\n\nSo I was in a Tesco supermarket car park at about 7pm and a well dressed guy pulls up near me in a fairly nice car and asks if I'm Italian. I'm not and as far as I know don't look like I am as I'm a pasty white Scottish bloke. He then tells me he has some luxury watches that he doesn't want to pay export duty on as he has to leave to fly back to Italy tomorrow and that I could have them for free.\n\nAt this point I just walk off as I assume it's a scam. But what's bothered me since is what his angle is, he says I can have the for free there and then.\n\nI'm certain I didn't miss the opportunity of a life t",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieh2ty/free_watch_as_i_dont_want_to_pay_export_duty/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Mom fell for a scam. Any help would be appreciated. Or even just a \"me too, this sucks\"",
        "Score": 39,
        "Comments": 31,
        "Post Time": "2025-01-31 04:01:12",
        "Post Content": "My mom (61) received an email from someone claiming to be from Microsoft saying that her computer had been hacked. They told her that their accounts showed that the hackers had gotten into her bank account (not connected to her computer in any way) and had racked up almost $12,000 in charges to dating apps and porn. Additionally, they insisted that they needed full access to her computer to cleanse it from the hackers. They told her the only way to stop the charges was to withdraw the money from her bank account and transfer it into Bitcoin and that at the end of the day it would be transferred back to her bank account. They even connected her to the \"fraud detection officer\" at \"her bank.\" They made her go in person to the bank to withdraw the money and wouldn't let her hang up the phone. They told her she couldn't tell the bank teller what was happening because she could be \"in on it and needed to be investigated.\" \n\nBoth my dad and I were at work, and Mom has been in excruciating pa",
        "URL": "https://www.reddit.com/r/Scams/comments/1ie6abz/mom_fell_for_a_scam_any_help_would_be_appreciated/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Scamed out of Crypto, this is a good one",
        "Score": 0,
        "Comments": 16,
        "Post Time": "2025-02-01 07:03:49",
        "Post Content": "I have been working with a \"company\" called Data IKU. In the end if I gave false reviews they would pay me in Crypto. I played this very slow over several days and felt like it was just Black Hat marketing. I thought get it grab a few bucks and get out. At one point I was up $600. I should have pulled out but I didnt....I got greedy and tried to put one more round a d got burned. This scam went on for days, I was contacted by text from a Tallent agency so I felt a tiny bit comfortable with the interaction. I have endless what's app chats with this scammer they even called me.and talked one on one about how much I was going to make. In the end I'm out some cash and wondering if anyone can help me recover it. Here is the final shot that I knew I was screwed. I deposit $2756.35 and I could receive $780k. Yea no...Anyway please don't judge I know i messed up but at one point I was up. A yhelp would be most appreciated. ",
        "URL": "https://i.redd.it/n071muk68hge1.jpeg"
    },
    {
        "Subreddit": "Scams",
        "Title": "Not sure if its real or a scam",
        "Score": 1,
        "Comments": 13,
        "Post Time": "2025-01-31 23:04:37",
        "Post Content": "\nSo Today i got a gmail from a gmail claiming to be mr beast and that i won the iphone give away but im not really sure that it is real and i dont want to give some scam my datas the mail was \n\n\nHi!\nYou have been selected as a winner for MrBeast's iPhone 16 giveaway!\nPlease respond with your:\nFirst Name\nLast Name\nCountry\n\nCongratulations!\n\n\nWe will not be sharing your information with anyone outside our shipping partner. All collected data will be permanently deleted at the end of the giveaway. We will not be asking for any money whatsoever!\n\nIts from giveaway@mrbeastbusiness. It didnt had a profile. \n\n\n\n\n\nSorry for the bad grammar ",
        "URL": "https://www.reddit.com/r/Scams/comments/1ies2kq/not_sure_if_its_real_or_a_scam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Is rebag a scam? My friend got a remote “job” there",
        "Score": 0,
        "Comments": 35,
        "Post Time": "2025-01-31 23:02:48",
        "Post Content": "Hey, my friend got a remote \"job\" at rebag (rebag dot com) where my friend has to buy designer stuff (like prada and stuff), it gets shipped to them and then they return it and pay my friend a commission.\n\nHe has to buy the stuff with his own money! They claim that by doing this he can write good reviews (sketchy) and \"boost sales\".\n\nThis is the sketchiest \"online job\" I've heard of and he just sent his first payments last week (buying things) and they haven't paid him back.\n\nHe claims it's legit and that he vetted the place when we asked if he was sure about this place but it doesn't make sense to me.\n\nDoes anybody here have a credible source that determines whether this place is a scam or not so that I can show my friend? Or if anybody know if there is an imitation company and rebag is actually fine but the imitator is scamming my friend?\n\nThanks!",
        "URL": "https://www.reddit.com/r/Scams/comments/1ies12t/is_rebag_a_scam_my_friend_got_a_remote_job_there/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Received call claiming missing health insurance info for my PCP",
        "Score": 1,
        "Comments": 2,
        "Post Time": "2025-01-31 22:40:18",
        "Post Content": "I received a phone call (indian guy)  that claimed that my primary care provider was missing my health insurance information. They had my name as well as the name of my PCP. It sounded legit and I provided my provider name and membership ID over the phone. \n\nI thought about it for a minute though and thought it was strange because I clearly remember giving this information to my PCP. I ran the number in Google and while I didn't get any reported scam hits I also got no hits for any sort of agency that would be making this call. The area code was also not for the state I reside in. \n\nI'm now concerned because I'm wondering what the consequences could be. I don't believe they could really do anything just with a membership ID though, unless I'm mistaken. \n\n",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieriur/received_call_claiming_missing_health_insurance/"
    },
    {
        "Subreddit": "Scams",
        "Title": "https://dynastyminidachshundpuppies.com",
        "Score": 1,
        "Comments": 8,
        "Post Time": "2025-01-31 18:51:47",
        "Post Content": "SCAM Website be careful. They take your money for a dashund puppy and then try to get more for airport fees 1500 - saying you'll get it back. We figured it out before we sent more money thank goodness. ",
        "URL": "https://www.reddit.com/r/Scams/comments/1iem59l/httpsdynastyminidachshundpuppiescom/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Art/Craft Fair Scam (X-Posted in /Craft Fairs)",
        "Score": 1,
        "Comments": 5,
        "Post Time": "2025-01-31 16:35:58",
        "Post Content": "Edited To Ask: If I had given my Zelle account info, what's the risk? Could they have somehow accessed my Zelle account? She was so pushy about me sending it but I wouldn't because it's my phone number and didn't want to give her more information about me.\n\nI just wanted to give a heads up to everyone booking markets/fairs. I've been doing them for a couple years now and have never had this happen. I saw an event listed on Facebook for an \"Art & Ale Festival\" in my town. I did some googling and no issues-totally legit event coming up. Underneath the listing on Facebook there was a comment saying there were still vendor spaces available and to contact them. I did and provided all needed information (type of art, space needed, website, etc). They gave me a list of all available spaces available and I chose the 10x10. I then venmoed them the fee but it didn't work (first giant red flag) and they said they were having issues and to Zelle them. So I did. They never sent a confirmation email",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieiv2m/artcraft_fair_scam_xposted_in_craft_fairs/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Accidentally clicked on a sms scam link on an android, am i fine?",
        "Score": 2,
        "Comments": 6,
        "Post Time": "2025-01-31 18:43:18",
        "Post Content": "It was pretending to be my bank and that it had \"rewards\" and i wasnt really thinking and clicked the link. It said to enter my phone number to get rewards and i did. At that point i realized that this was a scam, because you had to pay some amount of money with the points to get a reward. My only concern is that malware might've been installed on my phone. Im usually really good at immediately noticing a scam so i never click links, but idk i slipped up this time. Is there a chance malware was installed?",
        "URL": "https://www.reddit.com/r/Scams/comments/1iely0z/accidentally_clicked_on_a_sms_scam_link_on_an/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Is it worth reporting scammers/spammers to the phone provider?",
        "Score": 1,
        "Comments": 5,
        "Post Time": "2025-01-31 22:16:53",
        "Post Content": "Does anyone have experience reporting scammers to the phone provider of the number they are texting from? Can I trust a VOIP provider to keep my information confidential and appropriately handle reports of suspected attempted phishing?\n\nThe short version of my story is that I believe a person on the fringes of my friend group has been attempting to scam us via calls and texts. Various people in the group have dealt with obviously scammy or outright harassing texts, and the culprit it apparently known for doing this sort of thing. I went from never getting scam texts to getting flooded with them--fake crypto investments, fake jobs, \"hi\" texts, etc.\n\n I don't engage and am operating on the assumption that the culprit is phising for info. They've tried in various ways to obtain my last name, DOB, and address. I don't believe they have any of this info.\n\nI've started reporting these texts to the FTC, but so far, my reports haven't stopped the stream of messages. If I report to the phone pr",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieqzt8/is_it_worth_reporting_scammersspammers_to_the/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Instagram account hacked / account recovery scam",
        "Score": 2,
        "Comments": 2,
        "Post Time": "2025-01-31 18:23:28",
        "Post Content": "Dear all. My IG account was hacked yesterday. I did not have 2FA ( I know, very stupid) and it seems they have in the meantime changed my email address and phone number. I am afraid that this account recovery can be a scam.   \nI already sent a video proof to META and asked friends to report my account. I did get an email (in English, the first email was in my native language to notify my address had been changed) today that serves as a reminder to recover your instagram account, sent by\n\n[security@mail.instagram.com](mailto:security@mail.instagram.com) and the link seems legit.  I have 2FA on my Gmail account, I checked. However, I did not receive any other email, since it says the following\n\nTheir message --> We recently sent you an email to unlock your Instagram account. If you haven't yet, please reset your password before the link expires in 24 hours. <--\n\nDoes this mean that if I am fast enough I can go in; change my password, do 2FA and my phone number again? Because they changed",
        "URL": "https://www.reddit.com/r/Scams/comments/1ielgzf/instagram_account_hacked_account_recovery_scam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "I got a text from a \"Mercantile Adjustment Solutions\"",
        "Score": 1,
        "Comments": 3,
        "Post Time": "2025-01-31 21:48:13",
        "Post Content": "Pretty sure this is a scam but I'm not 100% sure because I had a T-mobile account 3 years ago that lied about giving us a payment plan and then put us on a rental plan instead. But an 833 number text me saying that a Mercantile Adjustment Solutions now holds my debt with sprint. The text is a picture containing the message followed by a Cammy payment link (the legit mercantile website with a pay. before it). ",
        "URL": "https://i.redd.it/ond0in02hege1.png"
    },
    {
        "Subreddit": "Scams",
        "Title": "Scam on Facebook? Or just coincidence?",
        "Score": 2,
        "Comments": 4,
        "Post Time": "2025-01-31 17:50:49",
        "Post Content": "Why do I constantly get messages from male people, older ages, on Facebook, who claim they tried to send a friend's request and it didn't go through and I should add them from my side? Their accounts are obviously fake, no posts, some surgeons or army generals. My account on FB is pretty open to public as I only post photography. What's the point behind that?",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieko41/scam_on_facebook_or_just_coincidence/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Received this note stuck to my front door today from \"Department of Homeland Security United States Secret Service\"",
        "Score": 8672,
        "Comments": 235,
        "Post Time": "2025-01-29 21:05:46",
        "Post Content": "Today I heard someone knock on my front door about 2PM, but I couldn't answer as I was stuck in a meeting. I checked my security camera and saw two gentlemen at the door about 30-50yr old id guess (I figured they were selling some kind of home improvement service like new windows, etc... About two hours after they left I went outside for something and found this note from \"United States Secret Service\" hanging on my doorknob asking me to call a number to talk to an agent about a twitter account that apparently \"posted a threat towards the president back in November\". \n\nThis is a scam right?",
        "URL": "https://i.redd.it/8a415ysnzzfe1.jpeg"
    },
    {
        "Subreddit": "Scams",
        "Title": "WTH did I just do??!",
        "Score": 2,
        "Comments": 14,
        "Post Time": "2025-01-31 17:33:39",
        "Post Content": "Someone please tell me what information is self compromised in falling for this scam. \n\n“I'M GIVING THIS ITEM TO THE FIRST PERSON THAT CONGRATULATE ME 10th WEDDING ANNIVERSARY THROUGH NUMBER WITH THE SCREENSHOT OF THIS POST”\n\nI was on a popular third party retailer and stupidly responded, giving this person my name and address.  Fortunately I’m at college so it’s not my permanent address but still. I figured it was a scam once they wanted me to cover “the shipping costs” through Apple Pay or Zelle.  \n\nI really would just like to know how comprised my personal data is now. ",
        "URL": "https://www.reddit.com/r/Scams/comments/1iek91u/wth_did_i_just_do/"
    },
    {
        "Subreddit": "Scams",
        "Title": "🚨 SCAM WARNING: @Saint__00 on X (Twitter) – FAKE Man Utd Tickets! 🚨",
        "Score": 1,
        "Comments": 11,
        "Post Time": "2025-01-31 21:06:04",
        "Post Content": "Hey fellow United fans, I wanted to share my awful experience and warn everyone about a scammer selling fake tickets for **Manchester United vs Arsenal**. I lost **£1000** to this fraud, and I don't want anyone else to go through the same.\n\n# How I Got Scammed:\n\n1. This guy, **Saint\\_\\_00 on X (Twitter)**, claimed to have **6 Man Utd vs Arsenal tickets** and sold them to me for **£700**.\n2. After paying, he suddenly said I needed **a premium Manchester United membership** to receive the tickets. That cost me **another £300 (£50 per membership x 6 people)**.\n3. Once I paid, he **refused to share the login details** for the memberships he supposedly created.\n4. Now he’s demanding **another £25 per ticket for \"taxes\"**, clearly trying to milk more money out of me.\n5. When I confronted him, he **stopped responding**.\n\n# Why This Hurts Even More:\n\nI’ve been a **Manchester United fan since 2008**, and this was **my first trip to the UK and my dream to watch United at Old Trafford**. Since ge",
        "URL": "https://www.reddit.com/r/Scams/comments/1iepbtp/scam_warning_saint_00_on_x_twitter_fake_man_utd/"
    },
    {
        "Subreddit": "Scams",
        "Title": "\"Girl\" has bandwidth.com phone number. This is a scammer, right?",
        "Score": 1,
        "Comments": 32,
        "Post Time": "2025-01-31 20:56:21",
        "Post Content": "If so this would be an EXTREMELY elaborate Catfish. I can't believe it.\n\nI've been talking to this \"girl\" for almost a week. Her \"life story\" makes perfect sense. She never asked for money but she asked for sexual content from me (without my face in it). She's sent me plenty of pictures I have requested, doing things I requested: they couldn't have been googled, or stored in someone's computer before our conversation; someone was undeniably taking those pictures for me.\n\nShe refused to videocall, always telling me she'd do it tomorrow, though. This set off my alarm bells. Then I asked for her phone number and she gave me a bandwidth.com phone number.\n\nSince she asked me for very specific sex acts, I thought that maybe this was a catfish trying to fulfill a fetish, but it doesn't seem like this could be a catfish since bandwidth.com does not seem to offer phone numbers to randos, they are selling them in bulk. This person sounds almost obsessed with a certain sex act and has never asked",
        "URL": "https://www.reddit.com/r/Scams/comments/1iep3gb/girl_has_bandwidthcom_phone_number_this_is_a/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Busco alguna Información sobre AMG pantheon, grupo en Whatsapp",
        "Score": 1,
        "Comments": 4,
        "Post Time": "2025-01-31 20:25:47",
        "Post Content": "Quisiera que me orientaran y me dieran sus historias de dentro de estos grupos.  \nEstoy dentro de uno y he notado algunas irregularidades como por ejemplo que ninguno de los involucrados se quieren identificar. Hay una persona que emite las señales a la que llaman “Profesor“ y otra que se supone estadounidense pero al intentar marcar su número no es válido y pare venir del sur de Mexico.\n\nSe invierte en crypto monedas, las señales se dan dos veces al día, dudas me han surgido cuando al parecer depositas dinero pero no lo puedes sacar ya que tiene que completar una serie de movimientos, creia entender el juego, ellos ganan más, pero aun asi todo es muy raro. Pedí que se identificaran y parece que no quieren tocar ese tema. \n\nQuiero que este post ayude también a los demás a que si es real confíen y si no, no caigan!.",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieodwm/busco_alguna_información_sobre_amg_pantheon_grupo/"
    },
    {
        "Subreddit": "Scams",
        "Title": "YouTube TV fake number scam",
        "Score": 62,
        "Comments": 9,
        "Post Time": "2025-01-30 21:38:40",
        "Post Content": "My mom (66) called me earlier, very shaken up and told me someone had her account information and said she was at the bank trying to get it sorted. She called me back a bit later and I pieced together what happened. \n\nShe subscribes to YouTube TV and for some reason could not get the app to work today. She googled their customer service line, which turned out to be a fake number. She said the woman did not sound American but “knew exactly what she was talking about” and said my mom owed $1700 and needed to get a pre paid card and give “customer service” the numbers. The woman assured my Mom she would get the money back and the large bill was due to other people using her Google account to subscribe to YouTube TV. \n\n\nLuckily, my Mom realized this didn’t sound right and told the woman she was going to the bank. The woman said they needed to stay on the line and my Mom refused and hung up. The bank was able to put a freeze on the account just in case but it sounds like she was smart enoug",
        "URL": "https://www.reddit.com/r/Scams/comments/1idyau9/youtube_tv_fake_number_scam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Gov+ weak security scam",
        "Score": 0,
        "Comments": 7,
        "Post Time": "2025-01-31 18:50:08",
        "Post Content": "I received an email to \"Activate your GOV+ account\" ... was curious so I clicked it and it asked me for my phone number and to create a password.  Of course, the phone number I gave was a throw-away one.  \n\nSo, I'm clicking around and notice that it's someone else's account ... complete with credit card number and expiration date. I close my browser and get several \"Receipt from GOV+\" emails ... opps, did my clicking charge their credit card?  \n\nI spent hours trying to contact the company to no avail - keep getting AI generated responses both online and on the phone.  Now about every 4 hours I get an email to complete my application with a link that brings me right into the account without a password.  No 2FA in sight ... \n\nSo many security holes ... definitely not a secure web site.",
        "URL": "https://www.reddit.com/r/Scams/comments/1iem3t8/gov_weak_security_scam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Craigslist apartment rental scam",
        "Score": 13,
        "Comments": 7,
        "Post Time": "2025-01-31 04:06:51",
        "Post Content": "Came across a listing on Craigslist for an apartment rental that seems ok, but the more I talked to the person it seems suspicious. \n\nThe discrepancies are as follows: \nListing is old for a rental in the area. (14days old)\n994 square foot for a 1 bed, when I searched up the building it has no 1 bed floor-plans with 994 square foot. \nText area code is for Rhode Island, very far from BC Canada.\nThe owner has a weird “application process” that no one else I’ve inquired with has.\n\nI’m getting a weird suspicious gut feeling about it.\n\nTIA",
        "URL": "https://www.reddit.com/gallery/1ie6e69"
    },
    {
        "Subreddit": "Scams",
        "Title": "Weird emails, definitely scams -- what's the play here?",
        "Score": 1,
        "Comments": 5,
        "Post Time": "2025-01-31 17:09:43",
        "Post Content": "I keep getting these very strange emails that all have different content but follow the same basic structure:\n\n1. The alleged \"sender\" is usually a one or two word business-y name like \"Costco Rewards\", \"EAir Heater\" or \"Customer Support\" (all received this morning).\n2. The subject line is usually one or two words and frequently bears little or no connection to the sender; for example in today's batch \"EAir Heater\" sent an email with subject \"Sea\", \"Costco Rewards\" sent \"Promotion\", and \"Customer Support\" sent \"Trending Today\".\n3. The first part of the email seems to be some kind of obvious phish.  Then there is a very long stretch of white space.  At the bottom of the white space is something that seems to be copied from another email entirely.\n\nFor example, the \"Trending Today\" email from \"Customer Support\" began with the following text:\n\n>Energy BiLL\n\n>Start the New Year 2025 with Sustainable Solar Solutions.\n\n>Based on your zip code you may qualify for government funded solar progr",
        "URL": "https://www.reddit.com/r/Scams/comments/1iejo7d/weird_emails_definitely_scams_whats_the_play_here/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Is this a scam? Person requests wire info to compensate me back",
        "Score": 0,
        "Comments": 20,
        "Post Time": "2025-01-31 16:52:38",
        "Post Content": "I lost money in a stock trade. Person who gave me advice wants to wire transfer me money. They need my wire transfer info obviously. I am not sending them any money. If I give them info to wire me money, then is there a risk they can scam me? I bank with Schwab. Grateful for any advice",
        "URL": "https://www.reddit.com/r/Scams/comments/1iej9d0/is_this_a_scam_person_requests_wire_info_to/"
    },
    {
        "Subreddit": "Scams",
        "Title": "is jobflix.us a scam?",
        "Score": 0,
        "Comments": 9,
        "Post Time": "2025-01-31 16:47:55",
        "Post Content": "it probably is a scam but on the off chance it isn’t i’m asking here lol, i seen somewhere you can review netflix movies for cash through a website called jobflix.us, is this true? has anyone done it? if this is a scam can anyone let me know if something like this actually exists? i need another way to make quick cash from home on top of my full time job😔",
        "URL": "https://www.reddit.com/r/Scams/comments/1iej59i/is_jobflixus_a_scam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "https://hceaa.legal/ - Scam",
        "Score": 0,
        "Comments": 2,
        "Post Time": "2025-01-31 16:47:36",
        "Post Content": "My partner received a Notice of Enforcement on the 29/01/25 from a company calling themselves HCEAA Legal.\n\nIt’s very convincing when on the site if you enter the reference number that appears on the letter your name will appear and the fine amount.\nI think they must have stolen data from a PCN payment site.\n\nThere is also a number on the letter which was answered yesterday, and they advised my partner to email the address that shows on the site….no response to the email sent by my partner but an email was received to advise an enforcement team will visit our property today - surprise surprise No Show!!\n\nDo not make any bank transfer or payments via this site.\n\nThe email address does not show as .co.uk or .org so that’s already suspicious.\n\nIf this message helps 1 person I will be glad I posted this….very little info out there as to what help you can get with this sort of scam.\n\n",
        "URL": "https://www.reddit.com/r/Scams/comments/1iej4zm/httpshceaalegal_scam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Fake health insurance scams",
        "Score": 1,
        "Comments": 7,
        "Post Time": "2025-01-31 16:45:16",
        "Post Content": "Sort of a vent, sort of a reminder to make sure your friends & family in the US who have to buy their own insurance are aware! Even though I've seen complaints about this here a time or two, it's not one of the more commonly reported things here and not everyone keeps up all the time, so I feel like it's worth mentioning again.  \n\nA few weeks ago I helped a young friend of mine to navigate his state's healthcare exchange to purchase insurance just before the extended enrollment deadline came up. I know 100% for sure that we only used the the actual [healthcare.gov](http://healthcare.gov) and then the actual state's healthcare exchange website, and his information was only given to *actual* government websites. I know how to navigate these things, which is why he'd asked for my help. \n\nThe process of signing up was frustrating enough even though I fancy myself a semi-intelligent and fairly techie human having worked in tech for just under 30 years now, but we got him enrolled, he's got ",
        "URL": "https://www.reddit.com/r/Scams/comments/1iej30e/fake_health_insurance_scams/"
    },
    {
        "Subreddit": "Scams",
        "Title": "LiftShip Logistics LLC",
        "Score": 1,
        "Comments": 18,
        "Post Time": "2025-01-31 16:25:00",
        "Post Content": "So last month I was hired by LiftShip Logistics LLC and of course it seemed to good to be true because what company pays so much money to ship packages to you for you to check when one can easily ship it directly and just like so many others I received a small metal ring as my first item and after that various other items mainly shoes, and after reading what fellow redditors had to say about similar jobs I was immediately filled with dread so naturally I contacted them and said that if they were indeed a scam and I wasn't paid, I would sue for what I was owed to which they said I was reading about the wrong company and assured me I would be paid but me being me I was skeptical and voiced that, so my supervisor called and said she heard I was having doubts about the company and I again voiced my opinions and doubts so she sent me paperwork which I immediately checked the EIN number, nothing and then I saw that the company wasn't actually registered in Lakewood Colorado but instead it wa",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieils7/liftship_logistics_llc/"
    },
    {
        "Subreddit": "Scams",
        "Title": "https://www.octopuspro.top/",
        "Score": 1,
        "Comments": 11,
        "Post Time": "2025-01-31 15:53:54",
        "Post Content": "Octopus Digital Marketing\n\nWhat do you guys know about this organization? I’ve been reached out to by someone who is involved with this company. They seem foreign but do not seem to be an automated messaging system. I’m wary because I have struggled to find a company website. They seem to want you to complete automated reviews for apps. Let me know what people know about it!\n\nEdit: Thanks for the information everyone! I haven’t come across a scam making use of the sunk cost fallacy before. This was very informative!!",
        "URL": "https://www.reddit.com/r/Scams/comments/1iehvb7/httpswwwoctopusprotop/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Is this Money slave scam?",
        "Score": 0,
        "Comments": 17,
        "Post Time": "2025-01-31 23:06:01",
        "Post Content": "There is this man on X who offers to be my money slave he said that he loves to pay bills of other people, now he is asking for my PayPal but before I send it to him I wanted to know if it could be a scam? Or if I could end up having to pay back the money? Should I do it ? Pls help",
        "URL": "https://www.reddit.com/r/Scams/comments/1ies3p8/is_this_money_slave_scam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Please Help! My Google account is continuously getting hacked.",
        "Score": 4,
        "Comments": 29,
        "Post Time": "2025-01-31 06:47:46",
        "Post Content": "It all started with my friend getting calls from unknown numbers. Then her google account has sign in from multiple devices she doesn't know. Now they hacked her linkedin and are phishing people and sending her love letters on mails. She told me about it on WhatsApp then I checked my accounts and they have started signing in too. I changed password increased security still getting sign in without notifications what should I do. Please guide. My friend also mentioned she picked their call once it was some group of guys talking in a village bihari accent confessing to her she immediately hung up.",
        "URL": "https://i.redd.it/8c088ble0age1.png"
    },
    {
        "Subreddit": "Scams",
        "Title": "Coursiv Scam $9.99 mthly  No Account",
        "Score": 0,
        "Comments": 3,
        "Post Time": "2025-01-31 14:54:08",
        "Post Content": "I've been charged $9.99 monthly from Coursiv SGT it says on my bank statement. I can't find an account on Coursiv. Any suggestions,  I'm going contact my bank about this.",
        "URL": "https://www.reddit.com/r/Scams/comments/1iegj5s/coursiv_scam_999_mthly_no_account/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Data Entry Clerk Scam",
        "Score": 9,
        "Comments": 14,
        "Post Time": "2025-01-31 02:49:41",
        "Post Content": "Hi! I just wanted to let everyone know about this “check scam” as I found it in many places today. Basically, I’d been applying to a lot of jobs, and yesterday I got this email from Jessica from Healthcare of Today Inc. Long story short, she said she was impressed with my experience and told me I had to do an assessment and then fill in an employee form. I did everything because her email was literally hr@healthcareoftodayinc.com, and the website seemed legit. The following day, I got an offer letter, and that’s when I became really suspicious. I looked them up in Glassdoor, not a lot of info, but when I copied and pasted part of this “agreement” into Google is where I found out about this scam. It said I’d need certain type of software and they’d send me a check. I realized that it’s always the same emails, agreement, assessment, and all the rest. They are just changing the names of these companies and some other details. To sum up, please stay careful out there. ",
        "URL": "https://www.reddit.com/r/Scams/comments/1ie4yqk/data_entry_clerk_scam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Are there any scams where someone sends you bitcoin on cash app w a stolen card, and you send it back & are on the hook?",
        "Score": 0,
        "Comments": 44,
        "Post Time": "2025-01-31 14:41:13",
        "Post Content": "My friend (actual friend, we know each other in real life and dated for a while) asked if he could send his winnings from a lottery app to my cash app account via my bitcoin wallet, and then send it to him on cash app. He says he can't because he doesn't have an ID (this is also true, I've known this for a while and he honestly is not smart enough to play the long game like that, lol) \n\nHe has been talking about winning a few hundred dollars on this game for a few days now, and I know he plays it, so that part is believable to me. The issue is, he is an addict. (we dated when we both were using) I generally trust him, he is very open with me about all of that and while I couldn't see him actively stealing money from me and scamming me directly, I could see him getting me involved in something shady and trying to get me to help him. If this is the case, he probably would not want to be truthful to me about it because he knows I won't want to put my account at risk. \n\n\nI just wanted to m",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieg9co/are_there_any_scams_where_someone_sends_you/"
    },
    {
        "Subreddit": "Scams",
        "Title": "🚨 Has Anyone Else Received a Letter from \"Car Law Firm\" Kasra Sadr?",
        "Score": 4,
        "Comments": 1,
        "Post Time": "2025-01-31 06:43:27",
        "Post Content": "Hey everyone,\n\nI recently got a **letter from the DMV** saying that my **personal information was released to a law firm I’ve never heard of—Car Law Firm (Kasra Sadr) in San Diego.**\n\nIt caught me off guard because I never contacted them, but when I looked them up, I found some concerning information. I saw reports that **others have received similar letters**, and I’m trying to figure out **why they are collecting DMV records and what they are doing with this info.**\n\nI called them, and they told me they could **file a lawsuit on my behalf** about a car I bought, but I wasn’t sure if this was legit. Now I’m seeing that **some people claim they lost money working with them, and there are lawsuits against this firm.**\n\nHas anyone else gotten one of these letters? Did you reach out to them? If so, what happened?\n\nWould love to hear if anyone else has experience with this—let me know what you think.",
        "URL": "https://www.reddit.com/r/Scams/comments/1ie8x32/has_anyone_else_received_a_letter_from_car_law/"
    },
    {
        "Subreddit": "Scams",
        "Title": "I am trying to sell my car on mobile.de without being from germany and this happend:",
        "Score": 0,
        "Comments": 30,
        "Post Time": "2025-01-31 13:53:04",
        "Post Content": "I’ve posted my car on mobile.de and a guy messaged me on iMessage (he got the number from the ad) and he is saying that he is ok with the price and wants to buy it but he is from germany and he will send a transport company that will take my car, it sounds a little fishy for me, he asked for my email to send me the details and he sent 2 photos with his ID and one with the ID and his face, i will coppy the text from the email and paste it here:\n\nHello,\nI'm willing to pay the agreed-upon amount and will arrange for a transportation agent to handle the test drive and logistics. I'll transfer the funds to your account this week.\n\nTo proceed, I need your full name and address to get a shipment estimate from the logistics company. Could you also prepare a purchase contract for me to sign and return?\n\nI have attached my ID and a selfie to confirm my identity. I appreciate your cooperation and look forward to completing the sale.\n\nBest regards\n\nDo you thik it is a scam?",
        "URL": "https://www.reddit.com/r/Scams/comments/1ief97p/i_am_trying_to_sell_my_car_on_mobilede_without/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Scammer apple paid me money.",
        "Score": 5,
        "Comments": 10,
        "Post Time": "2025-01-31 04:59:42",
        "Post Content": "A scammer apple paid me money and said it was on accident. They then told me to transfer it to cashapp and buy bitcoin and send them that. Should I send it back and block them even though they said to absolutely not to do that? Why would they want me to do that? I don’t want this money cause idk where it came from.",
        "URL": "https://www.reddit.com/r/Scams/comments/1ie7b05/scammer_apple_paid_me_money/"
    },
    {
        "Subreddit": "Scams",
        "Title": "https://iqinternational.org/ will steal your money.",
        "Score": 1,
        "Comments": 7,
        "Post Time": "2025-01-31 13:15:30",
        "Post Content": "After taking this online iq test, I was charged 0.99$ USD to see my results. A couple days after the test, they have made daily attempts to charge my credit card 40$USD. My bank caught it but my friend wasn’t so lucky. \n",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieeiq7/httpsiqinternationalorg_will_steal_your_money/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Uber business called me and scam and change my password!",
        "Score": 2,
        "Comments": 4,
        "Post Time": "2025-01-31 05:30:48",
        "Post Content": "Hi \n\nMy dad owns business and he has uber tablet. He got call from support and asking for password associated with uber account and was asking for password. We did have security  2 step verification and we bought into uber bs and give the code. He change the password and then yesterday my dad notice he didn’t get any email for a day. We ended up changing the password but we were confused how this can have happen … and that realize the call was a scam. \n\nNow what do we do since the person was able to log into my email and I do have sensitive documents and emails. What do I do next to protect my self ? I did change password.  What else can happen here ? ",
        "URL": "https://www.reddit.com/r/Scams/comments/1ie7tqb/uber_business_called_me_and_scam_and_change_my/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Miller-Washington.com Online falsely advertises it is US based - it is a Chinese run scam",
        "Score": 0,
        "Comments": 9,
        "Post Time": "2025-01-31 12:42:48",
        "Post Content": "# Miller-Washington Online Store -Scam warning for potential buyers\n\nThis is a joke or actual fraud. The sweaters I ordered are not wool, they look nothing like the pics or the description and when you try to return them for the \"money back guarantee\" the email they give to get return info goes to a mailer daemon. It was clear these arrived from China, and I mean they are HORRIBLE quality. The sweaters that arrived look like a cartoon version of the advertised pictures. I finally got someone from this criminal enterprise to admit they are not a US based company, and they have no US based property. Their website claims they ship from the US, and have a guaranteed return policy, but they use a shipping dump in Franklin Park, IL, and then expect you to pay fees and tariffs to return the items to a scam address in China!  Researching them, it is clear they have thousands of fake clothing websites and have been scamming people all over the world using the same \"return address.\"  Each scam s",
        "URL": "https://www.reddit.com/r/Scams/comments/1iedx5u/millerwashingtoncom_online_falsely_advertises_it/"
    },
    {
        "Subreddit": "Scams",
        "Title": "My bank called asked a question and then hung up.",
        "Score": 0,
        "Comments": 17,
        "Post Time": "2025-01-31 16:28:32",
        "Post Content": "Why would an obviously fictitious call from my banks 800 number and say “this is your bank calling regards to an out of state transactions and want to verify blah blah blah.” And then hang up after I say alright. Is there harm in saying an agreeable response?",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieioqa/my_bank_called_asked_a_question_and_then_hung_up/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Car Scam - Buyer wants to use Zelle",
        "Score": 35,
        "Comments": 59,
        "Post Time": "2025-01-30 17:37:14",
        "Post Content": "Need to convince my parents the person buying their car is trying to scam them. I'll keep it short.\n\nDetails from what I gathered:\n\n- They're sending a driver to pick up the car.\n\n- The driver can't carry cash and so they want to use Paypal/Zelle.\n\n- They haven't seen the vehicle.\n\n- No info on how a bill of sale or title transfer would take place.\n\nThe fact they would give the car to someone who would (or should) have the authority to sign a bill of sale, but not be authorized to carry cash, is sending off all sorts of red flags, but I can't find the name of the scam.\n\nThank you.",
        "URL": "https://www.reddit.com/r/Scams/comments/1idsidd/car_scam_buyer_wants_to_use_zelle/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Fresh Hoods is a scam",
        "Score": 0,
        "Comments": 1,
        "Post Time": "2025-01-31 11:54:11",
        "Post Content": "See title. I ordered 3 hoodies back on the 15th of December. I'm still yet to receive aforementioned products. \n\nThe \"support\" are all auto-generated email responses. I know this because I have just been sending completely off topic responses once I figured out this was the case. \n\nFrom my searching around, they usually take a long time to ship but from my perspective the support being an automatic circular bot generating bullshit emails screams avoid, hence why I'm posting this thread for anyone else thinking about ordering. \n\nIf you're in the UK at least, do not order. ",
        "URL": "https://www.reddit.com/r/Scams/comments/1ied30m/fresh_hoods_is_a_scam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Hello! I need some assistance!",
        "Score": 1,
        "Comments": 5,
        "Post Time": "2025-01-31 11:52:20",
        "Post Content": "First off I would like to state that this isn't a situation of me getting scammed! I would like to ask why recently people from Spain and The Netherlands try and call my number which is German. Could this mean my number was sold? I don't respond to these calls but I am concerned for my privacy. If anyone knows why I get these calls and could answer that would be nice!",
        "URL": "https://www.reddit.com/r/Scams/comments/1ied1yk/hello_i_need_some_assistance/"
    },
    {
        "Subreddit": "Scams",
        "Title": "USPS extortion or scam",
        "Score": 3,
        "Comments": 5,
        "Post Time": "2025-01-31 05:31:58",
        "Post Content": "We moved recently and have been updating our address with every entity and financial institution we do business with. \n\nThe most bizarre thing I found was USPS wanting to charge $1.10 using a credit card to confirm my identity for mail forwarding.  Social Security Administration, US Treasury and all financial institutions didn’t ask for a credit card and money to verify my identity. The amount is small but I’m hesitant to give my credit card info to a not-very-efficient entity. \nThe junk mail we get is not worth even getting it forwarded when we have updated our address at every entity of interest. \nIs this for real?",
        "URL": "https://www.reddit.com/r/Scams/comments/1ie7ue1/usps_extortion_or_scam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Metapack-life (WFH scam)",
        "Score": 0,
        "Comments": 15,
        "Post Time": "2025-01-31 11:26:52",
        "Post Content": "I have a question about tax filing this year. Is it true that IRS tracks money transfer apps like Bitcoin and Cash App? I fell victim to a work from home scam in December 2024 where I used those apps and I’m wondering if I really need to report it on Turbo Tax this year if the business wasn’t legitimate. Can anyone help with this please? Will I get tax forms to help me with it? Does the reporting threshold amount matter? I’m just worried because I did something financially unfamiliar to me, but I’ve read that I could get in trouble if I don’t report everything on my taxes. ",
        "URL": "https://www.reddit.com/r/Scams/comments/1ieco55/metapacklife_wfh_scam/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Job recruiter rang me",
        "Score": 1,
        "Comments": 7,
        "Post Time": "2025-01-31 11:08:36",
        "Post Content": "Hi I’ve been applying for a lot IT jobs one rang me today I was half asleep but I answered it and they knew everything about me my university etc asked me what I’ve been doing since graduating and I spoke to them for like ten minutes. They said that the client wanted someone with experience and I was like okay and they said how much do you want to work in IT OR something and I said I was eager. They then said they have this program where you shadow some senior IT guy and stuff and then something felt off and I hung up. The number also said likely suspicious but I didn’t realise and when I google that number it has a bad rep but nothing about it recruitment scams.\n\nI’m worried can they do anything they already knew my name and stuff but I was talking to them for like ten mins but I’ve blocked the number now and do you think it was a scam call.",
        "URL": "https://www.reddit.com/r/Scams/comments/1iecerx/job_recruiter_rang_me/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Job listing doesn't have every red flag, but still seems a bit off.",
        "Score": 5,
        "Comments": 9,
        "Post Time": "2025-01-31 02:10:12",
        "Post Content": "I applied to this listing, got a response within an hour and scheduled a video interview within a few days. They claim to be a distributor for Rainbow Cleaning System but I couldn't find them on the website. They didn't even seem to have their own website, only a very unpopular IG profile. I did physically find the location they listed and there are some reviews online, but I can't enter without making an appointment.\n\n# Office Manager and Sales Representative\n\nHiring Blitz $600-$1500 Per week Due to high consumer demands we are offering Part-time that can lead to fulltime opportunities to fill many positions to provide immediate response. We are a ----------------- based company who distributes an North American made Certified Air Cleaner that eliminates contaminants and pollutants to increase indoor air quality within businesses and homes. Clean air in homes and businesses has never been more important and distribution of our product at this time (and years to come) is critical. We a",
        "URL": "https://www.reddit.com/r/Scams/comments/1ie47jy/job_listing_doesnt_have_every_red_flag_but_still/"
    },
    {
        "Subreddit": "Scams",
        "Title": "No sender’s number in SMS",
        "Score": 1,
        "Comments": 4,
        "Post Time": "2025-01-31 10:46:22",
        "Post Content": "I have received a TikTok scam SMS which does not display the sender’s number. \n\nHow is that technically possible?\n\nCan I still block the sender?",
        "URL": "https://www.reddit.com/r/Scams/comments/1iec3k7/no_senders_number_in_sms/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Strange voicemails I’ve gotten. Any ideas?",
        "Score": 3,
        "Comments": 8,
        "Post Time": "2025-01-31 04:28:49",
        "Post Content": "\nI’ve gotten two voice mails within the past week of two men both saying “this call might be recorded” and they both asking if they could speak to me. Knowing my full name. I have no clue what this could be but it’s kinda freaked me out. \n\nBoth men had names I didn’t recognize and the fact they both knew my name is kinda put me on edge. Any ideas on this possibly is? I’m not sure if it’s legit or a scam. They both spoke with an American accent, I think.\n\nBoth numbers were different, one of them was toll free and the other had a Missouri area code. Still no idea what this is or what they want from me. ",
        "URL": "https://www.reddit.com/r/Scams/comments/1ie6s1c/strange_voicemails_ive_gotten_any_ideas/"
    },
    {
        "Subreddit": "Scams",
        "Title": "Weird situation - my cell number used to call someone else??",
        "Score": 1,
        "Comments": 4,
        "Post Time": "2025-01-31 10:20:44",
        "Post Content": "I received an iMessage (important) from someone saying, something along the lines of hey, I missed your call, who are you? \n\nWhat follows is a little back and forth which ultimately ends up in the person sending me a screenshot of their call list. Lo and behold, a cell number I associate with is listed having been a missed call. \n\nI 100% know I didn’t call this person. Not least because I checked my own call history (just incase for butt dial) but also because it came from the cell number I use when I’m at home, in a different country. That cell number is currently on pretty permanent airplane mode on a different cell phone. They managed to get iMessage me because it’s linked to my iCloud and came through on other phone (cell number and contract for the country I currently reside). \n\nQuestions: \n\n- Is this some super weird reverse uno scam I’ve got myself into? \n\n- Are scammers using real cell numbers to contact potential victims, and I was unlucky that it landed on my number in this i",
        "URL": "https://www.reddit.com/r/Scams/comments/1iebr3y/weird_situation_my_cell_number_used_to_call/"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Schneider and Diane. Secrets? Hardly. Snooze fest? Definitely!",
        "Score": 35,
        "Comments": 49,
        "Post Time": "2025-02-01 02:37:26",
        "Post Content": "So we're all anticipating the things he will tell in the \"secrecy\" he requested earlier, but it turns out to be nothing except him pulling out his fake life story script (that he shared with Linda 6 weeks ago)! I tried to trigger a response and even mentioned James, whatever, but he stays boring AF. The picture was the only highlight, but it was pointless. He barely talked with Linda either, their single page is included at the end. But!!! Do not despair! Madison has used her genius to prepare two wonderful letters related to the EnQuest debacle, which should send him reeling tomorrow, and we can enjoy his response to that! ",
        "URL": "https://www.reddit.com/gallery/1iewf76"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Guy wants to buy my car (bait starts second slide)",
        "Score": 100,
        "Comments": 19,
        "Post Time": "2025-01-31 17:12:09",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1iejqch"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Schneider and Diane: is he going after her now???",
        "Score": 87,
        "Comments": 66,
        "Post Time": "2025-01-31 17:33:22",
        "Post Content": "Well, this is a bit of a plot twist, but I am getting the impression that Marky is expanding his circle. He knows that Diane has money, but would he really be disloyal to Linda after all this time (a month and a half)? 😁 Might find out more with a late night drunken chat. Linda still isn't talking to him! ",
        "URL": "https://www.reddit.com/gallery/1iek8tm"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "They gave me $100",
        "Score": 36,
        "Comments": 18,
        "Post Time": "2025-01-31 22:03:34",
        "Post Content": "Not even sure if this counts as scam bait because I didn't actually do anything, but somehow my debit card information was stolen. I get email alerts for every single transaction or deposit so one morning I got a strange email of a $0 authorization charge to my card I didn't recognize. I used my bank app to temporarily freeze my card and went to work and forgot about it for a bit. When I got home I noticed that there were more $0 charges that were not authorized because my card was a frozen... and a $100 deposit.\n\nSo I did the whole process of reporting to my bank what happened and getting a new card, and I expected that the $100 deposit would bounce or be cancelled soon enough. I even let my bank know about the deposit.\n\nBut nope. I got a free $100 for doing nothing at all. I'm sure the $100 had probably been stolen from someone else but I smile a little thinking of some scammer's frustrations.",
        "URL": "https://www.reddit.com/r/scambait/comments/1ieqoma/they_gave_me_100/"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Tally wants gift cards to pay for dental work.",
        "Score": 18,
        "Comments": 10,
        "Post Time": "2025-02-01 01:24:33",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1iev18c"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Got blocked - VICTORY IS MINE!",
        "Score": 37,
        "Comments": 5,
        "Post Time": "2025-01-31 19:20:19",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1iemu99"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Looking for a trusted heart and I am looking for a 3 pound cock. Unfortunately, it didn’t work out. Lol.",
        "Score": 9,
        "Comments": 2,
        "Post Time": "2025-02-01 02:49:28",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1iewn3e"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Well Well Well, look what we have here",
        "Score": 4,
        "Comments": 6,
        "Post Time": "2025-02-01 03:59:09",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1iexwxr"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Keanu pt 28 - he sent a gift card. But there’s MYSTERY",
        "Score": 30,
        "Comments": 50,
        "Post Time": "2025-01-31 19:03:33",
        "Post Content": "Okay, so he sent this but it’s in euros so I certainly can’t redeem it. \n\nI have a friend living in Munich that could redeem it, but I don’t really know how to explain how I got it. \n\nIs anyone here European and can redeem it? I’m interested to know if it’s fake or empty. 😳",
        "URL": "https://www.reddit.com/gallery/1iemfk5"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Johnny part 26 - the dream 🤢",
        "Score": 11,
        "Comments": 0,
        "Post Time": "2025-02-01 00:10:23",
        "Post Content": "He sees $2.76M and hits me with the slow signal connection 🤣 You disappoint me, Johnny. I thought you were going to at least give me a sob story about your bastard kid or medicine, even, but poor connection? I had such high hopes for you!\n\nI don't know where exactly \"his\" dream originally came from, because there are several sites that pop up with it when I do a search. I just knew it wasn't an original thought; none of them ever are lol.\n\n\n",
        "URL": "https://www.reddit.com/gallery/1ieti9q"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "I love text scammers",
        "Score": 6,
        "Comments": 2,
        "Post Time": "2025-02-01 01:28:30",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1ieljp5"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Dicky, part 11. He's alive! But still boring and stupid",
        "Score": 17,
        "Comments": 7,
        "Post Time": "2025-01-31 21:22:41",
        "Post Content": "So after sleepless nights for me and spolied daughter Destiny, he reappears and immediately relaunches his money seeking. Getting nowhere, he returns to more love bombing. Scammer version of \"rinse and repeat\" ",
        "URL": "https://www.reddit.com/gallery/1iepq2v"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Done so soon???",
        "Score": 3,
        "Comments": 1,
        "Post Time": "2025-02-01 03:56:22",
        "Post Content": "I got this text from 1 of those work from home scams so I got a bit of creativity after listening to YouTube and this was the result. Kinda sad they didn't respond after. 🥲",
        "URL": "https://i.redd.it/eoljkukqagge1.jpeg"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Has anyone else gotten anything like this?? (NSFW Warning)",
        "Score": 11,
        "Comments": 7,
        "Post Time": "2025-01-31 20:23:23",
        "Post Content": "",
        "URL": "https://v.redd.it/k9rnnd6u1ege1"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Keanu Reeves Part 3",
        "Score": 11,
        "Comments": 10,
        "Post Time": "2025-01-31 20:09:30",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1ienzxs"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Let’s see if I can make it to 12 parsecs…",
        "Score": 7,
        "Comments": 2,
        "Post Time": "2025-01-31 21:14:51",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1iepje2"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Got blocked - VICTORY IS MINE!",
        "Score": 12,
        "Comments": 0,
        "Post Time": "2025-01-31 19:20:02",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1iemu0t"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Kevin Costner's new song",
        "Score": 7,
        "Comments": 4,
        "Post Time": "2025-01-31 21:44:44",
        "Post Content": "I've been telling my SO about my baiting because he sees me laughing at my phone randomly. I invited him to mess with Kevin Costner. My SO starts on Page 5 (the nutty, caustic sounding tone) and goes to the end of Page 10. Then I pick back up the next day pretending that my younger drunk housemate \"Charles\" got to my phone, which I had left laying out.\n\nNext episode: Kevin decides to fly in.... and I give him the address to the Police Headquarters in Buffalo. And in Buffalo, his iPhone loses connection, although he is still texting on it.\n\nIf I ever need to get rid of someone, my SO is the guy to do it 😁",
        "URL": "https://www.reddit.com/gallery/1ieq8jh"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Automatically replied at first, then thought I should have some fun",
        "Score": 3,
        "Comments": 0,
        "Post Time": "2025-02-01 02:00:34",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1ievq3t"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "They never answer this question.. idk why",
        "Score": 8,
        "Comments": 2,
        "Post Time": "2025-01-31 20:02:20",
        "Post Content": "Its not us",
        "URL": "https://i.redd.it/63ygk506ydge1.jpeg"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "I Think I Came on a Bit Too Strong",
        "Score": 12,
        "Comments": 0,
        "Post Time": "2025-01-31 17:46:20",
        "Post Content": "Swung a bit too hard for the fences on the first pitch.",
        "URL": "https://i.redd.it/8hasq2jw9dge1.jpeg"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Keanu pt 27 - nag nag nag",
        "Score": 35,
        "Comments": 16,
        "Post Time": "2025-01-31 11:33:05",
        "Post Content": "My new challenge is not to let three messages go by without making him feel uncomfortable :) ",
        "URL": "https://www.reddit.com/gallery/1iecrhl"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Gerard Butler is still an ahole",
        "Score": 16,
        "Comments": 1,
        "Post Time": "2025-01-31 16:53:16",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1iej9vl"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Gerard Butler - The End, part 2/2",
        "Score": 11,
        "Comments": 4,
        "Post Time": "2025-01-31 17:24:19",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1iek0zh"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Alright, Chat, what’s the next move?",
        "Score": 5,
        "Comments": 5,
        "Post Time": "2025-01-31 21:23:22",
        "Post Content": "",
        "URL": "https://i.redd.it/ebzq8cjmcege1.jpeg"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "My first ever Scam Bait call (as Doug the Bug)!",
        "Score": 2,
        "Comments": 0,
        "Post Time": "2025-02-01 02:07:19",
        "Post Content": "Here is my first ever Scam Bait call, animated as Doug the Bug!\n\nNumber was from Scammer Info website, sending people Paypal receipts for goods 'purchased' on Apple Store.\n\n[https://youtu.be/6uq5edLU9-M](https://youtu.be/6uq5edLU9-M)",
        "URL": "https://www.reddit.com/r/scambait/comments/1ievuqw/my_first_ever_scam_bait_call_as_doug_the_bug/"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Another job offer scam I wanted to share.",
        "Score": 2,
        "Comments": 1,
        "Post Time": "2025-02-01 01:50:08",
        "Post Content": "I’m so tired of that stuff so I just respond them “No”. Sometimes it looks very hilarious. ",
        "URL": "https://i.redd.it/mmt6b1k7ofge1.jpeg"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Gerard Butler - The End part 1",
        "Score": 9,
        "Comments": 0,
        "Post Time": "2025-01-31 17:18:55",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1iejw82"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "This one was a special kind of stupid",
        "Score": 98,
        "Comments": 37,
        "Post Time": "2025-01-31 04:16:56",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1ie6kp3"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Have been contacted by Kevin Costner, Kelly Reilly and Forrie J Smith in one day…..",
        "Score": 3,
        "Comments": 3,
        "Post Time": "2025-01-31 19:22:07",
        "Post Content": "As title, I’ve been contacted by all three today. Forrie just blocked me, contact with Kevin and Kelly is ongoing…..",
        "URL": "https://www.reddit.com/gallery/1iemvsb"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Need to find a scambait video",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 04:05:18",
        "Post Content": "Not sure if this was from kitboga or scam sandwich, but I remember the video had something to do with a Lamborghini and I think the scammer called the grandma \"baby\". Eventually when she's driving to go somewhere there's gta gameplay and she's constantly crashing and the scammer is screaming at her to stop the car. Hope someone can find this lol",
        "URL": "https://www.reddit.com/r/scambait/comments/1iey103/need_to_find_a_scambait_video/"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Apparently he wasn’t looking for a bachelor pad…",
        "Score": 2,
        "Comments": 1,
        "Post Time": "2025-02-01 00:14:04",
        "Post Content": "This guy came to me with some random address with no city at all so I had no idea what he was talking about. Then remembered that this a scam tactic and started screwing with some help from the r/scambait community. Then I decided to try selling the fortress of solitude. He stopped answering 😥",
        "URL": "https://www.reddit.com/gallery/1ietl40"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Is this a scam? Jk! Feel free to give them a ring",
        "Score": 2,
        "Comments": 1,
        "Post Time": "2025-02-01 00:09:21",
        "Post Content": "",
        "URL": "https://i.redd.it/3q4fbvl86fge1.jpeg"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Tyler the Creator of Lies - Part 17 (Cafes, and a Real Fake Photo)",
        "Score": 7,
        "Comments": 3,
        "Post Time": "2025-01-31 18:10:51",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1iel5wp"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Tyler the Creator of Lies - Part 16 (Trolling Him a Bit)",
        "Score": 7,
        "Comments": 3,
        "Post Time": "2025-01-31 18:06:46",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1iel2dr"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Wee-kend Plans!",
        "Score": 2,
        "Comments": 0,
        "Post Time": "2025-01-31 23:12:01",
        "Post Content": "",
        "URL": "https://i.redd.it/ovuhnpf0wege1.jpeg"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Morning scam",
        "Score": 3,
        "Comments": 2,
        "Post Time": "2025-01-31 18:35:38",
        "Post Content": "Feel free to call them, I messed with them for a good time and they’re not even aware of it lmao.",
        "URL": "https://i.redd.it/ta9d0c6pidge1.jpeg"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Anything fun I can do with this dudes banking information? 🤣",
        "Score": 6,
        "Comments": 8,
        "Post Time": "2025-01-31 17:10:11",
        "Post Content": "",
        "URL": "https://i.redd.it/f3x4rf2g3dge1.png"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Tyler the Creator of Lies - Part 15 (Finishing the Engagement to the Dumbest Scammer of 2025)",
        "Score": 6,
        "Comments": 2,
        "Post Time": "2025-01-31 16:56:04",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1iejc7s"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "I guess they’ll make sure to wear deodorant from now on",
        "Score": 2,
        "Comments": 0,
        "Post Time": "2025-01-31 21:44:13",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1ieq84f"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Schnieder talks to Diane and panics!",
        "Score": 77,
        "Comments": 62,
        "Post Time": "2025-01-31 00:54:05",
        "Post Content": "So he replied and I plunged ahead with so many dirty thoughts, plus a comment on James and his fahn self 😁",
        "URL": "https://www.reddit.com/gallery/1ie2n6d"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Schnieder, where did you go!? Diane wanna know",
        "Score": 70,
        "Comments": 15,
        "Post Time": "2025-01-30 23:58:28",
        "Post Content": "Everytime it's near the end, I get that song in my head 🤔. So Madison and I thought we could shift to Diane and reintroduce the idea of James as comfort. Especially since my man is focusing on her right now and I got needs! No response yet, fingers crossed. ",
        "URL": "https://i.redd.it/6hyq02tdz7ge1.png"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Publisher clearinghouse scam kept them going for three days",
        "Score": 1,
        "Comments": 2,
        "Post Time": "2025-01-31 22:10:33",
        "Post Content": "They called me three days ago saying I won 3 mil but had to pay taxes, which started at $7500 and by today was $500. They were kind enough to provide a mailing address (which i forwarded to law enforcement in the appropriate jurisdiction) and phone numbers that have been texting with me on. Pictures with the numbers are provided.\n\nThey thought they were speak with a franchise owner names William Afton (yes the killer from 5 Nights at freddys) please keep them busy so they can't actually steal from people.",
        "URL": "https://www.reddit.com/gallery/1iequhw"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Keanu Reeves Part 2",
        "Score": 12,
        "Comments": 16,
        "Post Time": "2025-01-31 08:37:59",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1ieag2d"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Schneider - insh’allah (Part 27c)",
        "Score": 97,
        "Comments": 93,
        "Post Time": "2025-01-30 19:23:13",
        "Post Content": "And… it’s off to EnQuest!  I’m so glad I have a seasoned barrister with me like Fergus!  \n\nI use the Nigerian spelling of “lier” only to troll him.  Just clarifying. \n\nI ask Schneider a simple yes or no question that he can’t answer and diverts to something about his contract:\n\nWILL YOU BE PREVENTED FROM LEAVING THE OIL RIG BY ENQUEST IF YOU ATTEMPT TO LEAVE BEFORE THE MONEY ARRIVES?\n\nHe refuses to answer after several exchanges.  Does that question make sense to you?  I’m guessing Schneider doesn’t want to answer it because if he says yes, then he is indeed being held against his will.  If he says no, then he’s staying on the rig (and away from Linda) per his own choice. \n\nI taunt him by suggesting we speak in his birth language - German.  Numbnuts here thinks that leaving as a child at the age of 9 from Germany would give him an excuse to not understand it.  How tf did he attend school?   After counseling me about how I didn’t pay attention to his life story, I swing back at him with",
        "URL": "https://www.reddit.com/gallery/1idv2qd"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "I was confused at first, Clearly copy paste",
        "Score": 3,
        "Comments": 0,
        "Post Time": "2025-01-31 12:55:54",
        "Post Content": "",
        "URL": "https://i.redd.it/nhchj68ytbge1.png"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Schneider - I Just Laugh When You Try To Teach Me The Law (Part 27b)",
        "Score": 82,
        "Comments": 56,
        "Post Time": "2025-01-30 19:06:06",
        "Post Content": "Thunder only happens when it’s raining.  \n\nPlayers only love you when they’re playing.\n\nSchneider’s gaslighting is out of control so Linda ups the ante.  We’re still talking about the law and what does or does not make a hostage.  He’s having none of that, yet is treading on a tightrope here.  He doesn’t want to admit he’s a hostage, yet claims he is a devoted worker who won’t leave until the money is there.  Hmm almost like he has a stake in it?\n\nWe argue more about Linda’s trip to EnQuest and he keeps on trying to gaslight her out of going.  \n\nIn the end he blatantly lies to me about EnQuest never dealing with anything escrow related before and this is their first transaction.  Sure.  He tries to save himself by saying he meant for such a little transaction like $50K after I called him on the fact that if so, they never have purchased property in the US.  Read for yourself, this is getting tedious trying to comment on the musing of a man who is trying to scam me in poor English.",
        "URL": "https://www.reddit.com/gallery/1idunuy"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Johnny part 25 - The Kolar Brothers",
        "Score": 26,
        "Comments": 13,
        "Post Time": "2025-01-31 00:56:45",
        "Post Content": "John is currently pissed off at me because I called him a horny pig, (next episode) so I don't know how many more of these I've got left...he may not get around to his grift if he can't get over his hurt wittle feewings 🤣🤣🤣🤣",
        "URL": "https://www.reddit.com/gallery/1ie2p41"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Schneider - Stop Being a P*ssy  - The Battle of the 30th Begins!  (Part 27a)",
        "Score": 68,
        "Comments": 43,
        "Post Time": "2025-01-30 18:46:33",
        "Post Content": "I won’t go into too much detail here as I am on Schneider overload at the moment.\n\nThe 30th comes and Linda is expecting him off the rig, but Schneider (as expected) refers her back to the fact the money hasn’t arrived and uses Irv’s words against her.  \n\nWe have an interesting back and forth about what makes a hostage and how the law would treat this situation.\n\nSince Schneider only wants to gaslight her, Linda vows to go to the EnQuest office in Aberdeen with Angus’s father Fergus who is a retired barrister.  \n\nIt is clear that Schneider does not want Linda going to EnQuest and keeps telling me “it’s not for me”, and it seems the limitations of his English have failed him from expressing that sentiment correctly.  \n\nTo rile him up I threaten to have Irv cancel the transaction if I can’t get any satisfactory answers from EnQuest about Schnieder’s imprisonment.   ",
        "URL": "https://www.reddit.com/gallery/1idu6ei"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Jason Statham #2 - part 10: again being calm",
        "Score": 17,
        "Comments": 11,
        "Post Time": "2025-01-31 01:22:01",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1ie37ne"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Jason Statham #2- part 11: being drunk in charge of kids, meltdown and poo",
        "Score": 14,
        "Comments": 3,
        "Post Time": "2025-01-31 01:28:37",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1ie3cgq"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "I Look For Scammers",
        "Score": 4,
        "Comments": 0,
        "Post Time": "2025-01-31 04:53:52",
        "Post Content": "I spend a lot of my days doing this. Its sad I know, but it always brings me a ray of sunshine on a gloomy day\n\nHave scammer numbers? Drop me and I'll tag you when I get the job done",
        "URL": "https://i.redd.it/wacj7c53g9ge1.jpeg"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Keanu Reeves Part 1",
        "Score": 22,
        "Comments": 28,
        "Post Time": "2025-01-30 20:27:44",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1idwma6"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Keanu pt 26- Kelly gonna Kelly",
        "Score": 23,
        "Comments": 17,
        "Post Time": "2025-01-30 19:07:33",
        "Post Content": "Not much going on today because honestly, I can’t be arsed with him. But here’s a snippet since I changed the theme to something much prettier, and then picked a fight just to make sure he doesn’t have a good day 😈",
        "URL": "https://www.reddit.com/gallery/1idup6v"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Scammer vs AI #7: The Sandwich Diaries",
        "Score": 15,
        "Comments": 5,
        "Post Time": "2025-01-30 20:56:34",
        "Post Content": "\nPretty proud of how well it's handling pictures in this conversation. ",
        "URL": "https://www.reddit.com/gallery/1idxap4"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Sailor man, part 1. Barely there, but then, deeply in love?",
        "Score": 34,
        "Comments": 40,
        "Post Time": "2025-01-30 16:34:51",
        "Post Content": "Found this guy on Bluesky, thanks to a suggestion from a member here, and he has been lazily lollygagging with about 3 messages max per day. I wrote him off, then he came back this morning in response to the threat, blaming a broken phone. Provided a great picture of \"repair.\" So I threw out some \"estate bait.\" Suddenly, he's all attentive and deeply in love. Plus inventing/designing something, which will no doubt lead to a money request. Note to self: get the money out there real early! ",
        "URL": "https://www.reddit.com/gallery/1idr0aq"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "I just want this very real totally not fake apartment :(",
        "Score": 677,
        "Comments": 44,
        "Post Time": "2025-01-29 21:28:33",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1id55q3"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Johnny part 24 - this fool wants to go clubbing 🙄🤣",
        "Score": 17,
        "Comments": 12,
        "Post Time": "2025-01-30 16:57:04",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1idrj13"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Chat, scam or nah?",
        "Score": 0,
        "Comments": 15,
        "Post Time": "2025-01-31 17:08:40",
        "Post Content": "",
        "URL": "https://i.redd.it/i2l8y0q63dge1.jpeg"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Gerard Butler is used to being free",
        "Score": 22,
        "Comments": 22,
        "Post Time": "2025-01-30 15:35:41",
        "Post Content": "When people are defensive-aggressive, it annoys the fuck out of me. Gerard Butler was one of them.",
        "URL": "https://www.reddit.com/gallery/1idpmva"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Tyler the Creator of Lies - HE FINALLY PROPOSED!!!",
        "Score": 17,
        "Comments": 11,
        "Post Time": "2025-01-30 15:57:25",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1idq4ha"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Robert Part 10",
        "Score": 27,
        "Comments": 42,
        "Post Time": "2025-01-30 10:06:27",
        "Post Content": "Voice message links in comments ",
        "URL": "https://www.reddit.com/gallery/1idjs5q"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Schneider - Wedding Invite (Part 26b)",
        "Score": 96,
        "Comments": 80,
        "Post Time": "2025-01-30 01:23:47",
        "Post Content": "I threw this together using PowerPoint.  To be clear Diane has not given Schneider this yet.  Nor have I given it to Diane to be honest.  Schneider is too dumb to get any of the sarcasm on this invite, but my hope is he’ll see this next week and think we are damn serious about having that double wedding.\n\nI also need to introduce you to the wedding party.  New characters enter so pay attention!\n\nAngus McAllister\nDiane Sexton\nPatty Hicks - Diane’s junkie mom who is flying in this weekend for Diane’s fifth wedding.\nLinda Goodman\nMark Schneider\nFergus McAllister - Angus’s father.  A calm and collected genteel Scot.\nMike Ditka - Linda’s father\n\nAlright, time to reveal the secret.  Linda’s father is NFL legend and former Chicago Bears coach Mike Ditka.  For non-Americans or people unfamiliar with the NFL - Ditka is known as a tough guy who routinely fought with hecklers and threw his gum at them.  He’s a Chicago legend who has a restaurant there.  To help explain his homophobic quote on the",
        "URL": "https://www.reddit.com/gallery/1idaixl"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Schneider - Blue Light Special (Part 26a)",
        "Score": 77,
        "Comments": 56,
        "Post Time": "2025-01-30 01:08:24",
        "Post Content": "Where we left off last night, Schneider was going to ask Diane in the morning whether or not she could lend me money to pay Irv for my accounting bill.  A bill that had been inflated by Schneider and EnQuest by all this chicanery regarding the account flagged by Trump for fraud.  Got all that?  More on that later…\n\nEvidently Schneider didn’t get the money from Diane and returned to Linda with a stern request to get this transfer moving again.  “I’m not happy”.  I was going to just cave and have Irv liquidate some of my assets to pay the invoice, but after that comment I wanted to torture him a bit.  So I decided to renegotiate with “EnQuest”.\n\nFirst a clarification about the title and what I told Schneider.  A “blue light special” is a marketing tactic the retailer K-Mart used in the 80s.  It typically represented a product that was not moving so they reduced it, highlighted by the flashing blue light.  It’s evolved into a colloquialism, at least where I grew up.  It’s like this:  “Hey",
        "URL": "https://www.reddit.com/gallery/1ida74q"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Could this be a scam? Remote job",
        "Score": 0,
        "Comments": 7,
        "Post Time": "2025-01-31 08:25:11",
        "Post Content": "Okay so. On Tik Tok i found someone who was offering job. Their profile doesn't have much followers and it's not TikTok of company it's of a individual who said he is in charge of finding workers. He then gave me a username on telegram (which is his manager he said) and you can see how conversation went with manager. (btw on the first tik tok message i just copied his comment, sent him and told him I'm interested) Could this be a scam or am I just lucky? I never had experience with remote jobs so your opinion would be helpful :). I think it's a scam because they just accepted me like that, pay was discussed only later and that's it. They didn't explain much about company or job in general and they didn't provide company register number or said where they are located or idk. I might be imagining of course, that's why I need everyone's opinion :). ",
        "URL": "https://www.reddit.com/gallery/1ieaa7c"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Schneider and Diane talk briefly in the morning",
        "Score": 58,
        "Comments": 22,
        "Post Time": "2025-01-30 01:55:24",
        "Post Content": "Here is my minimal contribution today, but really, it's the fault of Angus and his Scottish temper (and whatever he was saying in that thick brogue). I certainly did my best 😜",
        "URL": "https://www.reddit.com/gallery/1idb61q"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "I have IBS 😵",
        "Score": 77,
        "Comments": 21,
        "Post Time": "2025-01-29 20:52:58",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1id4avc"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Robert part 9 - Auntie Em, Uncle Henry, Toto, it's a tsunami!",
        "Score": 18,
        "Comments": 1,
        "Post Time": "2025-01-30 00:53:30",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1id9tzm"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Dicky, part 10b. Destiny getting fed up with Mom, who will not obey!",
        "Score": 35,
        "Comments": 11,
        "Post Time": "2025-01-29 20:19:53",
        "Post Content": "So Destiny gives me her money mule, and I refuse to do it her way. She's not happy with my ideas for getting her feeds to her!!! ",
        "URL": "https://www.reddit.com/gallery/1id3iok"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Johnny part 23 - I think he's setting up the ask.",
        "Score": 20,
        "Comments": 31,
        "Post Time": "2025-01-29 22:22:38",
        "Post Content": "I think it might be money for some kind of medicine or trearment but I'm not sure yet. It kind of seems like he's heading in that direction. He's also been texting less during the day and only after 5 or 6pm now 🤔\n\nI had this great story planned out last night about a problem we're having with a sanitation company, but today my RA was flaring and I've been in a lot of pain. I've been in bed all day and on pain killers, so I'm not sure I'm going to tell him about our problem with the Kolar Brothers (if you know, you know 🤣) because I don't really feel like talking. ",
        "URL": "https://www.reddit.com/gallery/1id6g5q"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Sharing my lovely wedding photos",
        "Score": 9,
        "Comments": 1,
        "Post Time": "2025-01-30 01:57:30",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1idb7wr"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Jason Statham #2 - part 8: e-mail to management driving him to drink",
        "Score": 19,
        "Comments": 18,
        "Post Time": "2025-01-29 21:13:45",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1id4szb"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Keanu pt 25 - sorry for spamming but I’m gonna need advice!",
        "Score": 39,
        "Comments": 39,
        "Post Time": "2025-01-29 16:54:50",
        "Post Content": "Right, contrary to all of my expectations, Keanu is offering to get me a gift card. 🤯\nThis seems such an unlikely development that I almost wonder if he’s onto me! \n\nThe advice I need * just in case* he intends to go through with it is this: \n\n- should I allow this to happen or am I just becoming a scammer? Is this ethical because even though he is a fucknut thief, I’m not. But also does he deserve it? What if I bought something with it for a food bank? Should I just pretend to give in and waive the £28.50? \n\nGenuinely interested in your opinions because you are the people likely to be the best informed about scammers! \n\n",
        "URL": "https://www.reddit.com/gallery/1icyfjq"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Keanu pt 24 - Oops I Did It Again",
        "Score": 46,
        "Comments": 28,
        "Post Time": "2025-01-29 15:30:40",
        "Post Content": "The last screenshot is just because I saw that in Recent Calls and had an existential crisis about what my life has become 🤣🤣\n\nMeanwhile Keanu is struggling and comes up with a massive discount plan to offset the £28.50 he seems reluctant to pay.",
        "URL": "https://www.reddit.com/gallery/1icweb1"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Dicky, part 10a. He's still gone, but Destiny marches on with Mom!",
        "Score": 22,
        "Comments": 19,
        "Post Time": "2025-01-29 20:16:16",
        "Post Content": "I'm pretty sure Dicky has turned the scam over to his \"daughter' who has given me the address of a Money Mule in Texas. ",
        "URL": "https://www.reddit.com/gallery/1id3fkr"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Jason Statham #2 -part 9: being calm and recapping story so far",
        "Score": 12,
        "Comments": 9,
        "Post Time": "2025-01-29 21:34:02",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1id5aqg"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Made a Friend Today",
        "Score": 13,
        "Comments": 7,
        "Post Time": "2025-01-29 18:57:36",
        "Post Content": "Better luck next time, Malakabi 😂",
        "URL": "https://www.reddit.com/gallery/1id1hjr"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Andrew Pillock",
        "Score": 12,
        "Comments": 5,
        "Post Time": "2025-01-29 16:24:42",
        "Post Content": "I eventually blocked him and reported his account where I found him. What a rude and demanding asshat.",
        "URL": "https://www.reddit.com/gallery/1icxoun"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Tyler the Creator of Lies: Part 13 - More Talks About Crazy May",
        "Score": 9,
        "Comments": 5,
        "Post Time": "2025-01-29 19:07:53",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1id1r3x"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Keanu pt 23 - More money, more problems",
        "Score": 37,
        "Comments": 36,
        "Post Time": "2025-01-29 10:21:36",
        "Post Content": "Can open. Worms everywhere 😇\n\nNGL this is a thing of beauty ;) ",
        "URL": "https://www.reddit.com/gallery/1icqqw5"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Dave Navarro - bye!",
        "Score": 13,
        "Comments": 2,
        "Post Time": "2025-01-29 14:40:02",
        "Post Content": "Lots of stupid inane messages at the beginning, the he got sporadic and so did I, and this was the end of it.",
        "URL": "https://www.reddit.com/gallery/1icv8jc"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Angus and Diane - Adventures in Scotland",
        "Score": 109,
        "Comments": 56,
        "Post Time": "2025-01-29 02:58:05",
        "Post Content": "Angus and Diane have a lot of pics to share from their time together in Scotland.  Please join them as they share their love.  Please consider this as your formal invite to their wedding on February 8, 2025.",
        "URL": "https://www.reddit.com/gallery/1ick1ly"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Jason Statham #2 - part 7: my love and addressing lies about marriage",
        "Score": 18,
        "Comments": 11,
        "Post Time": "2025-01-29 11:21:16",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1icrl33"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Schneider and Diane. What do you want NOW?",
        "Score": 97,
        "Comments": 87,
        "Post Time": "2025-01-29 01:36:12",
        "Post Content": "Well it seems like he just keeps wanting stuff, though he doesn't mention that he is no longer asking Diane for $50k!😂 I guess Irv's request for the recipient's ID and EnQuest assiciation letter, before sending the check, just didn't appeal. But luckily Diane lives in the current moment and so has moved on, only to get another request for $3k today! She is rapidly spending her credit card to the limit with very fast wedding planning, and has already exhausted other funds covering Linda's expenses, so she has to think about where she would get it before she agrees. Meanwhile, he lies and tells Linda that Diane HAS said she would provide this money for Irv's invoice to assure the funds transfer. Not bloody likely once Angus hears about it!!! ",
        "URL": "https://www.reddit.com/gallery/1icif04"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Robert Part 9",
        "Score": 23,
        "Comments": 48,
        "Post Time": "2025-01-29 09:33:52",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1icq46e"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Spent the day with “Terri”… we laughed, we AI’ed, and in the end, the scammer called me terrible names",
        "Score": 36,
        "Comments": 12,
        "Post Time": "2025-01-29 05:58:38",
        "Post Content": "I thoroughly enjoyed wasting this scammer's time today- and while I might have been one of many marks today on their caseload, we kept it going for HOURS. It started with the random text set-up, then kicked me out to WhatsApp to deal with the person\n\"incharge\". Lots of Al responses at first, that seemed to transition to a real person... a phony website asking me to login (I created frustration by loading up the real website)... a little heartstrings backstory, a lot of interruption by my day job... and in the end, a complete and utter derailing of the scammer, with some low brow goading on my part. It's a fairytale. Ultimately reported to the real company so they can work to get the fake website addressed. For your review:",
        "URL": "https://www.reddit.com/gallery/1icn7mu"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "I was ghosted 😔 I was looking forward to hearing her business idea",
        "Score": 8,
        "Comments": 0,
        "Post Time": "2025-01-29 12:40:00",
        "Post Content": "",
        "URL": "https://i.redd.it/hlpkb48fhxfe1.jpeg"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Schneider - Another Hijacked Account and Trouble from Big Irv (Part 25)",
        "Score": 74,
        "Comments": 39,
        "Post Time": "2025-01-29 00:49:03",
        "Post Content": "Schneider finally came through with another account, albeit fresh with instructions from the scammers that gave it to him.  1 - Don’t include his name on it.  2 - Irv should issue a letter after transferring.  Only that Irv did those two things before.  🤦‍♀️  But please don’t put Mark’s name on there.  OK.\n\nEdited to add:  the account has been reported several times over by our wonderful scambaiters here.  It does appear that the real Roxann has her Facebook hijacked and is likely already a victim.  Thanks to u/JLM471 for looking into that.  \n\nSchneider starts talking about love, so I divert from that by talking about Angus and Diane’s engagement.  I prompt him to text Diane with his own congratulations.  I did that because I wanted to see if he would hit Diane separately for the $50,000 he asked her to send.  Real Linda (Diane) will post about her interaction with Schnieder after this one, as it goes past the congratulations on the impending nuptials. \n\nNow back to the game.  Big prob",
        "URL": "https://www.reddit.com/gallery/1ichgcr"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Dave Navarro - A long and protracted goodbye",
        "Score": 12,
        "Comments": 1,
        "Post Time": "2025-01-29 10:54:06",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1icr6ok"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Tyler the Creator of Lies - Part 12",
        "Score": 6,
        "Comments": 1,
        "Post Time": "2025-01-29 13:44:58",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1icu2ev"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Another half assed attempt at getting my info, and them getting mad it didn’t work out",
        "Score": 54,
        "Comments": 8,
        "Post Time": "2025-01-28 23:43:36",
        "Post Content": "Wanted me to send my email so they could buy my products and I called them out on being fake, which made them mad pretty quick! ",
        "URL": "https://www.reddit.com/gallery/1icg0k3"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Jason Statham #2 - part 6: my love",
        "Score": 22,
        "Comments": 13,
        "Post Time": "2025-01-29 03:47:02",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1ickz0l"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Robert part 8 - Sharp as a cue ball, this one",
        "Score": 27,
        "Comments": 17,
        "Post Time": "2025-01-29 01:02:56",
        "Post Content": "This shit made my fucking blood boil. I almost ended it right here and told him I knew what a piece of shit scammer he was. I had to remind myself that watching this cocksucker beg for money was the end game here.",
        "URL": "https://www.reddit.com/gallery/1ichqlm"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Jason Statham #2 - part 5: unravelling lies",
        "Score": 16,
        "Comments": 7,
        "Post Time": "2025-01-29 02:57:00",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1ick0tt"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Johnny part 22 - WHAT ITALIAN DRESSES LIKE A FUCKING COWBOY?",
        "Score": 23,
        "Comments": 21,
        "Post Time": "2025-01-29 00:50:51",
        "Post Content": "Jesus monkey fucking Christ, he's such a goddamn imbecile. ",
        "URL": "https://www.reddit.com/gallery/1ichhn8"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "The Famous Douchebag",
        "Score": 52,
        "Comments": 24,
        "Post Time": "2025-01-28 19:47:34",
        "Post Content": "Long ago this faker hit me with the obligatory wave or whatever and I was like “do I know you?”\n\nHe disappeared for a long while, so I deleted it thinking it led nowhere. Then today he popped back up. Yuk.\n\nOne day maybe I will try my hand at stringing them along for days and days… but my patience wears thin quickly lol\n\nHe just rubbed me the absolute wrong way by introducing himself as “the famous” whatever, so I tire into him and axed him.",
        "URL": "https://www.reddit.com/gallery/1icaemx"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Only responding with Werner Herzog quotes",
        "Score": 18,
        "Comments": 2,
        "Post Time": "2025-01-29 01:38:48",
        "Post Content": "",
        "URL": "https://www.reddit.com/gallery/1icigtq"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Keanu pt 22- snooze first followed by cash anxiety;)",
        "Score": 47,
        "Comments": 38,
        "Post Time": "2025-01-28 20:12:34",
        "Post Content": "There’s not much to do now I agreed to pay, but I’m still trying to cause him grief wherever possible ;) \n\n",
        "URL": "https://www.reddit.com/gallery/1icb14j"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Live scammers phone number",
        "Score": 0,
        "Comments": 0,
        "Post Time": "2025-01-29 20:07:28",
        "Post Content": "\nHere’s another PayPal scammers email address and their phone number. They actually used a Gmail this time and upon looking it up, does not seem to be a throwaway as of now. ",
        "URL": "https://i.redd.it/4gu8x3c9pzfe1.jpeg"
    },
    {
        "Subreddit": "ScamBait",
        "Title": "Scammed from my pics",
        "Score": 0,
        "Comments": 16,
        "Post Time": "2025-01-29 23:38:04",
        "Post Content": "Hey, please can someone give me advice on what to do next. This person has a recording of my nudes and they are scamming me for money. They are not in my country and are threatening to send the video and pics to everyone I know. What can I do, someone please help!\n",
        "URL": "https://www.reddit.com/r/scambait/comments/1id86je/scammed_from_my_pics/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "My girlfriend is being MASSIVELY overpaid.",
        "Score": 6141,
        "Comments": 67,
        "Post Time": "2025-01-31 19:26:30",
        "Post Content": "In Washington state, I’m going to keep it vague for obvious reasons. My girlfriend works 80 hours every two weeks but on her last paycheck she got paid for 164 hours of work. This is crazy enough by itself but it’s been slowly growing each paycheck. It went back to normal for a month but then went right back up to 120 hours.\n\nMy question is, do we have to report this? Are we going to get bit through taxes or through some company law? I’d love to invest this money if we could. ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iemzhx/my_girlfriend_is_being_massively_overpaid/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "My friend had an appointment for an abortion and was told to come back in 3 weeks",
        "Score": 227,
        "Comments": 55,
        "Post Time": "2025-02-01 05:35:55",
        "Post Content": "I live in California and my friend found out she got pregnant early. She waited 2 weeks for an appointment (specifically for an abortion) and had an appointment at 6 weeks pregnant. The doctor told her to wait 3 more weeks and go back in to see if the pregnancy is viable (and to “hopefully make a better decision” doctor’s words verbatim). My friend asked if she could do it the same day as the appointment and the doctor told her to wait. Is this denying healthcare? \n\nEDIT: she went to a private hospital (the only hospital in our county) and the closest planned parenthood is 3 hours away in a different state. We live in California but very remote and she saw the only doctor in the county who is willing to do abortions. Apologies for not including that info! \n\nEDIT 2: thank you for everyone providing resources! We have resources, the reason for this post is not knowing what to do. I would like to know if this counts as denial of healthcare :) ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iezj0y/my_friend_had_an_appointment_for_an_abortion_and/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Can my job charge me for being overweight?",
        "Score": 487,
        "Comments": 46,
        "Post Time": "2025-01-31 23:07:34",
        "Post Content": "The company I work for is pushing a new policy. If your BMI is over 30, you will be charged $60 out of each paycheck until you lose enough weight. Along with $30 each check that you have nicotine in your system. This seems very discriminatory and unnecessary in the field that I work in. (I work a minimum wage job.) \n\nI don’t know, figured I’d come here and get opinions. ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ies4y7/can_my_job_charge_me_for_being_overweight/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Nephew and his wife had $23,000 taken via Cash App.",
        "Score": 395,
        "Comments": 42,
        "Post Time": "2025-01-31 23:31:49",
        "Post Content": "My 60 year old disabled nephew had someone take this money from his checking account through Cash App. \n\nHe spoke to Cash App trying to find out what happened and why. They said they could not help him. \n\nHis bank supposedly did an investigation and he was told there was nothing they could do, but did not tell them why. \n\nNeither he nor his wife are computer literate. Is here some way that I can find out what happened and get their money back? ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieso6h/nephew_and_his_wife_had_23000_taken_via_cash_app/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "I received a cease & desist after leaving a review/video after a company owner called me and said the N word",
        "Score": 582,
        "Comments": 53,
        "Post Time": "2025-01-31 19:14:01",
        "Post Content": "ETA: for all those who say this sounds unprofessional, I googled the law office. The lawyer who signed this letter states in his bio he's defended members of the Aryan brotherhood. Holy shit. Also states he's represented collegiate athletes charged with murder, and high profile citizens charged with child p\\*\\*\\*. \n\n\nTo preface, last Friday my husband left a comment voicing distaste for Donald Trump under the president's official facebook page. Someone responded to him calling him names, my husband never engages and left it at that. I received a call from that man later that night just after 11 pm I let go to voicemail, as my work line in forwarded to my personal cell. A man along with his friend proceed to say \"that comment was gay, you need to fire that answering chick, and n\\*gger you need to wake up and smell the coffee.\" They both stated their names (one being the owner of the business), and called from their work line; the caller ID even reflected as much. I left a review stating",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iemood/i_received_a_cease_desist_after_leaving_a/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "My mother keeps kidnapping my children what should I do?",
        "Score": 108,
        "Comments": 55,
        "Post Time": "2025-02-01 03:10:31",
        "Post Content": "My mother lives near my children's School. If my kids choose to go over there after school or something, she will keep them and promise them all sorts of materialistic things and they will willingly stay. I won't get them back for a week or two. They will miss school the entire time and I won't know what's happening. She's done this with my youngest daughter(14) twice and now she is on the second time with my son(17). Except this time she has manipulated him so much he is losing himself and im freaking out. \nEach time I call the police they say that there's nothing that they can do and that apparently if your child goes willingly to any adult person's house and chooses to stay there, they can legally stay there and there's nothing I can legally do about it unless I have a parenting plan in place or set one up or if i put a protective order on her because then it would umbrella my children and my son would be forced to leave. I find this to be wildly obsurd. So potentially you have to h",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iex1bf/my_mother_keeps_kidnapping_my_children_what/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Do we need a lawyer? I’m so scared.",
        "Score": 538,
        "Comments": 96,
        "Post Time": "2025-01-31 13:14:30",
        "Post Content": "Posted in AskLE was told maybe here is better to ask… \n\n\nDo I need to call a lawyer? I’m so scared.\n\nHello. \n     A little over two months ago, my son was accused of being a school shooter.. We moved to this area in Late October and 6 days after he started at his new middle school, he was pulled into the office, searched by the school resource officer, and questioned by her and admin about a rumor they had heard that my son had said, “this school sucks and he was going to shoot it up.” We were made aware of this all happening at the END of the school day when my son returned home.. \n\nI believe the next day my husband and I had a meeting with the vice  principal, where we were told the accusations were unfounded and assured this wouldn’t happen again. See, I raised the question then what is to stop these rumors again? \n\nSince then my son has struggled socially at this school. He talks to the guidance counselor regularly. He was in her office two days ago because of some doodles he had d",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieei1k/do_we_need_a_lawyer_im_so_scared/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Can I sue a surgical resident for accessing my medical records without my consent/against my will in NYC?",
        "Score": 239,
        "Comments": 65,
        "Post Time": "2025-01-31 15:36:39",
        "Post Content": "For context, I (27F) am estranged from my father and his girlfriend after nearly 5 years of their combined abuse towards me, and a lifetime of abuse from my father. I recently had bowel resection due to complications from crohn’s disease at a highly reputable hospital in NYC, which I have been under their care for 5 years. My GI and surgeon are both in this practice. \n\nWhen my father found out through a family member that I was undergoing the procedure, he told his girlfriend whose daughter is a surgical resident at the same institution. She then went and accessed my records, against my will/without consent to report the status of my procedure to my dad and his girlfriend. \n\nI know this is a hipaa violation and I feel extremely violated it’s a complete invasion of privacy, considering I have never spoken to the daughter, do not know her, do not have a relationship with my father or his girlfriend. I mean what if I had highly sensitive information does that mean she gets to just report ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iehhb7/can_i_sue_a_surgical_resident_for_accessing_my/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "I was assaulted by my neighbor last night. Not sure what to do next. [CA]",
        "Score": 36,
        "Comments": 24,
        "Post Time": "2025-02-01 00:48:39",
        "Post Content": "Throwaway because safety.\nAt about 2:30am last night I was woken up to the sound of loud music and pounding bass from the unit nextdoor to me. I live in a renter-only apartment building. To the best of my knowledge it’s owned by one of those massive real estate companies that own “luxury” apartment buildings all over the US.\n\nAnywho, the loud music didn’t seem like it was going to stop anytime soon. So I decided to go over to my neighbor’s apartment and politely ask him to turn it down. I want to make it clear that I did not come at him aggressively, or even rude. I wasn’t happy of course, I was just…monotone (probably because I was half asleep).\n\nSo he opened the door, I asked him to turn it down and he went ballistic on me. “Who the fuck do you think you are coming to my door? Motherfucker I pay rent here just like you, I can play my music as loud as I want. Don’t you ever knock on my fucking door ever again! I’ll beat your ass. I’m a crazy motherfucker, you don’t know me!” \n\nNow at ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieub62/i_was_assaulted_by_my_neighbor_last_night_not/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Just been disqualified for my dream job due to a police citation I received when I was about 12yrs old.",
        "Score": 2882,
        "Comments": 58,
        "Post Time": "2025-01-30 23:22:22",
        "Post Content": "I, mid 20s M, have been disqualified from a job I have been working years to get. To get to the point, the reason why it happened is because of a citation a middle school police officer gave me when I was about 12. I was walking home from school with friends and we stopped to hang around a stop sign where we were repeatedly jumping and hitting it for fun. Some teacher happened to drive by as we were doing this and saw me being the last one to reach up to the stop sign, she put her window down and yelled at me to stop so I did and walked away. Hours later our middle school police officer shows up to my house saying that he got a call from the teacher that I was vandalizing the stop sign, and he was claiming that I had wrote “Norte” (a gang) on the stop sign because that’s what he saw when he reportedly went up to the sign. He wouldn’t leave my home until I forcefully confessed something. I explained to him what really happened but he told me he was just going to do his job and gave me a",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ie0pbs/just_been_disqualified_for_my_dream_job_due_to_a/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Doctor refusing care based on incorrect test",
        "Score": 317,
        "Comments": 24,
        "Post Time": "2025-01-31 11:05:38",
        "Post Content": "I went in to get my medicine Monday (annual physical, turn you head and cough type stuff). My medication is considered a level 2 controlled substance.\n\nI didn't care, because I ACTUALLY take my meds and don't sell them, but my test results can back negative.\n\nI was super shocked and confused. My doctor is now refusing to prescribe me my medication and has refused future care. I have written proof of that.\n\nIt didn't make any sense. I have to take one of these tests once a year. Passed with a happy positive every year. So I dug up my previous test. \n\nWELP. She tested for the wrong medication! Two medications are commonly prescribed for my condition, she tested for the wrong one, which still disturbs me because I should have to double check a doctor's work.\n\nI contacted them immediately and told them of the error. They aren't getting back to me.\n\nPolicy is that my sample should be on file for 7 days so the clock is ticking there. I only have enough medication to get me to February 11th s",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iecdat/doctor_refusing_care_based_on_incorrect_test/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "I won a default judgement against someone who owes me money, what do I do next?",
        "Score": 14,
        "Comments": 13,
        "Post Time": "2025-02-01 03:32:44",
        "Post Content": "I am owed around $25k by someone since 2022. I sued this person in court (pro se) and won in court. I don't know where to go on from here. Some people have said I can reach out to this guy's bank or that I can reach out to the police (or FBI, since he lives in two states - Ohio and Illinois). What's the most effective way now to collect my funds? ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iexftj/i_won_a_default_judgement_against_someone_who/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Salaried employee, can they mandate off the clock hours?",
        "Score": 34,
        "Comments": 10,
        "Post Time": "2025-01-31 22:31:06",
        "Post Content": "So I am a salaried employee for a large pizza franchise in Minnesota , my offer letter says and I was told that our mandatory hours was 45, now I’m being told it’s 50 but we have to work 5 hours off the clock, mind you I’ve literally work 100 hours in 1 week and still only been paid my normal 45 hour salary. Can they actually mandate 5 hours of off the clock work??",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ierbkw/salaried_employee_can_they_mandate_off_the_clock/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Did I just get legally threatened by a lawyer over a private sale?",
        "Score": 698,
        "Comments": 61,
        "Post Time": "2025-01-31 05:32:18",
        "Post Content": "I recently sold a 2007 dirt bike that had been converted to be street legal using a cheap kit. It was registered, insured, and plated, so I listed it as street legal. The buyer inspected the bike, test rode it, and wrote his own bill of sale, which I signed. The sale did not include any warranties or guarantees. He paid $2,600, took it home, and that was that—or so I thought.\n\nA few days later, he messaged me saying:\n\n* The bike wouldn’t start (I advised him to use the kick-start method in cold weather).\n* The blinkers and horn didn’t work (Pre-sale I had mentioned that I’d had problems with the taillight/blinkers before and even showed him where to check if they stopped working).\n* The bike was overheating and leaking coolant while idling in his driveway at 40°F (something I had never experienced before). He thinks the head gasket blew.\n\nWhen he sent me videos, I was shocked—it had never acted that way when I owned it. I couldn't believe it was overheating in that kind of cold, while ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ie7ukn/did_i_just_get_legally_threatened_by_a_lawyer/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "I think my boss hit my car. I asked to see security footage. He won’t show me. Now what?",
        "Score": 81,
        "Comments": 32,
        "Post Time": "2025-01-31 17:11:33",
        "Post Content": "Basically the title. Nothing severe. My passenger mirror is drooping and it looks like the paint was pulled off. I have a scuff on my headlight so I think it was hit at an angle. This is a new car. Hmm. ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iejpud/i_think_my_boss_hit_my_car_i_asked_to_see/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Former club president holdings bank account hostage for over 18 months.",
        "Score": 45,
        "Comments": 3,
        "Post Time": "2025-01-31 18:00:17",
        "Post Content": "I am a volunteer leader with a 4-H Club. In June of 2023 our former president retired from the club. She had sole access to the club’s bank account. When she left she gave the checkbook and bank card to our County Agent. We don’t know how much was in the account for sure but it’s probably between $2,000-$3,000. She has held the account hostage.  We never saw any treasury reports nor did she send the bank records for the club to our main office. She left no PIN number and as she was the only signatory on the account, so we cannot sign any checks. We have made many good faith efforts to try and contact this person but she will not respond.  Yes, we’ve asked the bank and our county agent for help and there is nothing we can do at this time without her collaborating with us. \n\nIs this illegal? I’d love to file a police report. \n\nTL;dr: ex club president is holding all club monies hostage and refuses to allow the money for the current club. ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iekwep/former_club_president_holdings_bank_account/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Amazon Driver Got Stuck & Ruined My Driveway",
        "Score": 6,
        "Comments": 1,
        "Post Time": "2025-02-01 02:30:49",
        "Post Content": "I am in Texas and this happened just a few hours before I made this post. After making a delivery, an Amazon driver backed up into a small creek that my crushed concrete driveway goes over. For about 15 minutes, he continued to forward and reverse turning his wheels very sharply to the right and left. This dug massive holes into my driveway, which will only grow larger the longer that they remain. I took many pictures and videos of the incident while he was here and after he left. Amazon had to send another vehicle to tow him out. I haven't gotten a quote, but I am thinking that it will cost somewhere around $1,500 to repair. How do I proceed? I'm not trying to get a whole new driveway, just the damaged areas repaired. Thank you in advance for any advice. ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iewatn/amazon_driver_got_stuck_ruined_my_driveway/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Can I sue my neighbor?",
        "Score": 3,
        "Comments": 2,
        "Post Time": "2025-02-01 04:45:24",
        "Post Content": "Purchased a duplex (with a shard porch) in the winter of 2022, by spring of 2023 I noticed a foul odor in my home and couldn’t figure out what it was until my neighbor opened his front door. The smell of animal excrement punched me in the nose. By summer I was dry heaving in my home, unable to run the AC due to the foul smell when the house was shut.  I was forced to open all my windows in the middle of heat waves due to the odor. Came to know my neighbors they have about 5 dogs and 6+ cats. In the 2 years I’ve lived in my home I’ve seen the dogs outside a maximum of three times. I began getting bug bites at home around 6 months ago,  discovered bedbugs. Different neighbor mentioned that the house next to me had been treated numerous times over the years. I’ve moved out of my house around 3 months ago staying with family I took what I needed to survive and started packing up the rest of my belongings in an attempt to sell the house. Tonight they had a heat treatment done that made my h",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieyp80/can_i_sue_my_neighbor/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "forgetting to pay taxes?",
        "Score": 2,
        "Comments": 0,
        "Post Time": "2025-02-01 07:49:59",
        "Post Content": "okay in my defense i'm only 20 and my dad has been doing less than satisfactory tax practices his whole life, but no one really taught me how to do my taxes. i get different answers from people, like saying i don't have to file since im claimed as a dependent.\n\n\ndo i have to report fafsa/government aid? do i report it even if i make under the minimum wage in my state? legally, how much standing do i have to argue \"your honor i'm stupid and was never taught taxes\"? how likely are they to find out? am i cooked?",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if1gy5/forgetting_to_pay_taxes/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "CA - Terminal spouse with CC debt",
        "Score": 2,
        "Comments": 0,
        "Post Time": "2025-02-01 06:43:04",
        "Post Content": "My stepdad was recently diagnosed with cancer, and it’s terminal. He recently applied for a couple of new credit cards (in his name only) and my mom is concerned that he will make impulsive purchases and that she will be responsible for his debt when he passes away.\n\nI understand that credit card debt must be paid from the estate, but I’m unclear as to what assets would be considered part of his estate. Could they pull from joint savings accounts? Or directly from my mom’s retirement accounts? Would it affect life insurance payout? Would their mobile home be fair game? If so, is there anything my mom can do to protect herself now, while he is still alive? \n\nall advice appreciated, TIA.",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if0jes/ca_terminal_spouse_with_cc_debt/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "LLC owned by another LLC????",
        "Score": 3,
        "Comments": 1,
        "Post Time": "2025-02-01 04:26:14",
        "Post Content": "Hello, we have a current LLC and want to establish another LLC as a sister company. Can the parent LLC be the owner and if so are the parent companies assets on the line? \n\nAlso, is there a better way to do this? \n\nThank you for all your help! ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieydv2/llc_owned_by_another_llc/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Custody of little sibling",
        "Score": 2,
        "Comments": 0,
        "Post Time": "2025-02-01 06:31:16",
        "Post Content": "My step dad (also step dad to little brother) wants me(25F) to take in my 15yo brother. He's having behavioral problems and is disrespectful to those around him. He's failing almost every class in school and has given up. This has been an on and off issue for years now and my step dad is out of ideas on how to handle this. He's provided him tutors, therapy, guidance and none has worked. He has asked me if I'm able to take him in and me and my husband are considering it but don't know the process of gaining guardianship. \n\nWill this situation grant us guardianship in court if step dad agrees? \n\nMore background info:\n-My husband(28M) is in the Air Force (9years of service).\n-I have a part time job but am almost finished with my bachelor's degree. \n-We have two young toddlers at home.\n-Financially stable (only car and student loan debt) \n-We currently live in a 2bd apartment but will move to a 3-4bd house shortly after gaining guardianship\n-Can easily provide for my brother and get him ad",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if0di7/custody_of_little_sibling/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Classic laid off but employer is claiming I was fired instead.",
        "Score": 2,
        "Comments": 2,
        "Post Time": "2025-02-01 06:25:48",
        "Post Content": "So about 2 weeks ago I was let go from my job. The decussation I had with my boss was pretty standard “we are restructuring” “in order to meet goals I’m going to have to lay you off.” “I’ll be happy to write a recommendation letter for you.” They also gave me 2 weeks severance pay. \n\nI go home and immediately apply for unemployment in Ohio and have been filing for each week. I still have not received any funds from unemployment and my severance ended this week. \n\nI got an email today from unemployment saying there is an eligibility issue with my claim. My employer is now claiming that I was fired so I am not eligible for unemployment. \n\nHere is where I could get fucked over. \nThe company I worked for had only 8 employees. I didn’t get any paperwork when I was let go. \n\nHowever they never spoke to me about my job performance being inadequate. And they don’t have any documentation that I’ve seen or signed about disciplinary action needed. \n\nI called unemployment today and told them that ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if0aky/classic_laid_off_but_employer_is_claiming_i_was/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Can abusive grandma actually take my fiancée to small claims court or is she just being insane?",
        "Score": 8,
        "Comments": 13,
        "Post Time": "2025-01-31 23:27:28",
        "Post Content": "Hello!!\n\nOkay so my fiancée (I will call her Sam) was raised by her grandma from the age of 3 due to some unfortunate circumstances. Her grandma is also fucking insane.\n\nA little over a year ago, Sam moved from Florida to Illinois to live with me. She didn’t have a job lined up yet because her career required her to transfer licensure etc whatever it’s not relevant. I couldn’t afford to pay for all of our expenses, so to help with moving costs and living expenses, her grandma let her use a credit card of hers, which was really helpful. She was having my fiancée pay her back $100/month once she started getting paid.\n\nA few months ago, they got into an argument over Sam asking her to stop talking shit about her ex wife, who also raised Sam and is functionally her mom and has always had a great relationship with Sam. This caused her to tell Sam that she’s dead to her and all this. She keeps trying to piss Sam off every few weeks by saying deranged shit like she wishes she never took her i",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieskrp/can_abusive_grandma_actually_take_my_fiancée_to/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Rejected Last Minute Rent Payment",
        "Score": 5,
        "Comments": 4,
        "Post Time": "2025-02-01 01:09:26",
        "Post Content": "Yes, I’m making a payment very last minute as that’s what it seems to have come down to.\n\nBasically I couldn’t (didn’t) pay my rent this month until this very last minute. My complex wouldn’t allow me to pay in any way besides submitted cashiers checks through their resident portal app.\n\nI’m making this post on 1/31/25 and submitted a cashiers check that totaled all of my late fees, attorneys fees, etc. including my January rent amount that were visible to me in that portal at the time.\n\nI want to mention that they also “billed” February’s rent which was dated as “2/01/25” today which is 1/31/25. Because of that my landlord rejected my “partial payment” stating that they had already billed me for February’s rent and that I had to make a payment of that amount too in order for them to accept payment.\n\nI have an email from my landlord on the 29th simply stating that “If I pay after February 1st then I have to pay to pay that month too.”\n\nI’m trying to figure all of this out and I paid th",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieuqgm/rejected_last_minute_rent_payment/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "A former client not providing payment for services provided in 2024. What are the implications for 1099 filing and taxes? (Illinois, US)",
        "Score": 2,
        "Comments": 0,
        "Post Time": "2025-02-01 06:04:16",
        "Post Content": "I was a contractor (healthcare provider) and the former client was a hospital, and it's clear that they're struggling financially. They owe me several thousand dollars but it's less than $10,000 and is an amount eligible for small claims court in my state (Illinois). They're several months late on payment, despite me reaching out to them through phone calls and emails multiple times about this late payment. They've repeatedly told me that they're working on processing the payment and even went as far as telling me that it would be mailed shortly, which it never was.\n\nWhat are my legal options?\n\nWhat are the implications for 1099 filing and taxes?\n\nIf I don't receive payment or receive it late, when should I pay taxes on this?\n\nIs there a deadline when they're legally obligated to provide me a 1099 form? (I believe the deadline is Jan. 31st, 2025 for W2 employees but not sure if that's the same for 1099 contractors.)\n\nAny advice would be greatly appreciated. I've never heard of such a s",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iezz1g/a_former_client_not_providing_payment_for/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Property disputes after my Dad died",
        "Score": 3,
        "Comments": 7,
        "Post Time": "2025-02-01 03:49:47",
        "Post Content": "My Dad died in late 2023 (December to be exact) and after there was a lot of questions on how to split the property. My dad made it very clear to all of his side and my mommas side of the family that if something was to happen to him he wanted all his things to go to me  (I'm a 16M, his youngest child, and his only son). Now when he died some of my nephews and nieces wanted some clothes to remember him by which I had no problem with at all and was there when they took them. The problem arises when my sisters (who are all grown) started to take stuff that I was clear I wanted to keep his old lawn mowers, silver coins, etc and even asked me where my key was so that they could pay a safe deposit box. But ended up just taking the silver out of there too. They also said they wanted to move the lawnmower equipment to a different state even after I expressed I wanted it to stay home. \n\nMy question I have is that me and my other sisters have been thinking of contacting a lawyer on Monday and I",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iexqxi/property_disputes_after_my_dad_died/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Laid off while pregnant, what amount to ask for in demand letter?",
        "Score": 2,
        "Comments": 2,
        "Post Time": "2025-02-01 06:01:05",
        "Post Content": "I was 21 weeks pregnant when my work contract wasn't renewed. I have an attorney and we are writing a demand letter. The attorney is working on contingency getting 33%. It is impossible for me to get another job this far into the pregnancy and I am applying for disability. My expectations were to receive an equivalent of 8 months of pay (4.5 months for the remainder of the pregnancy + time for maternity leave) plus the 33% for the law firm. The attorney suggests more. Is this too much? Too little? How much should we ask for in the demand letter? ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iezx1v/laid_off_while_pregnant_what_amount_to_ask_for_in/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Unfair cleaning charges due to messy roommate, Can I fight this charge?",
        "Score": 3,
        "Comments": 1,
        "Post Time": "2025-02-01 03:29:10",
        "Post Content": "To start I will add some clarifications of the situation\n\n* I (18) am a first-year university student in the UK living in student accomodation\n* I share a kitchen with 5 other people, however one flatmate has been a problem\n* This accommodation is provided by an external company to my institution\n* One of the \"flat-mates\" (for the non english, a roommate) is very unclean, uses illicit substances inside the apartment (sometimes in the shared communal kitchen), and is generally really loud late hours into the night\n\nThe current situation\n\n* Upon returning to my apartment after a very long Christmas break, we discovered \"TB\" had not left over the break between semester 1 & 2\n* Not only had he not cleaned up after himself in this duration, he had also left food all over the kitchen - rotting and moulding\n* When asked to clean it up, he did so reluctantly but also didn't do a great job and the kitchen is still rather messy\n* Since moving in he has continuously produced mess, filth, lots of ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iexdfs/unfair_cleaning_charges_due_to_messy_roommate_can/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Mother had me co-sign at 18 with a promise of paying, but never did. Am I screwed?",
        "Score": 2,
        "Comments": 0,
        "Post Time": "2025-02-01 05:21:58",
        "Post Content": "Hello, this is a bit of a long one and requires some background.\n\nMy mother is someone that has always had a terrible drug problem. I was taken away from her in the second grade because the conditions were dangerous. My father also had a bad drug addiction which eventually took his life in 2016. After leaving my mom in  the 2nd grade, she ran off the a city a few hours away from my hometown. I was always EXTREMELY close with my mom, as I had a lot of medical issues since birth and was with her at all times. This is to say, even after leaving her home, I always longed for my mother to be in my life. This led to a very long pattern of false-promises, false hope, and heartbreak. No matter how many times my mom lied to me, broke promises, or I was warned to expect less from my mother growing up, I gave her an infinite number of chances, which shes always abuse. Well, in the 9th grade my father kicked me out of the house after he broke into a rage having to do with the drugs he was selling ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iezaze/mother_had_me_cosign_at_18_with_a_promise_of/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Parent died in California but recently updated their will",
        "Score": 2,
        "Comments": 2,
        "Post Time": "2025-02-01 05:06:48",
        "Post Content": "Hi r/legaladvice,  Here is the long and short of it:\n\nMy friend’s parent recently died, unexpectedly. The deceased updated their will recently in the past 6 months. In this will, they named specific bank accounts and beneficiaries. They were of sound mind and judgement.\n\nThese accounts and named beneficiaries in the will contradict the named payable on death (POD) and beneficiaries on said accounts. The children were the only named beneficiaries in the will.\n\nThe deceased was going through a lengthy divorce with their spouse, whom they excluded from the will entirely, but did not remove the spouse as a beneficiary on the accounts.\n\nMy understanding is that typically, named beneficiaries and POD accounts skip the probate process entirely. Particularly if a will does not name specific assets.\n\nBottom line, do the children have any grounds to contest the POD’s and benefliciaries on the accounts since they were specifically named in the will, or are they hosed?",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iez292/parent_died_in_california_but_recently_updated/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "NYC - My father owes 60k in back child support because my mother committed welfare fraud.",
        "Score": 38,
        "Comments": 5,
        "Post Time": "2025-01-31 13:20:59",
        "Post Content": "NYC. My parents separated in 2004. My father left the family home and became essentially homeless for some time. I stayed with my mother until 2005, when she had a mental health breakdown and I moved in with my grandparents. During this breakdown, as she was no longer able to work, a social worker at the psych hospital she was in assisted her with applying for welfare / other benefits. Even though I had not been living with her for a couple of months at this point and there was no plan in place for me to return, she stated that I was living with her on her application. She apparently claims that this was in good faith as she thought I'd be coming home soon. When she began receiving welfare, a child support order was opened against my father - which I know is standard and makes total sense, except a) I wasn't living with her for her to support and b) my father was homeless and ALSO too sick to work.\n\nMy mother received welfare benefits for both her and me from approximately mid 2005 - l",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieemfo/nyc_my_father_owes_60k_in_back_child_support/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Every apartment in my building pays vastly different prices.",
        "Score": 4,
        "Comments": 3,
        "Post Time": "2025-02-01 01:03:57",
        "Post Content": "Seattle, WA\n\nHi! I live in a ~400? unit building. Super old, constantly leaking, no parking, no dishwashers in the units, no elevator, windows suck, whatever else. The entire building is ~350-600sqft studios and “junior” studios, and I think maybe a few proper one bedrooms. \n\nI moved into my ~350sqft (idrk) studio on a 1 year lease in November of ‘23 for $1,290/mo, w/s/g included. \n\nAugust, I get an early renewal offer for $1,340. I agree to a 6 month lease since it was the same as 12 and I was hoping to move out of state by then (looking like the end of the year now though). \n\nIt’s basically February now and I get an early renewal offer for July at $1,465. I hit the building group chat where we have ~15 of us pretty active and asked if anyone else was getting theirs so far in advance. \n\nThen I learned everyone’s rent here ranges from $1200-1700. The girl under me has an almost identical unit and got a renewal offer for $1250. I don’t get it. \n\nIs there anything I can do here? ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieumkc/every_apartment_in_my_building_pays_vastly/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Someone broke our window and we think we know who did it, how do I proceed",
        "Score": 1,
        "Comments": 1,
        "Post Time": "2025-02-01 08:30:10",
        "Post Content": "So, for context, my father is disabled and my mom drives, so we park in disabled spots, since we have a valid card. Now, in our neighborhood there's also someone who has a disabled card, and I guess he's mad about us parking there? So this morning, we got to our car and we saw he (or someone else, just speculation) broke one of our smaller mirrors (you know, one of those tiny side ones right behind the windshield) what can we do? I took a pic of his licence plate since he parked right Infront of us, he'll probably move his car once we're back. We live in Spain, what can we do?",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if20gj/someone_broke_our_window_and_we_think_we_know_who/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Boss screamed at me and wouldn't stop, what would be the if any next legal step in IL?",
        "Score": 1,
        "Comments": 2,
        "Post Time": "2025-02-01 08:28:18",
        "Post Content": "Literally just started screaming at me when i walled into his office and I told him nicely to lower his voice, then in an assertive voice told him twice for us to be professional but he proceeded to answer back with \"I AM BEING PROFESSIONAL\" just straight up screaming it at me. Still screaming at me so I yelled back at him to stop it and that he doesn't have the right to talk to me like that and if he doesn't stop I will leave the room and pause this conversation and come back when he's calmer. He got a bit better after i said this and I would complain to HR abt his unprofessional behavior (he has yelled at me before but this one was the worst, and he has screamed yelled at other employees like this as well-this is normal awful behavior from him) but not only is he the main boss but he's also HR. So like I can't complain to him about him...any advice? Any recommended next step or any legal step if any? I know it's legal to yell at employees but this was next level and he treats the sta",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if1zm8/boss_screamed_at_me_and_wouldnt_stop_what_would/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Do i need a motion to adjust child support?",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 08:26:46",
        "Post Content": "This is a two part question.\nI have been making payments on some arrears for several years. The order for the arrears payments says they were to continue \"until the arrears are paid in full.\" I recently realized that they were paid off in 2023. Since the order says that they would stop when paid off, do I have to get a lawyer and file a new motion to stop paying the extra money?\n\nIne of my children just turned 18 & moved in with me. Do I have to file a motion to change child support to drop him & recalculate my obligation?",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if1yw7/do_i_need_a_motion_to_adjust_child_support/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Are booth rental laws/limits regarding late fees?",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 08:26:24",
        "Post Content": "I signed a contract that I now acknowledge I should’ve read more carefully. If anyone has a sourced answer it’d be greatly appreciated! Can’t seem to find a straight answer for booth rentals. Can I be charged a daily late fee? And can it exceed a certain amount? It’s unusual to me that for my next months rent I owe almost a thousand dollars for a booth at a cost of $400/mo. The reason it kept accumulating after rent amount being paid  is because she has her policy as the “late fee also must be paid in full, doesn’t stop until paid in full.”\nI paid half my rent after one week, the other 200 at day 17. I reached out to pay the accumulated total of $20x17= $340 on day 29 but was corrected and told I would owe $580 because it never stopped accumulating \n\nLate fee: $20 each day late (after the 1st, no grace period mentioned) \nAccumulated late fee total: $580 as of today.\n\nTIA",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if1ypw/are_booth_rental_lawslimits_regarding_late_fees/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Feeling unsafe.",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 08:23:54",
        "Post Content": "Hi all I was a witness in a court case about my child’s father. He’s got done for quite a lot of sexual charges. I don’t feel safe in my house anymore. Sometimes when I leave and walking down the streets his mates will stop what they are doing and honk at me, will circle around to purposely drive back past me etc. I feel anxious and scared. I don’t leave the house at all unless I have to now because I’m scared I’ll see someone he knows. The court case is over but I don’t feel safe at all. He is telling all his friends/family I’m the one to blame as one of my old friends was talking to one of his mates and they’ve all expressed a interest in not liking me because of the lies he’s made up. His family have approached one of my family friends before he was arrested to try gather information on my child and I had frequent friend requests given every week from his friends before he was arrested to try gather information about me and my daughter aswell. Could I write to the council about poss",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if1xjx/feeling_unsafe/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "(MN-USA) Well Water Unsafe to Drink",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 08:19:36",
        "Post Content": "Hello! Me and my partner have recently moved into a small family home that is on well water. When we toured/interviewed we were informed that the water was from a well and was safe to drink. The property does not come with a water softener nor any filtration system and we were told if we wanted we could install a water softener out of our own pocket. \n\nI didnt like how the water smelled and payed out of pocket for a full panel water test (about $400). Results have come in two weeks later and our water is “not advisable to consume” without a filtration system installed. My landlord is apposed to installing a system as it would be very expensive and insists that a water softener should do just fine for us. But the company who took our tests says that a water softener will not do anything but remove the smell from the water. AKA remove the smell and leave all the metals & contaminants behind.\n\nis there any right for me to push for a real filtration system to be installed? We were quoted u",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if1vfm/mnusa_well_water_unsafe_to_drink/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Recieved court date letter after they already went to court",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 08:16:37",
        "Post Content": "Recently was arrested for \"obstructing a peace officer\" and was sent a letter in the mail for my court date AFTER they already went to court. I've been hearing this happening to a lot of people in my area. Is this just on purpose? \n\nAlso I would like to add that I wasn't obstructing anything whatsoever. The 3 officers arresting me broke both of my wrists and not only handcuffed my hands but also cuffed my legs. They had to send an ambulance over to take me to a hospital, afterwards they took me to jail. In no way was I resisting whatsoever. I'd like to explain the rest of the story but I don't think there's a point because our judicial system is trash in the United States. I doubt this will gain traction. God Bless America. ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if1u0h/recieved_court_date_letter_after_they_already/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Fraudulent debt claim against estate, inaction?",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 08:15:32",
        "Post Content": "My parent passed away in another state.  I am the executor of the simple estate.   The only asset was a home that was sold for > $50k.  A debt collector filed a claim against the estate for $2k.  This is for an alleged credit card debt. My parent was a paraplegic who was bedridden and could not even use a phone for the last decade. They had not left the facility they were at and did not have access to the Internet. I am confident the debt claim is fraudulent or the debt is fraudulent. I’ve requested debt validation from the firm and they’ve ignored me. The attorney that’s handling the probate for the estate refuses to do anything other than tell me I need to get a release claim from the debt collector. I’m now getting letters from the court that I will be fined if the estate is not settled \nWhat should I do? I absolutely refuse to pay the $2000 and I’m willing to do whatever it takes to fight it. I considered even flying into that state and filing a small claim suit against that debt c",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if1tj6/fraudulent_debt_claim_against_estate_inaction/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "My job might have almost unalived me?",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 08:14:27",
        "Post Content": "To stay as anonymous as possible, I (17F almost 18)will call my work Krusty krab and my dm (district manager) Mr krabs. I work at a place where we don't get much business so there's often 1-2 people working at a time at most. 3 is rare. I just started here last week, and today I was tasked with running it alone for a few hours before someone from another store came to help.(?) But he hadn't worked at this location and hadn't closed alone. At 7pm the sprite went out, and an alarm for c02 started going off and flashing. Didn't have a clue what it meant. Seemed concerning. Texted Mr krabs and he didn't seem worried. Just said to disconnect the sprite to replace it later. I disconnected it and air came out. He said it would come out until it was done. The alarm was reading high ppm and had a flashing light next to a yellow and black symbol of what looks to be a person passed out dead against a wall.. I had a hard time recalling and tracing shit afterwards for a brief moment, and also thoug",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if1sz1/my_job_might_have_almost_unalived_me/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "need help with providing reasons to get a refund",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 08:13:59",
        "Post Content": "I'm in Australia and for my course I need to get a new police check, I already got one last year but the course needs a new one that isnt older than 3 months.\n\nI went to a police check website to apply but it was only after I paid that I realized I had the wrong website and that I needed to go to a specific one that my course wants.\n\nI havent sent in my details on the current check nor submitted it and based on their FAQ that as long as I havent submitted a partially complete form or completed form that I am still legible for a refund.\n\nI plan on calling their centre on Monday, but I'd prefer to have a reason why I cant use the service and why I should get my refund instead of having to say \"sorry i made a mistake\" because will NOT get me my money.\n\nI'm a student and I need that money to get my other course fees paid. Honestly its not the end of the world if I cant get a refund but a 70 AUD mistake is pretty hefty.\n\nCheers.",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if1sq6/need_help_with_providing_reasons_to_get_a_refund/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "We just moved out of out Apartment on the 31st, but my Autopay for rent withdrew feb's rent on the 29th. I am owed this money back correct?",
        "Score": 4,
        "Comments": 8,
        "Post Time": "2025-02-01 00:40:42",
        "Post Content": "We just moved out of our complex on the 31st, we were living month to month for the past 3 months until the house was ready to move in. We let them know back in Dec that we would be out by the end of Jan. I've always had Autopay set up for rentcafe on the 29th. My own mistake for not turning it off, but it withdrew the rent on Jan 29th for Feb rent even though we are moved out. I am owed this money back correct? Since we are not living there for feb. Part of out month to month agreement (aside from an extra $100 fee/mo) was that we had to let them know a month in advance of our move out date. The complex won't be open until Mon, so I can't do much this weekend. I just want to make sure I am owed that money back",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieu5a5/we_just_moved_out_of_out_apartment_on_the_31st/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Acedentally recording a phone call in a 2 party consent state??",
        "Score": 2,
        "Comments": 0,
        "Post Time": "2025-02-01 04:25:59",
        "Post Content": "Context: I live in a 1 party consent state, and I have an app on my phone that records my phone convos. Not for anything devious...it comes in handy if it's discussion about Dr appts or meeting dates/times and I'm unable to write the info down, like if the call comes in through my Bluetooth and I'm driving.\n\nBut...I have friends/family who live in FL which is a 2 party consent state. Whenever they call me I get so super paranoid and worried about if I turned the app off prior to answering.\n\nIf I forget to turn it off and accidentally record the convo, then discover it after the fact and just delete it...could I get in trouble if they find out? \n\nThe app is so useful for me...but not if it could open me up to a world of trouble!\n\nThanks!",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieydpz/acedentally_recording_a_phone_call_in_a_2_party/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Whole milk purchased from the store tested positive for cannabis",
        "Score": 1,
        "Comments": 1,
        "Post Time": "2025-02-01 08:07:38",
        "Post Content": "I purchased simple truth organic whole milk from Fred Meyer in AK- utilized the drive up/pick up service.I had given my children (2 children under the age of 5) multiple glasses before I had a glass which then realized tasted very odd my husband noticed the same thing- it smelled like marijuana. We purchased test strips from Walgreens and on two separate tests it tested very positive for cannabis. Neither my husband or I use marijuana recreationally, we don’t keep any in our house at all. There are no other adults or individuals living or coming/going. \n\nI called poison control, the state health dept, notified Kroger and filed a non-emergent police report. My children have both been seen by a physician and are thankfully ok. I am so frustrated- am I missing any reporting? And do I have a case if I were to pursue something. ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if1pnz/whole_milk_purchased_from_the_store_tested/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Am I liable for not reporting adultery and theft of maritial property?",
        "Score": 0,
        "Comments": 0,
        "Post Time": "2025-02-01 07:58:49",
        "Post Content": "Two years ago a friend decided she was a lesbian. The problem is she was married to a man and had been for a long time. Both were heavy weed smokers, their home was really nasty but they owned it. \n\nMy friend did tell her husband she was a lesbian, I think. But within a few weeks she had a girlfriend and after a month or two, her gf moved into the martial home, like so soon the gf was the one moving the husband out of the master bedroom.  \n\nWe live in North Carolina. I’m not friends with this person now, we had a huge, weird falling out. But she’s gotten divorced and somehow kept the home? I think it’s likely she lied to the court, and from what I saw before I left she was deriding and abusing the husband, who couldn’t afford to get his own place so I’m guessing he couldn’t or wouldn’t fight for what he should get?\n\nAm I in any way liable if this man ever realizes she fleeced him in divorce? There’s no way she could afford to pay him half the value. She’s a hair dresser. But she still ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if1l3m/am_i_liable_for_not_reporting_adultery_and_theft/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Vet operated on wrong area",
        "Score": 2,
        "Comments": 0,
        "Post Time": "2025-02-01 04:10:01",
        "Post Content": "\nAs the headline reads, I took my dog into the vet to have a lump on his back, near his tail, checked. Vet took a look, stuck a needle in it and stated it was very dense, and he would recommend removing and having a biopsy done. We scheduled for the next day. Pick my dog up following surgery and we see that his incision is no where near the lump (incision is on the shoulders) and the lump is still present. Ask the vet what happened and he stated he removed the same lump we discussed yesterday. Stated he even saw the aspiration mark from the day before. That is impossible as I was present during the exam and my dog was wearing a harness when he was looking him over. He would of had to remove the harness to aspirate the spot he operated on, which never happened. Further, the lump we wanted removed, has the aspiration mark! Vet tech claims we showed her the spot that was operated on and that’s where she shaved once she took our dog back. His medical records state he saw the needle aspirat",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iey3ww/vet_operated_on_wrong_area/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "My wife messed up tip",
        "Score": 0,
        "Comments": 2,
        "Post Time": "2025-02-01 07:40:50",
        "Post Content": "My wife entered a 40 dollar tip as a 400 dollar tip is it her responsibility to pay it or the business",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if1clx/my_wife_messed_up_tip/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Would I be able to send out an anonymous survey asking my coworkers think of my manager to send to HR? (CA)",
        "Score": 0,
        "Comments": 2,
        "Post Time": "2025-02-01 07:23:18",
        "Post Content": "Hi, I have a manager who started last year that has ruined this place I work at. He’s in charge of my other managers there that I’ve been working with for years, and he decided he didn’t like me off ONE minor incident that was misinterpreted and I tried communicating about already. \n\nWon’t go into detail too much about why I dislike him and how he’s affected my job entirely there to where I had to take on two other jobs to supplement my income, but I’m close with the ~30 other staff members there of various positions and they all express the same grievances. I’ve learned to keep my feelings to myself about coworkers and management, but a lot of my coworkers have gone to me first to vent and complain about this manager. \n\nIt’s clear no one on the staff likes him and he’s creating an extremely hostile environment. When he sees you doing something minor he doesn’t like, he’ll take you off the schedule for the next week or cut you down to one shift with the worst hours. He also often assum",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if142t/would_i_be_able_to_send_out_an_anonymous_survey/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Can I defend someone else?",
        "Score": 1,
        "Comments": 2,
        "Post Time": "2025-02-01 07:19:07",
        "Post Content": "I will start by saying I am in NO WAY trigger happy or looking for a reason to use my gun…but I’m curious on this scenario. My state is a “stand your ground” state, say I’m walking down the street and I see someone with a knife up to their gut by someone else, can I legally pull out my gun and tell them to stop, and if they don’t…can I shoot? I’m prepared for the “ask an attorney” “go to a class” etc etc….again I’m not looking for a reason, I’m up at 2:00AM and thought of what would I do in this scenario which would maybe end me up in jail for murder or is it justifiable force…if I can even use it to defend someone else. Thoughts? TIA",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if11y1/can_i_defend_someone_else/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Inheritance laws farmland",
        "Score": 1,
        "Comments": 1,
        "Post Time": "2025-02-01 07:18:39",
        "Post Content": "My sister wrote her will in 2014. She was a MN resident.\nHer and my siblings inherited SD farmland when our parent died in 2019.\nSince then we each have owned our own parcels and made cash rent from our parcel in our own names. \nNow my sister recently died. So while she had a will for MN her land was never put in a trust nor was it subdivided because it was so small 25 acres, nor was there a directive saying how it should handled. Probate in SD is relatively easy with a will. \n\nQ: since there isn’t a trust involved can the executor keep it as an income generating property? Can she hold onto it long term in that way and/or just sit on the assets and not give them out? Is there a time limit for distributing them out? \n\nQ: how soon after death does an asset like land need to be appraised to determine the stepped up basis? \n\nQ: if she does not settle the estate say within a year then what? ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if11pj/inheritance_laws_farmland/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "I was hit but I didn’t know until after I had already drove off.",
        "Score": 1,
        "Comments": 5,
        "Post Time": "2025-02-01 07:08:54",
        "Post Content": "I was driving around someone trying to turn into a Taco Bell and they immediately turned into me when I was beside them. I thought I had braked in time and turned away enough to avoid the collision but after I got to work I noticed they had clipped my side mirror enough to push it forward. Is this considered a hit and run? ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if0ww2/i_was_hit_but_i_didnt_know_until_after_i_had/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Help lawyer was fired by firm in illinois",
        "Score": 2,
        "Comments": 0,
        "Post Time": "2025-02-01 03:21:58",
        "Post Content": "Help lawyer was fired by firm in illinois \n\nMy lawyer was involved in a drug problem of sorts and was asked to leave the firm, apparently. We don't know what is going on just heard from a friend they just got their retainer back. We will have to call on Monday. He is the only one at the firm that practices family law. We just got a new court date a week ago. But would he keep representing us, he didn't get disbarred as far as I know. Would they give us our money back if they can't represent us anymore? Are we having to start this muti-year process over??? ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iex8vm/help_lawyer_was_fired_by_firm_in_illinois/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Lost tip check, what's up?",
        "Score": 0,
        "Comments": 0,
        "Post Time": "2025-02-01 07:02:06",
        "Post Content": "I am a server in Minnesota, we get credit card tips written out to us each night on a paper check. I lost one check. It was only for $28. The business has said that because it will cost $35 to cancel said check, therefore they cannot write me a new one, because it is more than the check is worth.\n\nIs this legal? Where is that $28 now, and where would it go, if I'm never able to claim it? \n\n  \nPlease help me! It feels wrong and I want to know if I have any options. ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if0tbv/lost_tip_check_whats_up/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Should I call the police on my mother?",
        "Score": 5,
        "Comments": 7,
        "Post Time": "2025-01-31 23:29:46",
        "Post Content": "So I just turned 18 a couple of days ago, I feel this is important because I don't think CPS can get involved anymore. Basically, my mother has a severe gambling addiction (which is technically illegal where we live so I don't know how she does it), and has stolen thousands of dollars from my father and hundreds from myself. It's gotten to the point where she's out gambling all day and all night. I threatened to get her banned from all of the game rooms in town if she kept this up, mainly because I was mad and let it slip. I wasn't supposed to say anything. Regardless, I opened my mouth and now she knows. I did end up getting her banned from all of the game rooms where we live, but now I'm scared that my mother might actually hurt me physically. CPS was involved with my family 2-3 years ago, but I don't know if they can get involved anymore since I'm 18. I'm actually scared of my mother hurting me, as she has done some very questionable things in the past. She kind of almost killed me ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iesmjw/should_i_call_the_police_on_my_mother/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Palm Beach 80 in a 45",
        "Score": 0,
        "Comments": 0,
        "Post Time": "2025-02-01 06:56:45",
        "Post Content": "I very stupidly went 80 in a 45 in boca Raton. I have to go to court now. I once had a ticket for blowing a red light and hired the ticket clinic and it was dismissed. What will happen now??? What should I do??? Helpful comments, only please. I learned my lesson and understand the severity of the situation. Any lawyer recommendations or how to proceed?",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if0qd3/palm_beach_80_in_a_45/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Pulled over for a stock feature",
        "Score": 0,
        "Comments": 0,
        "Post Time": "2025-02-01 06:53:23",
        "Post Content": "I got pulled over today, wasn't speeding or anything and when I asked why I got pulled over he said it was because the ball hitch on the back bumper obscure the license plate. I drive a 1994 Gmc Sierra and that ball hitch came stock on the bumper. Basically my question is do I have to remove an OEM feature or was this just an excuse for a stop?",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if0oo6/pulled_over_for_a_stock_feature/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Money owed",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 06:51:15",
        "Post Content": "I was buying a motorcycle off of a guy and made a down payment on it to go check it next day next day came and something happened and I wasn't able to go check it out and now he's refusing to give the down payment back am I able to bring this up with police at all? I have screenshots of our conversations I have his address his full name and phone number ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if0nmx/money_owed/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "New Jersey: Is This Considered Fair and Legal Under NJ Employment Law?",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 06:45:04",
        "Post Content": "\nMy work entails reviewing scientific documents for accuracy. Shortly before Christmas, I was overwhelmed and overworked (too many projects and not enough time to complete them) and missed a few errors in a document. Instead of discussing these errors with me, my coworker set up a meeting with my boss and the head of the department (who oversees 100+ people) to discuss, I presume, what a horrible job I did. This was all done behind my back without my knowledge. \n\nI realize that I made a mistake: I’m not trying to shift blame here. However, this was the first mistake/disciplinary action I had received. I always received positive feedback and glowing reviews prior to this. My boss set up a meeting with me the following day to discuss these errors and informed me that she had a meeting with said coworker and the head of the department the day prior. She also informed me that I had been taken off all projects/documents until they could establish why these mistakes occurred. She told me she",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if0kgg/new_jersey_is_this_considered_fair_and_legal/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "I'm scared because I might get copyright",
        "Score": 0,
        "Comments": 1,
        "Post Time": "2025-02-01 06:42:19",
        "Post Content": "I have been using Pikachu for every game user. I have modified the name a little for example Pika.Pikachu?. Will I get copyright if I use this name for every game I have and I if go to tournaments using that name?",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if0j2y/im_scared_because_i_might_get_copyright/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Can I sue my dentist for ignoring my severe nerve pain?",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 06:36:20",
        "Post Content": "December 2024 went into the dental office to be seen due to a tooth filling that had fallen off, not experiencing any pain nor discomfort at this time. I was seen by (Dentist A) who recommended a bridge to be placed, prep work for the bridge was done and I was sized for my permanent bridge that same day and a temporary bridge was placed.  I did not have pain nor discomfort after dental work was completed.  I did not experience pain during this time.  January 2025 I came into the dental office and I was seen by (Dentist B) to get my permanent bridge placed.  The bridge was not correctly sized and did not fit correctly.  Dentist B did more “prep” work to the area and another impression was done for the bridge.  Another temporary bridge was placed and I left the office.  Since leaving that office that same day as soon as anesthesia wore off I’ve been in severe 8-9/10 pain constantly that I’ve had to take around the clock OTC medication.  I went in twice to seek attention for my pain with ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if0g2e/can_i_sue_my_dentist_for_ignoring_my_severe_nerve/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Hello a former friend keeps harassing me from different numbers, trying to get me to meet up and fight. What can I do?",
        "Score": 2,
        "Comments": 0,
        "Post Time": "2025-02-01 02:45:17",
        "Post Content": "I have no interest in fighting this person and I want the harassment to stop ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iewkai/hello_a_former_friend_keeps_harassing_me_from/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "[Chicago] Need legal help: Problem with home purchase, HOA and $20,000 Window Replacement Fee",
        "Score": 2,
        "Comments": 0,
        "Post Time": "2025-02-01 02:43:18",
        "Post Content": "I bought a high-rise condo in Chicago at the end of June 2024, renovated it, and moved in by September. In late October, I saw a notice on our floor saying that owners with original windows (installed when the building was built in the 1970s) must replace them by May 2026, or face a $250/day fine. The replacement cost is $20,000. I ignored the notice, thinking I’d receive a formal notification from the HOA if it was serious.\n\nWhen I asked the HOA about it recently, they confirmed I must replace the windows by the deadline. They also said this requirement should have been listed in the legal documents I signed when I bought the condo. I went over all my documents with my attorney (including the pay assessment letter and 22.1 disclosure), but this requirement was nowhere to be found.\n\nI checked the board meeting minutes and discovered the board made this decision before I purchased the condo. When I asked the HOA for clarification, they simply told me, “I cannot answer your question anym",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iewj02/chicago_need_legal_help_problem_with_home/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Landlord illegally rentedout a room in her coop to me, never gave written lease, never a 30 day notice, and is doing illegal eviction- HELP!!",
        "Score": 0,
        "Comments": 0,
        "Post Time": "2025-02-01 06:25:18",
        "Post Content": "She obtained a judgment of possession by misrepresenting her case and defrauding the court and now I filed order to show cause with proof of all of her illegal actions but I need to know if I should countersue in this case or sue in a separate civil suit . And if so how much can I sue for punitive, monetary, compensatory damages? ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if0abb/landlord_illegally_rentedout_a_room_in_her_coop/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Former Housemates Stole My Deposit—Do I Have Any Legal or Other Options?",
        "Score": 2,
        "Comments": 1,
        "Post Time": "2025-02-01 02:38:41",
        "Post Content": "In 2020, I lived in a shared house in Washington, D.C., with five others. There was no formal lease with the landlord—just a spoken agreement (though there may have been an informal written contract between some housemates and the landlord). The way deposits worked was that each new tenant would pay the deposit to the outgoing tenant, and that’s how we all got our deposits back.\n\nI moved out at the end of September 2020, having fully paid my rent. In October, I found a replacement tenant, and she paid the deposit to my former housemates, as was the practice. Instead of passing it on to me, they kept the entire deposit. At first, they said they’d use half of it to pay rent (which wasn’t their place to decide) and give me the other half. Later, they said they would only send me a quarter. In the end, they never sent me anything and just ghosted me.\n\nI was really hurt by this and didn’t pursue legal action at the time, but looking back, that money could have grown significantly over the y",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iewg1b/former_housemates_stole_my_depositdo_i_have_any/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "60 Day Notice",
        "Score": 3,
        "Comments": 4,
        "Post Time": "2025-02-01 00:18:29",
        "Post Content": "I gave my landlord our 60 day notice this morning at 10 and told them we’d be leaving on March 31 when our lease is up. He emailed back that 60 days out would be April 1 and they’re going to charge us another months rent due to that. But it’s exactly 60 days from today so I don’t understand? The lease said 60 days not 61. Any advice?",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ietojc/60_day_notice/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Needing advice",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 06:12:07",
        "Post Content": "Hi! So I’m pregnant with twins, and the father and I were engaged to be married, but I broke it off after realizing how incapable he is of being an adult and growing. \nI can tell this is heading somewhere very nasty, as he’s threatened that he’s going to take the kids once they’re born. He has threatened calling dhr on me for my other children, although I truly don’t have any reason to be concerned as far as dhr goes.\nThere’s been abuse involved, and I know that I should’ve filed charges or atleast have had some sort of documentation legally in regard to all the altercations (other than calling the police). I have dated documentation, photos, videos and audio of all the things he’s put me through. Even going as far as ones of him mentioning he was going to kill me. \nHe’s living with me, but I told him he needed to find somewhere else to lie his head because he can’t stay here anymore, as it’s just making my pregnancy and general life miserable. He will likely be homeless as he’s ruined",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if03bm/needing_advice/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "My Aunt wrecked my grandmother's house and stole my grandfathers ashes.",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 06:10:43",
        "Post Content": "My family is from New Jersey, but I grew up for many years in Alabama, and have been living and working in the South. When my grandfather started struggling with lung cancer, they came down to Alabama for the better weather and because they liked the doctors down here. My Aunt and Uncle, who were bankrupt, had been staying in the family home, and my grandparents were happy to have them and let them stay, provided they paid for utilities and covered the taxes and basic expenses. This was normal practice amongst us with the home. There was no formal lease: members of the family have been moving in and out of the house since at least the 1950s, and myself, my mother, and others aunts and uncles have all lived there, moved out, moved back, etc. Over the years. My grandfather passed about 5 years ago. \n\nThen, my aunt and uncle (who were the main consistent ones living at the property over the years, as they had children in school) stopped maintaining the house. No insulation touch ups, yard",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if02ln/my_aunt_wrecked_my_grandmothers_house_and_stole/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Going bankrupt because of lawsuit while married",
        "Score": 1,
        "Comments": 6,
        "Post Time": "2025-02-01 06:07:56",
        "Post Content": "Hello! I'm in a lawsuit due to a car crash that happened 5 years ago. I was in fault and caused a few injuries to myself and someone else, based on the police report and a security camera I was at fault.\n\nI recently married my spouse about 2 months ago, and told them about the lawsuit. Both of us are young and immature and didn't properly research what exactly that entails.\n\nI am planning on filing for bankruptcy chapter 7 due to the debt that the lawsuit will entail.\n\nWill this lawsuit affect my spouse in any way? Can I still file for chapter 7 bankruptcy? I live in California\n\nAny feedback or information on my case will be appreciated",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1if013q/going_bankrupt_because_of_lawsuit_while_married/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Is a lawyer worth it?",
        "Score": 1,
        "Comments": 2,
        "Post Time": "2025-02-01 06:03:52",
        "Post Content": "I am a 18f whose mother passed away and I live with my 37 year old dad. About 10 years ago when I was little he got prison time for snatching a ladies purse and running with it but was chased and he got charged and took a strike. He has had no run ins with the law since and has been on a straight and narrow path and stepped up to raise me after my mom passed. This is in California. He recently was charged with assault on an officer and evading arrest. The assault on an officer is due to an officer reaching his hand into the vehicle as my dad was trying to put the car in gear and the cop held on for a few seconds before letting go. The police report officially reads “drug an officer 15 feet” which is a stretch as I’ve seen the footage. I spoke to his public defender and asked him to be straight up with me about getting a lawyer and he said he didn’t think it would change anything, but I feel like that isn’t true. He is officially pleading guilty. Due to his priors his time will be autom",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iezysz/is_a_lawyer_worth_it/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "New Jersey: Is This Considered Fair and Legal Under NJ Employment Law?",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 06:03:50",
        "Post Content": "My work entails reviewing scientific documents for accuracy. Shortly before Christmas, I was overwhelmed and overworked (too many projects and not enough time to complete them) and missed a few errors in a document. Instead of discussing these errors with me, my coworker set up a meeting with my boss and the head of the department (who oversees 100+ people) to discuss (I presume) what a horrible job I did. This was all done behind my back without my knowledge. \n\nI realize that I made a mistake, I’m not trying to shift blame here. However, this was the first mistake/disciplinary action I had received. I had always received positive feedback and glowing reviews prior to this. My boss set up a meeting with me the following day to discuss these errors and informed me that she had a meeting with said coworker and the head of the department the day prior. She also informed me that I had been taken off all projects/documents until they could establish why these mistakes occurred. She told me ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iezyrv/new_jersey_is_this_considered_fair_and_legal/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "I have the same name but I am not that person",
        "Score": 15,
        "Comments": 2,
        "Post Time": "2025-01-31 15:13:31",
        "Post Content": "I am being charged with a misdemeanor for operating a business without a license. I don't own a business, but someone with the exact same name as me does. I kept hoping I could explain my way out of this before arraignment or at arraignment, but now the case is scheduled for a pre-trial hearing.\n\n  \nAt the arraignment the judge said any evidence I want to submit needs to be presented to the court before pre-trial.\n\n1. How do I submit evidence that I am a different person?\n2. How do I actually give the court that evidence?",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iegyri/i_have_the_same_name_but_i_am_not_that_person/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Treble damages",
        "Score": 0,
        "Comments": 0,
        "Post Time": "2025-02-01 05:52:03",
        "Post Content": "Hello!\n\nMy question is simple. I will attach the story below but I am wondering if according to century code I can sue for 5,000 (the amount of damages accused) x3 or 3,000 (1,000 deposit) x3? \n\nThank you!\n\nTHIS IS FRAUD:\n\nI lived in the Crestwood Manor apartment managed and owned by Valley Rental. A one bedroom. The total square feet of that apartment is about 700 square feet. I couldn’t for the life of me figure out why the flooring repair cost me 5,000 dollars. Well today I had a closer look. \nMy bedroom and living room were carpet. And the bathroom and kitchen were vinyl. \n\nHere is a picture of vinyl I left in my kitchen as well as the exact apartment and square footing. (see attached)\n\nYou’ll see in the vendor receipt (I circled the items) that 564 square feet of the replacemnt was VINYL PLANK. I found the exact one on Carpet Worlds website (see attached). Only 200 square feet of the replacement was carpet. That means they put more vinyl planks then carpet in my apartment post mov",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iezry0/treble_damages/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "My personnel file is missing",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 05:40:26",
        "Post Content": "I work for USPS \nI am currently out on 12 weeks FMLA \nI got a notice of removal letter today (we gunna fire you letter) \nIn it, it states that my personnel file is missing. Missing. \nI am having anxiety attack. I don’t know how personal it is. How intimate it is of my work history and what personal documents like my driver license copy SSI card my DD214 things that could steal my identity.  I contacted some higher ups and the union but what else can I do? ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iezliq/my_personnel_file_is_missing/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Ticket for a 93 in a 60",
        "Score": 0,
        "Comments": 4,
        "Post Time": "2025-02-01 05:40:11",
        "Post Content": "\nFirst ticket:\n\nI changed from right to left lines to avoid traffic pilling up but never realized everyone was hiding behind a cop\n\nI switched lanes, seen the officer and mashed the brakes a little and was probably in the 70 mph range; he supposedly clocked me on a rear facing moving radar\n\nI have a mandatory court date and I'm just wondering how I can avoid points on my license\n\nAlso, i dont know if it matters but he did just hand me my ticket without saying much and never made me sign anything",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iezle3/ticket_for_a_93_in_a_60/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Is it legal in GA?",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 05:35:13",
        "Post Content": "Is it legal to get a New Hampshire non resident pistol license at 19 and carry in GA? As far as I’ve seen New Hampshire will issue a permit but I’m not sure if GA will accept a non resident permit.",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iezilr/is_it_legal_in_ga/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Commercial building security concerns",
        "Score": 1,
        "Comments": 1,
        "Post Time": "2025-02-01 05:24:29",
        "Post Content": "To put it simple. My employer is a tenant in a commercial building shopping center, and vehicles are constantly being stolen, vandalized, broken into. The building has many blind spots and very little cameras and fails to catch most of the crimes. What can be done so the building increases security measures. What course of action can I take? Is the building responsible or liable to add extra measures to increase security for tenants and visitors.",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iezcfb/commercial_building_security_concerns/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Plaintiff request entry of default and trial, but I responded",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 05:23:10",
        "Post Content": "So I received an unlawful detainer for not paying rent, (even though I did they just didn't accept it) and I filed a response immediately and am waiting for trial. I've looked online and called the courthouse and waited and have received nothing regarding a court date. in the meantime I have seemed legal advice and gather my documents. Today I got a letter that the lawyers/plaintiff are requesting a non jury trial and requesting entry if default. But I responded. are they allowed to do that? What are my next steps regarding this. This is making me incredibly anxious because I have paid rent and they are screwing me for god knows why",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iezboa/plaintiff_request_entry_of_default_and_trial_but/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "My old ex from 3 years ago still has explicit photos of me and posts them in a group chat without my permission, what should I do?",
        "Score": 1,
        "Comments": 1,
        "Post Time": "2025-02-01 05:21:31",
        "Post Content": "I just had gotten some interesting news from a friend of mine tonight that, explicit photos of me that were promised they would not be shared with anyone, have been posted in a group chat without my permission or me even knowing about it. At the time I had sent those photos to my ex I was 16-17 years old, and for some reason he still has them, I don’t feel comfortable with him sending those photos to anyone cause at the time I was underage and under the impression that those photos were NOT going to be shared and deleted immediately, currently I’m over 18 and so is he. i want to know what I should do about it.",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iezaqb/my_old_ex_from_3_years_ago_still_has_explicit/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Eviction (Washington State)",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 05:21:07",
        "Post Content": "My landlord served me and eviction notice for non-payment. I was *never* given a 14 day notice. I was sent a letter twice that states I could renew my lease if the amount owed was paid in full by the 31st of this month. I communicated that I wanted to set up a payment plan and the office never responded and is continuing to ignore me when I told them I never got the 14 day notice they’ve included in the eviction paperwork. \nWe’ve worked this out in the past, although I have paid late before I’ve always paid monthly and stayed caught up on rent until this month (1 year lease). \n\nI “make too much” to get a low income lawyer even though I’m scraping by. ‘Moderate means’ that’s supposed to help my earning class isn’t taking any intake until FALL. I cannot afford a lawyer, if I am evicted I can’t even afford to move. \n\nWhat should I do now? ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iezaii/eviction_washington_state/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Sent in a passport for a name/gender change. want to cancel it before the application finishes processing, will the state dept remember my name change? (oregon USA)",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 05:20:32",
        "Post Content": "The way i though name change court orders work is that it doesent legally change your name, it gives you the ability to request your name to be changed with goverment agencies. i am worried about dealing with all of the bullshit and targeting that could come from being legally trans in the future, and the fact that my docs might be indefinitely on suspension, and that i will probably only get the name half of the name/gender change. It was the first document i sent out for a name/gender change because i heard about what the trump admin planned to do, then things moved much faster in terms of interfering with passports for trans people then i though.  \n  \nI sent in a letter to the state dept requesting a cancellation of my application, but after talking it over with some other people, they told me that the court order really is the thing that changes your legal name, and i'm wondering if they where correct? or if that cancellation letter is followed, if i will end up with my legal name ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieza73/sent_in_a_passport_for_a_namegender_change_want/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Can leasemate legally record me inside the house? [DC]",
        "Score": 1,
        "Comments": 1,
        "Post Time": "2025-02-01 05:18:19",
        "Post Content": "So, my leasemate and I have had an agreement where I would be living in the bedroom and he would be living in the hall with another guy sharing the space. We divided the rent in such a way that we end up paying a fair share(me paying more since I occupy the room and it is private). We also had a verbal agreement that anyone could come and watch tv in the hall without issues. \n\nHe has set up a camera inside in his space which can basically record the entire hall. One day, my girlfriend, who is not on the lease, was over and we were sitting on the sofa (which doesn’t belong to him) situated in the hall and watching tv. We made out on the couch had conversations and that was it. No sex. \n\nIt was later that we came to know that he clipped the recordings and has been showing those to other people and is badmouthing us (its a bit taboo to do this in our culture outside of marriage, to which all three of us belong). \n\nHe also took videos of my room while the both of us were not there and shar",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iez8y9/can_leasemate_legally_record_me_inside_the_house/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Summoned to court",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 05:14:34",
        "Post Content": "Hello, hoping someone can help me figure out what’s going on.\n\nMy son’s father sent me a text saying he received a letter in the mail stating he and I needed to appear in court in his city. He also asked me if I filed for custody which I told him I didn’t. I asked him to send me a screenshot of the letter but he has conveniently stopped answering my calls and texts. He does pay child support but I live in a different county from him and he pays it to my county. Can anyone explain what this might be about? I’m kinda freaking out here!",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iez6t0/summoned_to_court/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Constructive dismissal?",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 05:10:21",
        "Post Content": "I think my job is trying to get me to quit. Long story short, due to a staffing issue I was asked to temporarily work in a different area 1.5 hours from my home. It’s now been a year and suddenly my schedule has been changed fully with the issue being that one week a month I’m shifted 10 hour shifts(not including the drive home) 7-8 days in a row. Essentially I’m working 11.5 hours daily for week straight some days on my own covering an entire area. Upon asking my manager if an accommodation could be made to account for the travel time so I could be home by a reasonable time I was told they would “look into it” but nothing has come of it. It would benefit them if I left because they would be able to hire directly in the area I’m commuting to does this seem like constructive dismissal? I live in Florida if it’s relevant ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iez4cu/constructive_dismissal/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Sewage Backup",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 05:06:52",
        "Post Content": "Looking for legal advice… I had sewage backup in my home and it was found that the blockage was on city lines. The city workers told me that the street I live on is “always an issue” and when they perform maintenance they don’t use a camera so they “don’t really know if they fix the issue” each summer. I filed a claim with the city but they were found not responsible so I am expected to cover all the expenses myself. I can file a claim with my homeowners insurance but it will only cover about 25% of my expenses. \n\nI am wanting to hire a lawyer and claim the city was negligent because their maintenance plan isn’t good enough. They did maintain the line over the summer but they straight up told me they didn’t use a camera so they have no idea if they fix the problem. And the city owns a camera so they had the option to use it and chose not to. Wondering if I have a case or if anyone has been through this before. Thanks!",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1iez2b3/sewage_backup/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Should I plea innocent or guilty on a badly written ticket?",
        "Score": 0,
        "Comments": 9,
        "Post Time": "2025-02-01 04:52:05",
        "Post Content": "So I got pulled over for speeding. In Illinois, Johnsburg county. \n19 over. No big deal. It was my first time. I’m Looking at the ticket, the copy part that you’re supposed to mail in with your check and I noticed that the officer wrote incredibly lightly on the main page and the violation parts is completely unmarked. No boxes crossed out. No nature of offense written down.\n\nSo i’m thinking if I plea guilty, send in the money, would they throw it out because they don’t know what the hell i’d have gotten a ticket for because it's unmarked?",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieyt5i/should_i_plea_innocent_or_guilty_on_a_badly/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Work took bonus back but they made error",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 04:48:41",
        "Post Content": "\nI posted previously about this is another forum, but the situation did not get resolved and personally seems a little sketch. I was supposed to receive a bonus at 6 months and a year. I received both bonuses at 6 months, emailed hr to let them know twice and they stopped responding. They didn’t give me the bonus at a year so I just assumed ok it’s because they must have realized they gave me both at June. I’m leaving full time, my contract states if I don’t stay a year after the checks then I have to pay it prorated “from the date I received the checks”. They are prorating it like I got the one in November and then in June. They are stating that yes they acknowledged the mistake and moving forward will make sure they don’t make that error again for someone else and their solution was to immediately return 500 to me and then take that back next check since my check was short 1000 since they paid out some pto. They didn’t inform me when I switched to contigent that hey, heads up, we are",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieyr5k/work_took_bonus_back_but_they_made_error/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Should my Dad sue?",
        "Score": 1,
        "Comments": 13,
        "Post Time": "2025-02-01 04:46:48",
        "Post Content": "My dad is a career laborer who has always worked with his hands. He worked for a mill in Siskiyou County California and recently had his hand maimed which resulted in the loss of a significant portion of his left middle finger and the first digit of his leg pointer finger.\n\nWhen I called to talk to him about this he brushed it aways and said he was fine besides the nightmares about being pulled into the machine. He said that the machine he was working with had no guard on it and the owner was willing to comp him 30k.\n\nI think this is entirely too low and that my dad should be way angrier about this and demand more. He turns 50 this year and has always worked with his hands, this loss of dexterity presents a lowering of his ability to work and quality of life. I'd want to see a way larger settlement to my dad, at least enough to get him to retirement age so he can draw from ssi. Base don those nightmares he clearly has emotional damage even though he won't admit it. It's a small town se",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieyq1w/should_my_dad_sue/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Mother wants to switch house into my name",
        "Score": 1,
        "Comments": 2,
        "Post Time": "2025-02-01 04:40:57",
        "Post Content": "We are in Ohio first off. My mother recently paid the house that I live in off. It’s her house, but we’ve been paying the house payment the last several years along with all upkeep. We’ve remodeled a little over half the house and have added about 200 sq ft of living space since living here. We’ve also paid the property taxes except one year. She wants to just put the house in my name now. She doesn’t live here, she moved into my grandmothers house and is going to inherit it eventually. I’ve tried google and I really can’t find a straight answer if we can just transfer it over with no issue. I assume I’ll have to pay something and would like at least an idea of how much that will be. I didn’t expect this until at least next year which tells me she’s been paying more than the set amount for the mortgage. Any advice is appreciated, if I left anything important out let me know! I’d be happy to clarify. ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieymji/mother_wants_to_switch_house_into_my_name/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Ferry Employee Harassed Me Over My Disability – What Can I Do?",
        "Score": 650,
        "Comments": 17,
        "Post Time": "2025-01-30 17:30:29",
        "Post Content": "I take the the ferry to school every day and use my TAP card to get the reduced fare for disabled riders. I’m a disabled veteran and have never had an issue using it—until today.\n\nAt the ticket counter, a woman I had never seen before tried to charge me full price instead of the reduced fare. When I told her I had my TAP card, she took it and started questioning me about why I am disabled.\n\nI told her I’m a disabled veteran, and she responded, “You don’t get it for being a veteran.” I clarified that I am a disabled veteran, and she kept pushing, repeatedly asking what was wrong with me.\n\nI told her I wasn’t going to tell her, but she wouldn’t drop it. She kept pressing for specifics about my disability, which was humiliating.\n\nI started having an anxiety attack and could barely respond at the end. Finally, she processed my reduced fare but said, “Fine, I’ll give it to you, but I’m questioning it.”\n\nThat was humiliating—she was basically implying I was lying despite me having official d",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1idscjy/ferry_employee_harassed_me_over_my_disability/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Can I sue for HIPAA violation?",
        "Score": 0,
        "Comments": 5,
        "Post Time": "2025-02-01 04:35:38",
        "Post Content": "*changing some details for privacy reasons\n\nMy “friend” called 911 for a medical emergency and EMTs responded and took them to the hospital. My friend does not believe they received proper medical care from the EMTs and actually think their condition may be worse as a result of the delay in support. They have contacted the local municipality about this and the responders are now under investigation.\n\nPossible HIPAA violation:\nUpon the investigation, the EMTs tried to minimize my friend’s concerns/accusations by using some of my friend’s medical history against them (ex: telling people my friend has a history of drug use). To be clear, this information is not only being shared with the individuals conducting the investigation on the EMT but also their coworkers and they are using my friend’s name. Obviously my friend is hurt when she found out (she had some mutual friends that worked there that told her) and wants to know if she should pursue further legal action.\n\nEdit to add: this is ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieyjd2/can_i_sue_for_hipaa_violation/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Can I get a video taken down from Instagram?",
        "Score": 0,
        "Comments": 2,
        "Post Time": "2025-02-01 04:32:25",
        "Post Content": "Hello everyone,\n\nMy sister is severely autistic and also has some other challenges. She is over 18. The other night, she had an episode, and we couldn’t find her, so we had to call the police. The police informed us that they had a report matching her description, and sure enough, it was her. She was brought home safely.\n\nLater, a friend sent us a video of my sister knocking on a door at 1:30 AM. I understand this could be frightening for the family. I also understand (though I think this is legal) that they can post the video because it was taken on their property.\n\nWhat we are concerned about, however, is that the video was shared on an Instagram account for our area, with the person who runs the account adding a voiceover telling people to “bash her head in” when they see her. The video is about two minutes long and contains many disgusting remarks. My family has already reported it, but I’m not sure what Instagram’s response time is.\n\nIn the meantime, is there a way for us to legal",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieyhh5/can_i_get_a_video_taken_down_from_instagram/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "What type of lawyer",
        "Score": 2,
        "Comments": 1,
        "Post Time": "2025-02-01 00:45:26",
        "Post Content": "I have been looking for a lawyer for the past few days in Virginia, since I received a notice about a zoning violation. What type of lawyer should I be looking for? \nI tried calling the state bar association described the problem and got no referral. I've tried real estate, and civil s well a a few criminal defense attorneys based on recommendations, none have been interested and all seem to refer to each other.\nAny advice on what type of lawyer I need would be appreciated.",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieu8rv/what_type_of_lawyer/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "My parents say they can claim me. I don’t think they can. Who’s correct?",
        "Score": 1,
        "Comments": 5,
        "Post Time": "2025-02-01 04:29:54",
        "Post Content": "I’ve posted this in a couple subreddits, but I just wanted to get some second opinions just to be sure\n\nI [19M] have been living independently since October 2024. When I filed my taxes a few days ago, I said that I could not be claimed as a dependent for the following reasons:\n\n- I wasn’t a student in 2024\n- I was 19 years old at the end of 2024\n- I made more than $5,050 in 2024\n\nMy parents are now saying that I screwed them out of $2,100 and that I was eligible to be claimed as a dependent because I lived with them for 10 months of the year. My mom is even saying she can’t file her taxes until I amend mine because she needs to be able to claim me. I’m fairly certain I’m correct, but I figured I would get second opinions before amending my tax return. Thanks in advance",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieyfyd/my_parents_say_they_can_claim_me_i_dont_think/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Should I pursue legal action",
        "Score": 1,
        "Comments": 3,
        "Post Time": "2025-02-01 04:28:26",
        "Post Content": "I am 100% not at fault for a car accident where I was waiting at a complete stop for an exit and a guy rear ended me which caused my car to be totaled and sent to the hospital. I was told on my insurance policy that I have “limitation on lawsuit” which means it would be very hard to sue the other person but I have constant pain in my shoulder and back and cannot work. For background this happened in New Jersey. ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieyf49/should_i_pursue_legal_action/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "22M  I want to sue my EX",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 04:26:08",
        "Post Content": "She’s screwed me over in so many ways but I’m going to try to keep this simple\n• i have a kid with her (2M)\n• we co-signed on an apartment lease in June 2023\n• we renewed the lease the following year at the end of may 2024\n• rent was about 1,500\n• I was a victim of her domestic violence for 2-3 years\n• she opened a DCFS(department of child and family services) case mid October 2023 against me (I fought back after being beaten for the 4th time that week) (yes I’m in the wrong.)\n• the DCFS case ended July 12th 2024\n• I was not going to co-sign the apartment but she manipulated me causing me to feel obligated to otherwise my son wouldn’t have a place live\n• I paid her mom 1000$ for rent and was kicked out on July 13th 2024 at midnight\n• she filed a restraining order some time in early July 2024 and did not show up for court so the order was dismissed however she showed it to the apartments and took her name off the lease with nobody notifying me until I was alerted to an eviction notice a",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieydt3/22m_i_want_to_sue_my_ex/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Question about breaking a lease due to suicide in Florida",
        "Score": 1,
        "Comments": 0,
        "Post Time": "2025-02-01 04:25:01",
        "Post Content": "My best friend and his girlfriend have an apartment in Palm Harbor, Florida, their names are both on the lease. She committed suicide tonight. He does not want to live in the apartment where she did it. He wants to break the lease. Is that possible without penalties?\n\nThank you so much ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieyd64/question_about_breaking_a_lease_due_to_suicide_in/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "My current job is trying to prevent me from moving to a different department",
        "Score": 2,
        "Comments": 0,
        "Post Time": "2025-02-01 00:38:49",
        "Post Content": "I'm in Iowa but both places' main offices are based in Nebraska, I believe. I work for a private company contracted under a bigger company. I'm trying to switch to another department. I do the interviews according to the rules of my job (off the clock, out of the building) and both times I was told I did great in the interviews and all that was needed was to start a background check.\n\n The first time I was not sent any email to start my background check, I waited 2 months, only for info to leak out that my job was strongarming the company into not hiring me because they are losing a lot of people due to us not getting raises,  better benefits, etc. I just completed a new interview two days ago, so I'm still in the \"it could happen\" phase of getting the email. Regardless, what should I do if it happens again? Is what they're doing legal? I really want this job for the amazing benefits and pay.",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieu3v7/my_current_job_is_trying_to_prevent_me_from/"
    },
    {
        "Subreddit": "LegalAdvice",
        "Title": "Judgement over 10 years old",
        "Score": 4,
        "Comments": 0,
        "Post Time": "2025-01-31 20:51:20",
        "Post Content": "(North Carolina) I have a judgement against me that is over 10 years old. I am trying to figure out how to see if it was renewed or not. Is this something I should be able to find on the court’s case search, or will I need to hire a lawyer to research it? If I do need a lawyer, what sort should I look for? ",
        "URL": "https://www.reddit.com/r/legaladvice/comments/1ieoza9/judgement_over_10_years_old/"
    }
]